{
    "items": [
        {
            "title": "Believe them when they tell you AI will take your job:",
            "author": "tall_chap",
            "text": "[External Link]",
            "subreddit": "ControlProblem",
            "comments": [
                {
                    "author": "EthanJHurst",
                    "text": "Do you people actually **want** to waste your lives working to make someone else rich? Isn’t **the whole fucking point of AI** that we **don’t** have to do that anymore?"
                },
                {
                    "author": "ThenExtension9196",
                    "text": "And nobody is gunna save you. Buckle up."
                },
                {
                    "author": "egg_breakfast",
                    "text": ">In the fullness of time, it's going to many more, uh, higher quality and better paid opportunities than we've had in the past\n\nThe right follow up question to this is, what is the ratio of those positions to the ones that were lost? 1 to 100?\n\n>I, I, I haven't really thought about, you know, specifically, specific categories of jobs\n\nlol."
                },
                {
                    "author": "EmbassyMiniPainting",
                    "text": "Gonna have to Mr. Robot all this Ai at the source."
                }
            ]
        },
        {
            "title": "Google DeepMind CEO Demis Hassabis says AGI that is robust across all cognitive tasks and can invent its own hypotheses and conjectures about science is 3-5 years away",
            "author": "chillinewman",
            "text": "[External Link]",
            "subreddit": "ControlProblem",
            "comments": [
                {
                    "author": "Routine_Bake5794",
                    "text": "Gemini can't count correctly the words in a simple text.",
                    "replies": [
                        {
                            "author": "chairmanskitty",
                            "text": "You can't write as good poetry as Gemini."
                        }
                    ]
                }
            ]
        },
        {
            "title": "AI governance research process",
            "author": "katxwoods",
            "text": "[External Link]",
            "subreddit": "ControlProblem",
            "comments": [
                {
                    "author": "TyrKiyote",
                    "text": "You can assert your human rights and use your voice."
                }
            ]
        },
        {
            "title": "Is AI making us dumb and destroying our critical thinking | AI is saving money, time, and energy but in return it might be taking away one of the most precious natural gifts humans have.",
            "author": "chillinewman",
            "text": "[External Link]",
            "subreddit": "ControlProblem",
            "comments": [
                {
                    "author": "NoDoctor2061",
                    "text": "Do not attribute the user error as a flaw of the machine.\n\nBefore AI we struggled to find adequate sources and information. We'd only be exposed by algorithms to one sided views and biased information, or nonsense that might not be applicable. Hours of pointless searches for crumbs of data, now compacted with flaws and all before us.\n\nCan we blindly trust it? No. But doing anything without diligence in life, is foolishness.\n\nAI has enriched our lives by millionfold and will evermore. If one finds that their lives are worsened by its presence, it's the users fault for either incorrect usage, or ignorance."
                },
                {
                    "author": "UndefinedFemur",
                    "text": "If anything it’s made me smarter than ever. I can learn so much faster now. I can’t comment on humanity as a whole though. Maybe the ability to use AI as a tool to better ourselves will end up being a new form of natural selection; if you let your brain wither away by letting AI do all your thinking for you, then… 🤷‍♀️",
                    "replies": [
                        {
                            "author": "chillinewman",
                            "text": "\nThe less educated, don't check what the AI says and take it as truth, according to the study."
                        }
                    ]
                },
                {
                    "author": "chillinewman",
                    "text": "Slowly losing control to an AI while growing more dependent.",
                    "replies": [
                        {
                            "author": "NullHypothesisCicada",
                            "text": "Go get some fresh air bro"
                        }
                    ]
                },
                {
                    "author": "EthanJHurst",
                    "text": "This is like saying clothes keep us warm but take away the important human function of being cold.\n\nPointless fear mongering.",
                    "replies": [
                        {
                            "author": "Thisguyisgarbage",
                            "text": "Not at all. A closer analogy would be spellcheckers placing a limit on the necessity to write without errors. Sure, it’s technically fine…but it does make us more independent.\n\nIt makes me think of Player Piano. There’s something to the idea that people don’t actually enjoy lost autonomy. And that feeling useless is bad for the soul. I’m not sure I like the idea of a Wall-e style utopia, where the computers do everything for us. Is a life of leisure the dream?",
                            "replies": [
                                {
                                    "author": "EthanJHurst",
                                    "text": "It’s not like humans are born with the ability to write. Normalizing the threshold for learning so that everyone has a chance to perform at a high level is a **very good** thing."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "demureboy",
                    "text": "ai please take away my intelligence i want to be dumb and happy",
                    "replies": [
                        {
                            "author": "fried_egg_jellyfishh",
                            "text": "u already so dum an happy. not possible anymore"
                        }
                    ]
                }
            ]
        }
    ]
}