{
    "items": [
        {
            "title": "Is $10k too much for an influencer with 1M followers?",
            "author": "neverviraly",
            "text": "I have a SaaS product and this tech influencer wants $10k for one post. They have 1M followers and decent engagement in the tech space. Most of their content is about general tech though (product reviews both hardware and software). I've seen others charge way more but also way less. \n\nSome people are telling me to go with micro influencers instead. Has anyone had any success with these big influencers? Would it be better if I promoted it with a bunch of smaller creators instead of one big creator? ",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "Babayaga1664",
                    "text": "Be scientific.\n\nAre they in your sector?\nHave they prompted products before - has it led to sales ?\nWhat does your product cost - how many sales to recover the $10k cost?",
                    "replies": [
                        {
                            "author": "wallstreetchills",
                            "text": "This. Get insights into how other promos performed.",
                            "replies": [
                                {
                                    "author": "_DuranDuran_",
                                    "text": "Yep - it’s called ROAS.\n\nUnless it’s brand awareness you want, that might pay off in the future, if your ROAS is negative, it’s a bad deal."
                                }
                            ]
                        },
                        {
                            "author": "nothingbutbusiness1",
                            "text": "A calculation like:\n\n1M * (percentage of people potentially interested) * 2% conversion rate * value of customer\n\nMight do it? If that figure isn't over 10k,then they're asking too much. I suppose you also could consider the potential marketing benefit if that influencer was good for your business to be associated with"
                        },
                        {
                            "author": "BIGA670",
                            "text": "You’re not gonna get an ROI.  \n\nIf you’re curious, try with a small creator that deals with SaaS products first so you don’t get ripped off."
                        },
                        {
                            "author": "your_debot",
                            "text": "Also are followers real or not? Nowadays even engagement can be bought."
                        },
                        {
                            "author": "mackfactor",
                            "text": "Yup - the number of followers means nothing if they're not the market you're shooting for. Is the SaaS for businesses or consumers? If business, what size? And does the influencer's content also sync to that audience? If you (OP) didn't have those questions answered, that's the first step. "
                        }
                    ]
                },
                {
                    "author": "darkhorsehance",
                    "text": "Need to know the engagement rate, the platform, type of content, etc. \n\nA 3 minute TikTok video with an influencer who has an engagement rate of 4% is going to be different than an IG photo with a 1% rate. \n\nSince it’s general tech and not exactly your niche, I’d say high it’s high unless they have >3% engagement."
                },
                {
                    "author": "ivereddithaveyou",
                    "text": "Its better to structure the deal so that they get a percentage of sales that they drive. You can offer them a small base and a unique discount code. If they scoff at this offer then you know that they can't do it or they don't really believe your product can do it. Either way is a win for you.",
                    "replies": [
                        {
                            "author": "LivingForTheJourney",
                            "text": "As a creator I have been screwed over so many times using that model that I completely stopped. In a few cases they fumbled the code or the link to the point where they weren’t showing any clicks or engagement at all even on millions of views on niche specific videos.\n\nIt’s practically begging to get fucked over. Took me several tens of thousands of dollars in losses to learn that lesson."
                        },
                        {
                            "author": "BoydKKKPecker",
                            "text": "I was coming to say the same. I've had influencers reach out, and I tell them I'll give them a percentage, but I would probably never just pay them an upfront payment.",
                            "replies": [
                                {
                                    "author": "VisWare",
                                    "text": "Haha if you have influencers reach out then it means they need you more than you need them"
                                }
                            ]
                        },
                        {
                            "author": "Cap-eleven",
                            "text": "you'll spend more than $10k trying to instrument and track what lead should have been attributed to the \"influencer\" \n\nCampaign ROI is notoriously difficult to calculate accurately. I see so many early stage companies make these kind of revenue share agreements, which they then regret years down the road."
                        },
                        {
                            "author": "Bea-Billionaire",
                            "text": "Sadly this doesn't work anymore. You're talking about affiliate marketing. All these greedy influences want cash up front and if you don't make an ROI welp too bad onto their next victim",
                            "replies": [
                                {
                                    "author": "iceman123454576",
                                    "text": "You don't need influencers in your marketing strategy. When did this became so important? The ROI is abysmal.\n\nU might as well use the capital for UGC or paid ads."
                                }
                            ]
                        },
                        {
                            "author": "GirlYouPlayin",
                            "text": "What? Creators hate this and this type of deal hasn't been popular for like a decade."
                        },
                        {
                            "author": "Trawzor",
                            "text": "Few influencers would accept that model, its way too easy for the company to simply lie and show that your link generated less clicks than it actually did."
                        },
                        {
                            "author": "TheGuyBehindAnything",
                            "text": "This. Add a starting fee to that as a hook.",
                            "replies": [
                                {
                                    "author": "ivereddithaveyou",
                                    "text": "Whats a starting fee? The same as a small base I presume. :)"
                                }
                            ]
                        },
                        {
                            "author": "seabass160",
                            "text": "They wont do that sadly"
                        },
                        {
                            "author": "mistersilver007",
                            "text": "Ya as a creator this is not a model that appeals to us."
                        },
                        {
                            "author": "wouldntknowever",
                            "text": "Creators genuinely don’t work on consignment otherwise their page would be filled with spam."
                        },
                        {
                            "author": "cadmiumred",
                            "text": "spoken like someone who doesn't understand advertising- ads stay in the mind, just because it doesn't convert on a watch doesn't mean you didn't get a customer later, from the ad being watched or the ad performing over time. This kind of ask drives content creators away because their work isn't valued. The creation of the ad itself is worth payment alone, this kind of bartering only appeals to amateur creators and the very desperate. You get what you pay for, so good luck.",
                            "replies": [
                                {
                                    "author": "Nosecondcakes",
                                    "text": "A one off ad definitely doesnt stay in the mind. This only works if you're a billion dollar company"
                                },
                                {
                                    "author": "CricketLess7432",
                                    "text": "Exactly."
                                }
                            ]
                        },
                        {
                            "author": "Chris_Thornham",
                            "text": "That’s a great way to think about it. Thanks."
                        },
                        {
                            "author": "lastdreamofjesus",
                            "text": "Worked for then owned a very successful influencer marketing company and we refused every single offer of that sort immediately. Ads are for more than instant conversion. You are paying for the advertisement of your brand. Someone might buy the product weeks later at random because they remembered and we don’t see a cent. Not happening. We had so many big brand name customers that kept coming back for years. Clearly, the results satisfied them.",
                            "replies": [
                                {
                                    "author": "nokia7110",
                                    "text": "Easy for affiliates to set up 90+ day tracking on the link. A million followers means nothing if you're not even confident that enough of them will convert, not to mention the continuous passive income from SaaS products. \n\nNothing makes an \"influencer\" truly understand if there's any value in their audience (or if they actually influence their audience) like offering to pay per sale. \n\nTldr; you're not an influencer if you're not able to influence your audience."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JickRamesMitch",
                    "text": "fake influencers are everywhere",
                    "replies": [
                        {
                            "author": "DanGleeballs",
                            "text": "Even real influencers aren’t generally worth this. \n\nI’d an agent for billionaire businessman and tv personality with 5 million followers and he wanted £10k for a post. In the end he did it for free and we got fuck all new business from it. \nThank god I didn’t pay."
                        }
                    ]
                },
                {
                    "author": "ElevationAV",
                    "text": "what's their conversion rate like?\n\npresumably they've done sponsored posts before, so should have some kind of analytics to show engagement/click through/sign ups/etc"
                },
                {
                    "author": "Oatz3",
                    "text": "You need numbers to back this up...\n\nIf your software costs 100k and 200k impressions will lead to at least 1 sale...\n\nIf your software costs $10 the math needs to be much different."
                },
                {
                    "author": "gc1",
                    "text": "This is like asking whether you should buy a stock at a given price.  The answer depends on how much money you have, where else it's allocated, and your risk tolerance.\n\nIf I were spending a lot of money per year on other channels and testing influencer, I would not blink at spending $10k on a test of someone promising in a promising category.  I would probably do this with the idea that, if it worked, that would be the tip of the iceberg and we would ramp up budget aggressively.\n\nIf I had $10k in the bank, or $10k was a substantial percentage of my annual marketing budget, I would not bet it all on one thing that might or might not work.\n\nMaybe a better analogy would be, if I had $100 to play blackjack with, I would sit at the $5 table not the $100 table.  This is called bankroll management.\n\nInfluence is also content dependent.  I'm not an expert but my sense is it has a relatively high failure rate (where failure is content that doesn't have any resonance).  Manage your bankroll accordingly."
                },
                {
                    "author": "oldschoolology",
                    "text": "Compare that expense. Will 10K of ads get you better results? A variety of ads is less risk than betting on one influencer who may not even have “authentic” followers. "
                },
                {
                    "author": "hungryconsultant",
                    "text": "Yes.\n\nCalculate how much 1,000,000 impressions cost in Facebook ads.\n\nShould be between $5-$20.\n\nArguably, if the influencer is really good - they have authority with their followers. That can be recreated with testimonials. \n\nHere’s a better plan:\n\nTest various Facebook ads, figure out the angle that works best, then get a cheaper micro influencer to make a video and use that for ads.\n\nOver all - fuck influencers who charge up front. Most know very well they have to charge upfront because they deliver no actual results.. \n\nI’ll work with them only on affiliate commissions. If they don’t agree it’s a red flag (assuming I’ve provided my sales conversion rates, which I have because I ran ads).",
                    "replies": [
                        {
                            "author": "Harryarryson",
                            "text": "I agree with your comment most of all. I’ve worked with a bunch of influencers (albeit they were for promoting music festivals so an easy sell) that would want upfront payment. We had a fairly large budget but 99% of the time digital ads work the best. Hell TikTok ads has always yielded great success so I’d say money better spent that way.\n\nAdditionally we would try to calculate CPM for these influencers based on how much they were asking and getting an average on how many view they would get on past promoted posts. This gave us a way better idea of what we could expect in return.\n\nIf you don’t have a large budget ads are the way to go. Much easier to track and they have been a proven success many times. \n\nIf set on using influencers make sure you have a way to track via affiliate links to really see if the project was effective or not.\n\nAlso not a fucking chance I’m paying 10k for someone with a million followers. 10k for probably 100k views is insanity $100 CPM maybe if you’re selling attorney services in NYC that would be somewhat okay but for a SaaS product you better off putting that 10k all on black in Vegas"
                        }
                    ]
                },
                {
                    "author": "wanderlusterian",
                    "text": "ALWAYS check their engagement rate before making a big invesment. Also, ask them for results of previous campaigns. They also lower the price when they can't give you solid stuff, OR you'll find out it's truly worth it."
                },
                {
                    "author": "domain_expantion",
                    "text": "Followers alone means nothing, you need to see what type of engagement they have, how many likes and comments do their posts get ? And are those numbers indicative of a person with 1 million real followers or a person paying for follows. I'd say just use chat gpt, perplexity or any other LLM to get a list of questions you can ask them in terms of getting a look at their analytics."
                },
                {
                    "author": "irpugboss",
                    "text": "Depends on so many things.\n\nWhat your usual conversion rate is from qualified webtraffic from an influencer, what their CTR is, etc.\n\nLike if you are going to get 3% clicks on their views with average of 200k views and then usually see a 4% sale conversion at a cart value of $1000 recurring on average for 3 years or whatever you have then it may work out really well.\n\nIn general though if $10k is too rich for your blood now, def go microinfluencers and track those stats. Then rip those metrics into a 1/3rd or less to apply as a test model to the larger influencers numbers.   \n  \nPersonally I just finished working with 3 influencer agencies, individual midsized influencers and several individual micro-influencers and because my product is $$$ for a niche the microinfluencers are usually worth their weight in gold but time consuming to reach out to and contract.\n\nOn the opposite end I spent $6k on a larger influencer and it returned $0, she was horribly entitled and delivered really trashy results. I've also done $1500 deals with other larger influencers and popped off like 20x return on ad spend.\n\nAnyways, yeah get scientific and scale. Expect to take some L's along the way, it's inevitable.",
                    "replies": [
                        {
                            "author": "Tehjokaa",
                            "text": "You might be the best person to ask for something I’m working on, can I throw you a dm?"
                        }
                    ]
                },
                {
                    "author": "igorup",
                    "text": "maybe would be better to pay him from sale impact after his job. bigger impact bigger reward",
                    "replies": [
                        {
                            "author": "[deleted]",
                            "text": "[deleted]",
                            "replies": [
                                {
                                    "author": "theWiseonenate",
                                    "text": "don’t pay upfront. Get the data/numbers on their previous 10 (minimum) post/ad engagement and how many led to sales and website visits. Most influencers also use an ad discount code, so you can track their post impact. No point spending 10k if you don’t have an idea of the ROI"
                                },
                                {
                                    "author": "ilovemyself2019",
                                    "text": "This is not normal, OP."
                                },
                                {
                                    "author": "jhaluska",
                                    "text": "If they have made previous similar posts before, you can try contacting those companies and ask them if it was worthwhile.  \n\nIf they don't have repeat sales with the same companies it could also be an indicator that the vendor is not getting a good ROI."
                                },
                                {
                                    "author": "igorup",
                                    "text": "don’t pay upfront. make like i sad before or pick someone else. they arent only one."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shikodo",
                    "text": "A family member of mine got paid 7k to do something for McDonald's.  He's only got 140k followers."
                },
                {
                    "author": "talhaak",
                    "text": "Depends on your product, their reach into the space you're looking to operate in, who you're targeting, etc.\n\n\nMany factors are important here. Write out the factors, define in detail what you're looking for out of sponsored posts and then use your best judgement. For some things, micro influencers can be a lot better. For others eg quick and heavy impact, large influencers hold more sway."
                },
                {
                    "author": "BearClaw1891",
                    "text": "Consumers are responding less and less positively to influencer marketing. I'd rethink the strategy entirely."
                },
                {
                    "author": "Dry_Ninja7748",
                    "text": "Reach out to their previous promoters to gauge the performance"
                },
                {
                    "author": "Green_Database9919",
                    "text": "depends on what you're selling, if it matches their audience, and what their purchase conversion is for past products similiar to yours. Statistically, the larger the following the lower the purchase conversion."
                },
                {
                    "author": "FalkorDropTrooper",
                    "text": "I don't need to see the variables. Yes, it's too expensive."
                },
                {
                    "author": "flyfightandgrin",
                    "text": "Influencer marketing is overrated. You can hire a PR firm and get press releases, articles, social media, and possibly news coverage for that price. I do it for clients all the time."
                },
                {
                    "author": "Nogardtist",
                    "text": "1m real followers or half botted half no longer active if on twitter\n\neither way i think normal infuencers that care only about money would see dollar sign and go with it no matter what"
                },
                {
                    "author": "bearze",
                    "text": "Depends on the engagement they get.  If it's good, I'd say it's worth it",
                    "replies": [
                        {
                            "author": "sammiexr",
                            "text": "Hey there \n\nI'm seeking a $300 investment for a companionship service providing personalized connections for individuals combating loneliness. In exchange, you'll receive a 5% equity stake in the business, entitling you to a percentage of the revenue for as long as it operates. Funds will be allocated to ads and ad revenue growth, capitalizing on a unique and growing market. By investing, you'll contribute to a socially impactful business making a positive difference in people's lives. If you're interested, let's schedule a call to discuss further.\n\nBest regards,\nSamuel",
                            "replies": [
                                {
                                    "author": "[deleted]",
                                    "text": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dependent-Button-901",
                    "text": "That’s so crazy! It better bring all the results for you lol \nIt’s scary these days because the followers can be fake too on their pagw"
                },
                {
                    "author": "MezcalFlame",
                    "text": "Why not referral code and commissions?"
                },
                {
                    "author": "False-Idea6227",
                    "text": "The followers isn’t the only thing you have to focus, but the activity their account receive is more important. For ex: how much likes they have per posts, how many comments, etc."
                },
                {
                    "author": "jack_spankin_lives",
                    "text": "What is your average cost of acquiring a customer?"
                },
                {
                    "author": "rendingale",
                    "text": "I remember back then with Miami Lebron.. \n1 tweet was 50k\n\n\nUse that information however you want it to."
                },
                {
                    "author": "prb613",
                    "text": "My 2 cents, I never take any products shilled by a 'tech' influencer, especially with a massive following seriously. Not sure what the ROI on that one post would be. You should ask for past post conversion rates."
                },
                {
                    "author": "Mephisto506",
                    "text": "Is your conversion funnel sound? Make sure it is before you blow your money on a one-off spike in visitors.\n\nAssume that the conversion rate will be worse than normal, and do your sums."
                },
                {
                    "author": "ricoza",
                    "text": "What's your cost of customer acquisition through your most effective channel?  Divide the 10k by that, and that gives you how many new customers they have to bring in at a minimum to be worth it. What's that number as a percentage of their 1M followers?  So you think that's realistic with the market you're in?  Also factor in that you have absolutely no guarantee they'll bring in that many, they take no risk."
                },
                {
                    "author": "GergDanger",
                    "text": "Honestly $10k seems pretty fair if their account gets good views in the tech space. Larger accounts easily get multiple times that for short form posts. \n\nYou still need to optimise your offer and test if it works well with this type of marketing though rather than just paying someone and hoping it returns a multiple on your investment. Longer term partnerships across multiple videos build a lot more trust with an audience that’s why a lot of creators have recurring sponsors regularly as opposed to one offs every other week. \n\nI would recommend starting smaller with a couple smaller accounts and testing out what type of video you want made, your offer and landing page to best convince viewers about checking out your product. It’s not like the viewers are programmed to go and buy your product just because it’s in a video that you paid someone a bunch of money to be in, still takes testing things out and optimising just like a normal advert. \n\nHopefully that gets you close to at least breakeven on some of those accounts and then go from there with offering them an affiliate program so that you have a longer term collaboration to optimise the way you collaborate and the conversion rates to grow profitability on that partnership"
                },
                {
                    "author": "ryanknol",
                    "text": "If their engagement is insanely high and they are a huge part of a direct niche you are aiming for, it's probably ok. But 90% of  \"influencers\" are scams or fake. Or their audience is thirsty dudes in their 50s."
                },
                {
                    "author": "Beneficial_Past_5683",
                    "text": "I bet they do.\n\nYou'd likely see no return.  Only 1000 of their 1m followers will see you, and about 10 will look at your website and you *might* get 1 enquiry.\n\nBut.  You could use the content wisely.  Use the influencer's name and influence in other marketing and it could be worth it.\n\nCut out a dozen or 20 ( ask for them to provide) good sound bite clips. Use them online, in your marketing and socials. You could make it pay."
                },
                {
                    "author": "Chinaski420",
                    "text": "I’d do tests with smaller and more relevant ones first if you are new to this."
                },
                {
                    "author": "Indaflow",
                    "text": "Approach this like you would a sales person or marketing. \n\nDo they have proof of results? \n\nFor $10k they need to be able to share real work analytics. \n\nAlso, sometimes likes are for vanity not sanity. \n\nYou can get 20,000 likes but will it get any business? For $10k, you need to get business.\n\nIf you don’t have any strategy for how you are going to get business from videos, then don’t do this. \n\nThere are better ways romances $10k to generate revenue. \n\nLastly, instagram is a great way to sell shoes, steaks, cars etc. \n\nI am not sure Saas and influencing go together. Keep posting about your journey, I would love to hear more.\n\n-Saas fintech founder "
                },
                {
                    "author": "JaySierra86",
                    "text": "I wouldn't use an \"influencer\" to promote my business at all."
                },
                {
                    "author": "LiturgyOfTheBird",
                    "text": "Speaking from experience, that’s actually a little low for that amount of followers. So I suspect that either - \n\n-They’re over monetizing and promoting lots of products (meaning their followers are likely fatigued from promotions and won’t be eager to buy);\n\n-Or, their following is not well-engaged and low-intent (meaning not focused on buying intent). \n\nKeep in mind also, that many “influencers” buy fake followers and boost posts with bot interactions. You should see if you can rule that out."
                },
                {
                    "author": "achuinard",
                    "text": "Sounds like Theo."
                },
                {
                    "author": "Hot_Store9417",
                    "text": "I'd try to spread it out with micro-influencers. They likely have better quality of followers if your product isn't something everyone and anyone can use."
                },
                {
                    "author": "adventurepaul",
                    "text": "Just throwing out there that deliverables matter too. If the contract includes a certain number of videos and photos that you also have the rights to use on your website and in ads, that can impact the value."
                },
                {
                    "author": "kolav3",
                    "text": "Im not familiar with this industry. But 10k for 1 post seem way too much"
                },
                {
                    "author": "JoyousGamer",
                    "text": "Your question to them is why are they worth $10k? Do they have metrics and numbers from other partners who have had them do something similar?"
                },
                {
                    "author": "Savings_Art5944",
                    "text": "You miss all the shots you dont take."
                },
                {
                    "author": "WeCastTV",
                    "text": "Probably not."
                },
                {
                    "author": "CricketLess7432",
                    "text": "Based on the comments here, it’s clear that many people have absolutely no experience working with influencers.\n\nFor example, imagine you got a sales job, but there’s no salary—meaning you don’t get paid at all, zero—only earning based on commission from your sales. Would that be fair to you? Probably not.\n\nThat’s why you need to think about this differently.\n\nAn influencer puts in the work, builds their audience over years and years of effort, and you expect them to say, “Yeah, sure, just pay me a commission on sales”? Why would anyone agree to that? It makes no sense.\n\nImagine going to someone like Mr. Beast and saying, “Hey, man, you’ve got hundreds of millions of followers, but based on your numbers, or whatever, we’re just not sure you can drive sales. Can you work on commission only?”\n\nSeriously, why would anyone agree to that?\n\nThis mindset shows a lack of respect for influencers and the effort they’ve put into building their platforms.\n\nNobody’s going to accept commission-only deals, only the influencers that put zero effort into their work.\n\nEdit: There is couple of good comments here BUT it’s funny how those have no upvotes…"
                },
                {
                    "author": "nitekillerz",
                    "text": "I’ve hired informers before and the click rate vs their follower count is awful. That is a lot of money. I would want to see similar post data from the last 6 months"
                },
                {
                    "author": "SabinaSanz",
                    "text": "Consider your goals, are you aiming for sales or brand awareness? Do they speak to your target audience? What is their actual engagement? Success stories? "
                },
                {
                    "author": "GoldenTree9999",
                    "text": "Search other marketing rate, get a few more opinions."
                },
                {
                    "author": "Embarrassed-Cod-7834",
                    "text": "As an influencer and entrepreneur, most places don’t offer a high enough percentage to make it worth it. There are services that help broker these upfront payments. \n\nNegotiating view goals is also useful, like an expectation of 100k views total across platforms for 10k is pretty decent. \n\nMake sure you own the content. You should be allowed to take the video for x amount of time, and use it as an ad, or make an edited “reply or stitch against their video to drive your own traffic"
                },
                {
                    "author": "asksherwood",
                    "text": "I'm guessing your product isn't \"general tech\"? Also, \"general\" implies B2C - are you that, or B2B? \n\nIf the fit is good, $10k gets you the right people. If not, $9.99 is too much to pay."
                },
                {
                    "author": "spiceworld90s",
                    "text": "Do you know what results you’re actually looking for?\n\nI recommend people stay away from influencers when they don’t actually, explicitly know what results they’re looking for from an influencer or if the influencer can deliver them. e.g. why choose an influencer and not a targeted ad or a press article? \n\nOthers have mentioned —- click through, conversion? Sign ups? Social follows? \n\nWhat is it that you want the influencer to post? Have they shown you previous partners where they yielded the results you’re looking for? What’s their engagement rate?"
                },
                {
                    "author": "NewNollywood",
                    "text": "There's a high chance you will be disappointed after spending that money on a single post.  Can you afford to waste money?"
                },
                {
                    "author": "RingAvailable2887",
                    "text": "I would suggest you to seek chatgptricks page. Your niche. Price is way lower than 10k for the sponsorship post. Plus they have 1.5M followers."
                },
                {
                    "author": "cleverkid",
                    "text": "Not enough info.. are they going to do a straight-up 15 minute infomercial for you and endorse the hell out of it and urge viewers to go sign up because it's \"the most crucial thing they can do to survive in 2025?\" Or is it a flaccid IG image post that'll evaporate in 20 seconds?\n\nHonestly, you sound like you're in over your head.  You don't even know the right questions to ask. ( don't worry it's VERY typical )\n\nYou need some serious representation on this front. Someone who can crawl up their ass and make sure you're getting exceptional value for your spend.  SOMEONE WITH PROVEN SUCCESS IN YOUR SECTOR.... Pissing money into the wind is like candy for predatory \"marketing influencers\"\n\nBelieve me, engaging someone will SAVE you a shitload of money, as well as get you results and save you a lot of suffering and frustration.\n\nAs others have said, build-in incentive for them in the deal so they push it for real.. but honestly, find someone that'll make sure you set it up so you get results or you're more than likely get fucked bad.\n\nAlso, this should be only one facet of a very serious and detailed GTM strategy... or you're just shooting in the dark.\n\nBest of luck!"
                },
                {
                    "author": "Cold_Version_5782",
                    "text": "Not sponsored! But use Modash.io to see the number of fake followers they have. The tool will also show you the influencers overall engagement. \n\nNB: Its a paid tool but the free account is enough to find this specific influencer and 19 other influencers for free( 20 influencers in total for free). You also need a business email to create an account."
                },
                {
                    "author": "bigmink88",
                    "text": "Get a rev share (with a ceiling) contract.  If they can bring proven sales, they can have a share of that.  Industry standard depends on who you ask, but 5% rev on what they sell is as high as I go.  \nI.e. if you produce proven sales (click through) you’ll get 5% revenue up to $10k.  \n\nIf homeboy wants more, you could go further with a rider in the contract saying the above but, “in the event you produce proven sales with $1m in rev, you get a bonus share of 1% revenue,” or whatever.\n\nThey should get $0 up front."
                },
                {
                    "author": "marouane_rhafli",
                    "text": "You need to know that in that 1M followers, almost 50% are inactive, because in the tech niche, followers rarely still follow the influencer,... 10k$ is a faire price, I only have 40k subs on Youtube and I charge about 500$/video"
                },
                {
                    "author": "Mm2k",
                    "text": "I would try the micro influencers. If they are reporting on something that he is not, odds are that he will want to remain relevant and do a report on it as well.  If not, then spend the money."
                },
                {
                    "author": "ChiefGentlepaw",
                    "text": "Yes way too much. That’s absurd. Check out referral marketplaces like refersion. This idiot is scamming you."
                },
                {
                    "author": "Select-Pineapple3199",
                    "text": "Are you allowed to use the USG to run paid ads targeting their audience?"
                },
                {
                    "author": "TehGutch",
                    "text": "What percentage of the million followers are real? How many likes do posts get on average?"
                },
                {
                    "author": "Tkronincon",
                    "text": "Worked with influencers since 2016, I would say 10k is too much unless it’s a known celebrity outside of social media.  Too many fake clicks and engagement now that at 10k with 1 million followers your CPM would be more affordable running your own add campaign targeting their followers"
                },
                {
                    "author": "madamesoybean",
                    "text": "Who is your perfect customer? Do they also frequent this channel?\nIf it were me for 10k I'd use 20 smaller channels tbh. According to average marketing math you might get about 10,000 - 20,000 to see your mention and 100 - 200 to click your link with this one influencer."
                },
                {
                    "author": "Quick-Neat-4858",
                    "text": "Honestly, $10k sounds wild for one post. These influencers are really out here charging like that, huh? 😂"
                },
                {
                    "author": "Sure-Start-4551",
                    "text": "They’re all frauds and fake. Most people buy a bulk of their following. Don’t do it. Pay for marketing. Or give me 10k since you feel like giving it away."
                },
                {
                    "author": "GardinerAndrew",
                    "text": "Follower account isn’t relevant, it’s about engagement. Take their last month worth of videos, add up the views, divide by number of videos and that equals what you’d be paying per impression."
                },
                {
                    "author": "Terrible-Guitar-5638",
                    "text": "1M email subscribers with a 30% click open rate? Maybe. Depends on average click rate and other factors. \n\n\n1M social media subscribers? Definitely not. They don't control the algorithm. Who knows how many people will actually see it, and of the ones that do, who knows how many are regularly engaged. Might as well light that 10k on fire."
                },
                {
                    "author": "nowackjack",
                    "text": "Only pay per impression. There’s absolutely no reason to do otherwise. Most sponsored posts don’t receive much traction because the audience sees through it. If the influencer is charging a fixed amount, it’s because they also know this."
                },
                {
                    "author": "AncestralGhost",
                    "text": "You’re likely to get a better return on social media advertising instead when you pay for actual views and engagement not for potential without a guarantee."
                },
                {
                    "author": "Rlokan",
                    "text": "You are usually better off spending this on a handful of micro influencers rather than 1 person."
                },
                {
                    "author": "growthsumo",
                    "text": "Get a gauge on how past collabs have performed. If engagements are good, and there are repeated clients, normally it’ll cost more than that."
                },
                {
                    "author": "JonStuartMilly",
                    "text": "I love how a lot of people assume that creators have this crazy sales and click through data. Do you know how hard attribution is on normal channels already? While some influencer do have data, most brands and agencies withhold this data 90% of the time. \n\nI would encourage OP to do a deep dive on LinkedIn and Google on influencer marketing best practices and set ups. What’s your goals? And it can’t just be: I want to generate more sales and brand awareness. Everyone does, be specific. \n\nWhere else would you spend that $10k? Ads? Tech? Etc? Could you spread it out over 5 other influencers? \n\nThere are so many factors and personally I would hire a good agency or marketer who knows what they’re doing to teach you so you know what to do yourself next time. Influencer marketing like ANY other marketing channel takes time and nuance so treat it as such"
                },
                {
                    "author": "Aggressive_Check2616",
                    "text": "It depends if that influencer have same community like your, and what country."
                },
                {
                    "author": "pappchat",
                    "text": "What platform ?\n\nTikTok 1M followers means nothing if you’re lucky you will probably average 30k-200k views\n\nIG is a bit better (figure 100k to 350k views depending on the content and how they post it + if they post to their story too you will probably average an extra 45k-65k views)\n\nGood luck"
                },
                {
                    "author": "iceman123454576",
                    "text": "Aren't you better off, from an ROI perspective, spending the $10k on Google ads or Facebook ads where you can properly target to an audience you specify to the nth degree?"
                },
                {
                    "author": "Upper_Pangolin_9424",
                    "text": "I would request previous ad performances with other ads and cost it up."
                },
                {
                    "author": "8v9",
                    "text": "Follower counts don't matter anymore. Engagement rates don't matter anymore.\n\nThe only thing that matters now is the creative asset. Find creators that are able to make good content (low swipe through rate, high view duration) with your product.\n\nLastly, if you're just asking them to upload your crappy product demo video, you'll just waste your money."
                },
                {
                    "author": "First-Meet-5260",
                    "text": "Offer them a generous commission on sales instead of an upfront payment for the post."
                },
                {
                    "author": "mvktc",
                    "text": "It's even unethical to pay so much money to such a sellout. Fuck them."
                },
                {
                    "author": "Leading-Bunch-8358",
                    "text": "At face value, no. But you gotta make sure their audience is relevant enough to what you're trying to sell. I'm getting the impression this is a smaller company and this is one of your first spends. \n\nI'd suggest spending a smaller amount with smaller, more targeted influencers first to get your feet wet."
                },
                {
                    "author": "molkijuhy63566",
                    "text": "You need to know more about ROI before knowing if its expensive. What will you get from that investment? Ask them to show you metrics and results they have had before and focus on that. If they can't give you details on that, it might be better to go with smaller creators instead (always focusing on those who have considerable engagement)."
                },
                {
                    "author": "BradLee28",
                    "text": "Seems like a fair price tbh"
                },
                {
                    "author": "monjodav",
                    "text": "I don’t know man, if these 10k bring me 100k I won’t hesitate a second."
                },
                {
                    "author": "Particular_Knee_9044",
                    "text": "Every SINGLE one of you DM/SEO brainiacs has missed the point. I’d bet almost everything I own his “AI wrapper single-function (or worse, all in one!) SaaS” is a) completely broken and b) has a landing page incapable of anything beyond wasting time and leading to immediate evacuation.\n\nA: get your differentiated product structured & messaged right. First. \n\nProve me wrong."
                },
                {
                    "author": "[deleted]",
                    "text": "[removed]",
                    "replies": [
                        {
                            "author": "cassiuswright",
                            "text": "I'd pay you just to stop posting this spammy bullshit",
                            "replies": [
                                {
                                    "author": "catfink1664",
                                    "text": "Spammy sammy"
                                },
                                {
                                    "author": "sammiexr",
                                    "text": "No you won't"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "I made my first sale!! 🥳",
            "author": "craciun_07",
            "text": "I feel great. But I also feel grateful because I know that even getting one sale from a product built yourself is extremely rare.\n\nI have been building my \"Tinder-Style cofounder finding platform\" for 2 months, just to make a $30 sale this morning while I was sleeping.\n\nIf you want to know about my project, write a comment or DM me and I'll be happy to tell you more.",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "theonlyvasudev",
                    "text": "Congratulations on your first sale can u give some more helpful insights",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Sure.\n\nWhat worked for me was posting on Reddit and hacker news.\n\nParticularly the r/thesidehustle and r/Sideproject is quite friendly for promoting your product.\n\nThe hackernews post I made was also simple and drove the most traffic to the site, I also believe it was the source of the purchase.",
                            "replies": [
                                {
                                    "author": "theonlyvasudev",
                                    "text": "So what was your site exactly about?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Noire_Lab",
                    "text": "**Congrats, bro! 🎉 I feel like this is just the beginning of something big for you. I wanted to not just cheer you up with words but also throw in some ideas for your project. Hope they’ll be useful! Here you go:**\n\n1. 🔍 **Matching algorithm** — add filters by skills, interests, experience, location, and values to make matches more precise.\n2. ⭐️ **Reviews and ratings** — let users share their experience of working with others.\n3. 🎮 **Gamification** — achievements for “matches,” profile completion progress bars, and activity badges will boost engagement.\n4. 🤝 **LinkedIn integration** — allow users to quickly import their details, building trust.\n5. 💬 **Productivity chats** — share tasks, notes, and links directly in the chat.\n6. 💡 **\"Ideas and projects\" section** — a space to post ideas and find like-minded partners.\n7. 🎓 **Webinars and training** — organize workshops on startups, idea development, and finding investors.\n8. 🚀 **Premium features** — offer advanced filters, profile analytics, or the ability to see who liked you.\n9. 💑 **Compatibility tools** — questionnaires or tests to determine shared goals and approaches.\n10. 🗣 **Community and discussions** — a mini-forum for Q&A, advice, and interaction.\n11. 📱 **Mobile app** — if you don’t have one yet, it’s a must-have to boost user engagement.\n12. 🌍 **Global and local search** — let users find co-founders nearby or globally.\n13. 🕒 **Activity indicators** — show when users were last active to avoid “dead” profiles.\n14. 📄 **Legal templates** — ready-to-use documents for co-founder agreements.\n15. 🏆 **Success stories** — a section with real user stories for inspiration and trust.",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Yooooo this is so cool. Did you generate this or write it all up yourself?\n\nP.S. a lot of these ideas are in the backlog, particularly legal templates, success stories, and matching algorithm."
                        }
                    ]
                },
                {
                    "author": "bunz007",
                    "text": "BRAVO‼️",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Thank you my friend ✊"
                        }
                    ]
                },
                {
                    "author": "Proof_Basket6232",
                    "text": "This project genuinely sounds super cool! Wishing you all the luck 😄",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Thank you so much, would you like the link for it?",
                            "replies": [
                                {
                                    "author": "Proof_Basket6232",
                                    "text": "Of course, I'd love to check it out!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Conscious_Weight_642",
                    "text": "Big congrats! The emotion of getting the first sale is the gateway drug to scaling a business.",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Hahahaha, this is super relatable, I definitely feel a sort of \"high\" right now."
                        }
                    ]
                },
                {
                    "author": "kodeepaulconsultant",
                    "text": "whats that?",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "It's a platform connecting technical and non technical people into a partnership.\n\nIt's pretty casual and not targeted at large scale projects, but it's a great way to experience cofounder finding in a user-friendly way.\n\nI could send also you the link if you DM else I'll get banned (right?)",
                            "replies": [
                                {
                                    "author": "TeamPuzzleheaded6599",
                                    "text": "Can you dm me too please? Sounds interesting"
                                },
                                {
                                    "author": "marvbrown",
                                    "text": "DM the link please"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Loud_Cut_304",
                    "text": "Lessgo keep it up",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "For sure man, We shall Keep the energy up ✊"
                        }
                    ]
                },
                {
                    "author": "First-Meet-5260",
                    "text": "Congratulations! As a now successful business owner, if you would like to connect with other business owners, we have a discord server with 160 members, all from this subreddit, the the sole purpose of creating a space to talk about entrepreneurship and business, without any bots, spam, or selling. If you are interested, check it out. Here's the link: https://discord.gg/VhrR9YRp. Congrats again!",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Thanks man, I'll join up right now."
                        }
                    ]
                },
                {
                    "author": "Complex-Being-465",
                    "text": "Great job! That must be incredibly fulfilling.",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "It is, and now onto the second sale!!"
                        }
                    ]
                },
                {
                    "author": "DingoProfessional168",
                    "text": "Haha, what an original thought.\n\nCongrats!!",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Thank you! I'm surprised nobody came up with something like this to be honest, it's definitely received good traction all over social media",
                            "replies": [
                                {
                                    "author": "DingoProfessional168",
                                    "text": "All the best on your journey dude"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dvdabeast",
                    "text": "Congrats man I know the feeling is awesome",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "It's great, have you had your first sale yet??",
                            "replies": [
                                {
                                    "author": "dvdabeast",
                                    "text": "I run a youtube script writing agency. I've had multiple clients"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maleficent_Yak_9127",
                    "text": "Congrats! I love this idea. I recently left corporate (big tech), and have a ton of experience in operations & leadership, etc in and around tech.. but am not actually technical. I’ve loved the idea of finding a founder who is super technical and needs a partner with an alternate skillset to help them build, scale and manage. Would love to check out your site. Feel free to DM the link!"
                },
                {
                    "author": "False-Idea6227",
                    "text": "I think this is the most important moment for an entrepreneur, when you get excited for your first sale there’s only a way to go and is to the top 👆",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Exactly, I'm very excited and only good can come from this moment 💯"
                        }
                    ]
                },
                {
                    "author": "AgentProof",
                    "text": "congratulations! tell us more about your business.",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "For sure!\n\nI am in the process of curating marketers and developers to make a platform full of trustworthy and skilled individuals.\n\nMy plans for this project is to extend beyond the matching process and start focusing on actually starting a project with a partner. This means focus on partnership agreement templates, partner evaluation tools, and even trial projects.\n\nI'd be happy to discuss more in DMs if you'd like, and if you'd like to see the site."
                        }
                    ]
                },
                {
                    "author": "vvvenusvenusss",
                    "text": "congrats!! the first one of many!"
                },
                {
                    "author": "GoldenTree9999",
                    "text": "Well, congrats, I remember there was an app that did the same thing.",
                    "replies": [
                        {
                            "author": "craciun_07",
                            "text": "Could you refer the app to me?",
                            "replies": [
                                {
                                    "author": "GoldenTree9999",
                                    "text": "I forgot the name, but a simple google search, you can find CoffeeSpace and Buildfire."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TermConsistent9090",
                    "text": "Interested! Could u dm the link pls"
                },
                {
                    "author": "Dry-Attention-1086",
                    "text": "Give me the link please"
                },
                {
                    "author": "Comfortable_Dark66",
                    "text": "This is awesome! It always feels good to get your first sale and you will get many more. Keep plugging along. You got this."
                },
                {
                    "author": "your_debot",
                    "text": "Nothing beats the feeling of that first sale! Here’s to many more!"
                },
                {
                    "author": "Infamous-Cod-6058",
                    "text": "Congratulations, this is just the beginning keep up the good work."
                }
            ]
        },
        {
            "title": "Brother Wants Me to Shut Down Business - What Do I Do?",
            "author": "theponderingpoet",
            "text": "General gist of it is my brother came up with an idea years back revolving reselling an online good. He was in college at the time, made a killing off of it. Now, he’s working a full time job and still runs this business on the side but not to the same extent.\n\nMy best friend in HS and I started running this same business recently and had great success. Told my brother at the beginning - he was quite supportive and congratulated us on figuring it out. Because we had two people running the business, we were able to make much more than my brother has ever had just simply bc the business requires a lot of manual effort.\n\nLast month we brought in 18k in profit. The month before we brought in 16k. It’s looking like pretty much every month we will make 15k+ in profit. And we just expanded to hiring our first employee to help automate some manual processes.\n\nJust two days ago I get a call from my brother telling me he wanted me to stop. He mentioned changes in the market + that he felt uncomfortable. I asked him what changes he saw, and he kinda just skirted around the question and just said he felt uncomfortable.\n\nI asked if it made sense if we just teamed up to dominate the market. He said no, that he just wanted to work on it himself and that it was his idea.\n\nI think I’m going to stop. It sucks because it’s a huge amount of income, but it’s not worth it ruining my relationship with him. Just curious what you guys think and why he might want me to stop.",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "fortyeightD",
                    "text": "From a business perspective, if he wants to control your business then he should buy it from you.\n\nFrom a family relationship perspective, this is a difficult problem, and I don't know what you should do.",
                    "replies": [
                        {
                            "author": "Vryk0lakas",
                            "text": "I’d offer him like 5-10% for giving the idea and to smooth over the relationship.",
                            "replies": [
                                {
                                    "author": "Rivercitybruin",
                                    "text": "For a limited number of years i'd say.. This assumes he doesn't own part of the company"
                                },
                                {
                                    "author": "RiotsAndWarfare",
                                    "text": "Sounds like extortion."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "burt_bondy",
                    "text": "For the love of god, do not stop.",
                    "replies": [
                        {
                            "author": "UsernamesMeanNothing",
                            "text": "Exactly. Either he buys him out, joins the fight, or tells him that it disappoint him that his brother is upset with his success. It isn't easy to build a business to this level and the next venture is bit likely to be as successful."
                        }
                    ]
                },
                {
                    "author": "piece_of_shyt",
                    "text": "lol. No. He’s jelly.\n\nLet yourself see it play out. It’s your business.",
                    "replies": [
                        {
                            "author": "PM_me_your_dreams___",
                            "text": "But they copied his business",
                            "replies": [
                                {
                                    "author": "piece_of_shyt",
                                    "text": "People copy businesses all the time and have different levels of success based on actual inputs.\n\nI’ve been unsuccessful at flipping Pokémon cards recently. But all these gurus are saying that it’ll sell so easily?! What gives"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "babesboysandbirb",
                    "text": "What I have learned farther down the road in life, is that siblings who begin to show their colors will always be exactly what you saw. Theres no changing it or making it better. He will do something else down the line with this same nonsense and you won’t be able to “win”. I would recommend deciding for yourself if what he is asking you to do is reasonable. If it’s not, be kind, but do not make a change.",
                    "replies": [
                        {
                            "author": "babesboysandbirb",
                            "text": "And FYI: he is not being reasonable."
                        }
                    ]
                },
                {
                    "author": "Individual-Target-20",
                    "text": "Why don't you work together to ramp it up and sell it?",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "Yeah I asked him about this and he said no, that it’s his own business and he doesn’t feel comfortable with me running it with him.",
                            "replies": [
                                {
                                    "author": "pt-t",
                                    "text": "It would be so unreasonable to stop because your brother can’t handle you having more success than him. His idea is quite a crazy thing to say in our day and age nothing is new. Should everyone stop doing what they doing because someone had the idea first? You are not in the wrong here, he should support you and be happy about your achievements, not trying to stop you."
                                },
                                {
                                    "author": "Rivercitybruin",
                                    "text": "He,doesn't want you to be successful is how i read it\n\nTake him out of it fairly or start another company if he just wants to shut down.. Hopefully you guys hadn't given much thought to compensating him\n\nIf he,wasn't family member or very close friend, i would start a new company"
                                },
                                {
                                    "author": "Agitated-Egg-7068",
                                    "text": "Don’t shut down your business. Your brother is probably just jealous of your success.. probably never imagined that you would take an idea he had and go farther than he would and he’s probably resentful about that. Any decision you make is going to cause a negative ripple effect on your relationship with him. He’s resentful now but if you close your business you may be resentful later. Why did you want to go into the same industry as your brother did to begin with?"
                                },
                                {
                                    "author": "FluxMango",
                                    "text": "His idea, yes. But you seem to be the one running the business successfully. \nI think if is safe to say that you have a better business acumen. So start a new business that your brother cannot attribute to himself. If it is successful and he tells you to shut it down, kick him in the balls."
                                },
                                {
                                    "author": "Dynamiccushion65",
                                    "text": "Tell him since now you run a separate business due to new processes he is free to compete so you both corner the market! He doesn’t want to work but he doesn’t want you to win either"
                                },
                                {
                                    "author": "Altruistic-8275",
                                    "text": "Teach me or betta yet hire me so I can learn the ropes😂😂 seriously"
                                },
                                {
                                    "author": "sammiexr",
                                    "text": "Hey there \n\nI'm seeking a $300 investment for a companionship service providing personalized connections for individuals combating loneliness. In exchange, you'll receive a 5% equity stake in the business, entitling you to a percentage of the revenue for as long as it operates. Funds will be allocated to ads and ad revenue growth, capitalizing on a unique and growing market. By investing, you'll contribute to a socially impactful business making a positive difference in people's lives. If you're interested, let's schedule a call to discuss further.\n\nBest regards,\nSamuel"
                                }
                            ]
                        },
                        {
                            "author": "Individual-Target-20",
                            "text": "If you have to choose between feeling your family and making your brother feel good it’s a pretty simple decision"
                        }
                    ]
                },
                {
                    "author": "effyochicken",
                    "text": "He's failing, and wants your market share. He thinks that by making you stop it will be better for him. \n\nExcept, this is super fucked up. It's what I call \"coming for my livelihood.\" I don't give a fuck who somebody is, family, friend, whoever... Don't ever come for my livelihood. The sole reason he wants to put you out of business is so that he makes that money instead. \n\nHe wants your money. \n\nFuck that - unless he comes up with a better excuse than just \"feeling uncomfortable\" he should kick rocks. Don't shut down a successful hustle over such an inadequate reason.",
                    "replies": [
                        {
                            "author": "126270",
                            "text": "Spoiler, it’s illicit drugs, the older brother doesn’t want his younger brother dead in an alley  \n\nedit: no, sneakers aren’t illicit drugs, they’re perfectly legal yet more addictive  \n\nAnd OP: do you share this account with your brother? A year ago you were 23 and addicted to masturbation. Today your best friend is in high school - so maybe you’re 24 now with a 14-18 year old best friend who somehow has enough spare time after school to help you run a reselling business - but then how old does that make your brother - and what the f* kind of brother is telling a 24 year old to not have a successful life  \n\nNone of these products are stolen are they?  \n\nThere are already thousands of sneaker heads out there - you alone can’t make or break your brother - it’s very selfish of him to try snuffing your success - unless his actual concern is your safety  \n\nHas he been robbed in the past? Is he afraid you might get mugged or robbed?  \n\nWhat is it that he feels “uncomfortable” about",
                            "replies": [
                                {
                                    "author": "theponderingpoet",
                                    "text": "My best friend I met in high school. Neither of us is still in hs.\n\nRegarding the other stuff - should’ve used a burner account 😂\n\nIt’s not an illegal business, and it’s not a sneaker business. I do run a sneaker reselling business as well, but it makes far less income. There is no illegality drugs etc. not sure where everyone is getting illegal stuff from. Honestly kind of annoyed about it.\n\nThe uncomfortable part is something I don’t really know. As other people suggested, I would lean towards jealously. But another thing I thought about is that I would not have thought of this idea in a million years.\n\nMy brother is a genius. I consider myself decently smart, but my brother just thinks differently. Like the dude will be a millionaire or even billionaire. I’m positive of it. \n\nHe wouldn’t have mentioned this idea to anyone I think if he knew they were going to do it. He just talked about it around family bc I think he thought that he could trust us. So, when I started the business, I did feel guilty because I thought he would disapprove. But, when I told him about it - initially he was super supportive and congratulated me on figuring out.\n\nWhen he did the 180 a few days ago I was shocked although there were some warning signs. Whenever I asked him questions about the business he would shut me down. If I looked at his computer ever he would close it. In general, he was very closed off from helping me at all and oftentimes would tell me he wouldn’t want to talk about the business.\n\nConversely, with him, I was very open about what me and my friend were doing. I offered to give him certain sources that I thought he wasn’t already doing. I was incredibly appreciative of the fact that he came up with the idea and always felt like I needed to repay him.\n\nI can’t really figure out what he means by uncomfortable until I ask him. But I do for sure understand why he would feel that way."
                                }
                            ]
                        },
                        {
                            "author": "PM_me_your_dreams___",
                            "text": "The fucked up part is your own family becoming your competition. They would have never had the business to begin with if not for him"
                        }
                    ]
                },
                {
                    "author": "yamahamama61",
                    "text": "Stop yelling him your Financials of the company",
                    "replies": [
                        {
                            "author": "yamahamama61",
                            "text": "Telling"
                        }
                    ]
                },
                {
                    "author": "freedomisless",
                    "text": "Wtf man, so your brother only care about him. If your brother loves you, why would he demand you closed down? \nHe doesn’t care about your future unless he is on top."
                },
                {
                    "author": "Dannyperks",
                    "text": "Shutting down your business doesn’t guarantee your brother will take your market share. Customers might jump to someone else completely, and then nobody in the family wins. Lay it out for him: either you two collab and keep the money in the family, or you stay as his competitor, and at least one of you keeps bringing it home. He needs to decide—team up or compete, but either way, the bag stays close"
                },
                {
                    "author": "yamahamama61",
                    "text": "He sees your doing good.  An wants your money.\nYou an your crew stop instantly. Lock brother out electronically.   Start your own business."
                },
                {
                    "author": "DonasAskan",
                    "text": "Don’t stop for sure"
                },
                {
                    "author": "fckurtwitch",
                    "text": "Brother if I’m reading the comments right, you’re flipping sneakers? There’s no claim to that game, it’s been going on for decades lol your brother is jealous, delusional, and quite possibly a moron. Emotional reactions like this are representative of someone who will never successfully operate a business. Ignore him, let what he has fall by the way side, you’ll be doing him a favor in the long run.",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "It’s not flipping sneakers. I run that business as well but make far less money (abt 20k a year or so).\n\nThe business I’m talking about is much more niche and I wouldn’t have thought about it if my brother didn’t mention it to me. That’s why I’m being very cryptic about what I’m selling.",
                            "replies": [
                                {
                                    "author": "fckurtwitch",
                                    "text": "Ok, i understand. Do you have any idea how big the market cap is?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "plasmire",
                    "text": "Do not stop he is jealous and will fuck you. If he really cared about you he would be supportive. This is from someone that has been fucked over multiple time from super close friends that claim they were family as a business partner because they were greedy. Keep pushing it’s his fault he stopped."
                },
                {
                    "author": "BraboBaggins",
                    "text": "Im confused by the point of this post, if your enjoying what you do making money, who gives a shit what anyone thinks you should or shouldnt do…."
                },
                {
                    "author": "Negative_Hedgehog_43",
                    "text": "People suggesting “fuck your brother” has never had a sibling or a happy relationship with sibling (or any other person). What’s wrong with you idiots? The family is so much more important than some cash (15k in profit split by 2 and minus all the tax, it’s not that much).. it’s possible to solve problems without “fucking” each other lol. \n\nI immediately think about several possibilities (some of them are mentioned here I believe):\n\n1. Offer him to work together and to expand this the 3 of you. If this will be the case, make a very very detailed and strict shareholders agreement, who owned that, who gets what, etc. To avoid future conflicts. \n\n2. Ask him if he would like to buy your operation out? Be friendly, tell him how much work you put in, how hard you have worked for it.\n\n3. Split the geolocations where you sell - cities, states, whatever. Expand until you reached the cap. Then talk with him again.\n\nIt’s hard to come up with the original idea and of course he feels like this particular idea is his “baby”, so he is probably a bit upset. But I’m sure if you guys talk it’s all gonna be ok. Just don’t listen to some of the crazy people here on Reddit. Jesus..",
                    "replies": [
                        {
                            "author": "Brusanan",
                            "text": "Lol, no. Family is expendable. Especially when they are as self-centered as OP's brother.",
                            "replies": [
                                {
                                    "author": "Negative_Hedgehog_43",
                                    "text": "You know shit about his brother. From one post to make such conclusions, chill"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dance-Delicious",
                    "text": "Show me how I’ll do it w you"
                },
                {
                    "author": "Informal_Athlete_724",
                    "text": "He's jealous. He shouldn't of told you his product - that's where he fucked up. Cat's out of the bag now, too late."
                },
                {
                    "author": "Atomic1221",
                    "text": "Sounds like something illegal ngl",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "I can’t respond to all the comments saying this is illegal but it isn’t. Just because I run a successful business doesn’t mean it’s illegal.\n\nThe only thing that I do that is remotely questionable is I do purchase goods from websites that tell ppl to not resell. Like think of shoe resellers purchasing from Nike in bulk. But that’s it. Everything else is completely legal.",
                            "replies": [
                                {
                                    "author": "shaqule_brk",
                                    "text": "Oh, so you're scalping tech products? Or these trendy mugs?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rishiarora",
                    "text": "He's jealous"
                },
                {
                    "author": "mastercoaxial",
                    "text": "Dude what, do not stop. It’s his fault. The pie is more than big enough for the both of you to exist."
                },
                {
                    "author": "ConstructionIcy5680",
                    "text": "wtf do not stop"
                },
                {
                    "author": "sendsouth",
                    "text": "Jealousy by the sounds of it"
                },
                {
                    "author": "INTJ_Innovations",
                    "text": "Why shouls you stop and give up all that income if he isn't even able to give you a good reason? If your brother gets upset that's on him, not on you. Because someone might get upset is not a reason to start or stop a business."
                },
                {
                    "author": "lisamon429",
                    "text": "Your brother cares about himself and wants you to care about him, but who’s caring for you? This isn’t a reasonable request, especially since you already offered to team up. \n\nI don’t know what the product is but is it so specific and profitable that there’s no comparable thing you could introduce to your product mix? Since it sounds like you have lots of customers, you could try to diversify the business and phase out the directly competitive product. I don’t really think you should do that - this is his problem not yours, but if the alternative is to shut down and protect the relationship then maybe it’s worth consideration.",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "Problem is we sell on the same marketplace but it’s like selling red apples and green apples.\n\nWe technically sell different items but they’re within the same category so technically it could be argued we compete. But - without giving away much detail - that argument is pretty much bs. There’s a lot of money to go around.",
                            "replies": [
                                {
                                    "author": "lisamon429",
                                    "text": "If you're not even selling the exact same product, then your brother's request is INSANE. Your brother didn't invent the concept of selling apples, and that he had the audacity to ask you to stop selling for some ill-defined reason is beyond. You're young and you're pulling in crazy money take advantage of it, secure your future by making good financial decisions and for the love of god please do not shut this down!!!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LauraAnderson18",
                    "text": "It seems like your brother feels a mix of ownership and maybe jealousy. He might be worried about losing control or the market shifting. \n\nIf it’s affecting your relationship, stepping back could help, but having a deeper talk with him about your intentions might lead to a better outcome."
                },
                {
                    "author": "buyerandsupplier23",
                    "text": "Don't stop if you really want to. I will run the business for you and I want your brother find out"
                },
                {
                    "author": "SuccessfulYouth7738",
                    "text": "Your brother is obviously jealously and want to destroy your business and you. So say no to him. There is nothing unique about reselling products, he doesnt own any IP nor copyright, he cannot sue you for simply doing the similar business as him. "
                },
                {
                    "author": "Abstract-Color",
                    "text": "Bro got super anxious and J becoz of the profit it makes..Its up to you , how you want to handle this but if i were you I would have not let anybody bully me or emotional manipulate me.I would have continued the business..."
                },
                {
                    "author": "mahin1384",
                    "text": "That’s a tough situation. It sounds like your brother might feel protective of his idea or maybe a bit competitive now that you’re doing so well. I’d try having one more open conversation—let him know how much this business means to you and see if there’s a way to work together or set boundaries that work for both of you."
                },
                {
                    "author": "rohankale1985",
                    "text": "Ask him what he really wants and figure it out!"
                },
                {
                    "author": "june_rudra",
                    "text": "in my opinion, no matter how much you earn, end of the it was his idea and it's only normal how he's feeling uncomfortable, it's okay. good thing he spoke about it, even though he was might have not be straightforward. take this as a challenge and create something of your own and build it from scratch. one thing what's truly yours here - is the knowledge and experience you earned from running the business. hope this helps"
                },
                {
                    "author": "MidwestMSW",
                    "text": "Fuck your brother he's just salty he isn't doing as well.  You gave him an option to team up...which is quiet stupid BTW.  Partnerships seldom work out...let alone partnerships with family."
                },
                {
                    "author": "karnasaurus",
                    "text": "No offence but your brother sounds like an asshole. He gave you his blessing but now that you're successful he's changing his tune. Give him 3 options: Join up forces, come to an arrangement to compensate him for giving you the idea, or go kick rocks."
                },
                {
                    "author": "Mahdouken",
                    "text": "Ask your brother what it would take for him to be comfortable continuing. Tell him you don't want to risk your relationship for the sake of business or money, but it sure would be nice to keep making money. Is there anything that would make him feel more comfortable."
                },
                {
                    "author": "ZoltarGrantsYourWish",
                    "text": "Your buddy ain’t stopping. Just going to replace you."
                },
                {
                    "author": "ChazinPA",
                    "text": "Don’t listen to your brother’s hurt feeling report. \n\nRemind him that he is in the beneficial situation that his competitors are friendly, and have not put him out of business.\n\nIf you guys vacate the market however, the next competitor may be unfriendly and bury his half hearted efforts.  \n\nThen two companies in your family could become zero.\n\nWork the merger angle, give him credit for the idea, but that I would say gets him maybe 50/50 as your enterprise is currently larger and more successful so what you are contributing has higher value, his founder’s credit could even it out but I would not give him control under those circumstances. Because you have proven to be better at operating than he has. \n\nI would present 3 options:\n\n50/50 merger. With defined management rights & responsibilities of all parties in the operating agreements.\n\nHe can buy you out, but you present your employment terms and price you would require to sell and stick to them, you are bigger, so a sale can be on your terms.\n\nStick to current and he can watch your business out performing his month in month out."
                },
                {
                    "author": "Rivercitybruin",
                    "text": "I don't completely understand the corporate,relationship between you and your brother\n\n1) is there major financial risk? There is,where i don't understand if he is,shareholder or competitor?\n\n2) \"reselling stuff\" has been around for thousands of years.. Unless there is clever mechanism in your process, it was just a matter of what to sell\n\n3) depending on your thoughts on #2, give him a 10% net fee for a few years.. And buy his stock at fair price. Fair price is low multiple\n\n4) can you do even more in future? Expand into other items?\n\n5) do you pay yourselves? I am thinking no\n\n6) you need not answer.. Does the item have an association with electronics? (I mean that's 40% of the S&P 500 speaking broadly).. I won't ask further so it's only two category question"
                },
                {
                    "author": "TopAd1369",
                    "text": "Acquire him for 1/3 the stock.  It makes everyone happy."
                },
                {
                    "author": "DigbyGibbers",
                    "text": "Just tell him no. It would be him ruining the relationship and not you. He'll get over it before long."
                },
                {
                    "author": "Rivercitybruin",
                    "text": "Reading all these comments.. You work in same profit pool or not? It's so unclear\n\nSounds like you guys are workers for him.. Let him shut it down and start your own if that is feasible",
                    "replies": [
                        {
                            "author": "Rivercitybruin",
                            "text": "Ok, it seems it is clear.. Start a new venture and,cut him in for small temporary net participation as,a gesture of goodwill"
                        }
                    ]
                },
                {
                    "author": "Rivercitybruin",
                    "text": "There is always a problem for a very small venture when ownership split and profit contribution differ greatly\n\nNot like a big company where those things are separate.. Read up on early MSFT and Paul Allen. He got the greatest \"free ride\" ever and he admitted himself"
                },
                {
                    "author": "AgonizingSquid",
                    "text": "Reading these comments, man there's a lot of dumbfucks here that I don't even think read your full post."
                },
                {
                    "author": "jk10021",
                    "text": "Screw your brother. You have a successful business and he’s jealous. Don’t let him derail your success."
                },
                {
                    "author": "ratman71",
                    "text": "What kind of asshole tells his brother to shut down his lucrative business, especially since you had to \"figure it out\" yourself. Tell him to get bent  or buy it."
                },
                {
                    "author": "JobNo7601",
                    "text": "Wow, jealousy is insane! How does he feel the right to tell you how to “eat and pay bills”, basically. like if he doesn’t pay you to live, to work, etc, he has no right to tell you what to do and should go try and emulate your success… show him the facebook brothers 😂 maybe that’ll inspire him"
                },
                {
                    "author": "JobNo7601",
                    "text": "the day you’re broke, will he help?"
                },
                {
                    "author": "theelephantinthebox",
                    "text": "Ideas are worth basically nothing. Your brother’s very same idea already came to other’s people mind thousands of time. Implementation is king. If he doesn’t understand it, he’s not the genius you think he is. You are killing it because you streamlined the process not because the idea is selling itself. Keep pushing hard on what you are doing."
                },
                {
                    "author": "Henrik-Powers",
                    "text": "Is your brother part of the company, an investor or otherwise involved with the business? If not and what you are doing is all on the up and up “legal” then tell him you appreciate his advice but will run your business as you see fit and tell him you don’t want this to become between you."
                },
                {
                    "author": "1x_time_warper",
                    "text": "You offered for him to join but he refused. Maybe try offering to buy him out or give him royalties."
                },
                {
                    "author": "gibby555",
                    "text": "Sounds like you’ve built something great I wouldn’t give it up!"
                },
                {
                    "author": "illumin8dmind",
                    "text": "Incorporate a company- formalise structure so the company owns the business. It’s no longer ‘yours’. Problem solved - also start thinking about taxes etc"
                },
                {
                    "author": "Vast_Fact_908",
                    "text": "Many good comments in here. What your brother doesn’t seem to understand is that if you’re not competing against him, someone else will. The idea is worth maybe 10%, but you seem to be the one actually executing. NFW would I agree to shut it down to appease him. There’s plenty of reasonable alternatives."
                },
                {
                    "author": "Unintended_incentive",
                    "text": "You should tell him to look up the story of PayPal. Musk originally was competition for Thiel, they ended up barely surviving during the early stages of the dot com boom and put differences aside and merged to save both companies as a new entity that we now know as PayPal. \n\nZero to One has an account of this from Thiels perspective."
                },
                {
                    "author": "Brusanan",
                    "text": "Ideas are worthless. He doesn't get to control your business just because he had the idea."
                },
                {
                    "author": "helpstoppollution",
                    "text": "If you shut down what about your friend? He is just going to stop out of loyalty?\n\n\nWhat happens when the next time you make more than your brother and he wants you to stop?\n\n\nI can understand you want to maintain your relationship, but your brother wants to maintain being better than you it sounds like.  Is that something you are willing to maintain forever?\n\n\nTell him you are willing to discuss a profit share for his idea but asking you to just shut down when he didn't say anything previously is not reasonable."
                },
                {
                    "author": "02bluesuperroo",
                    "text": "I would tell him if he quits his job to do it full time then you will quit and either work for him or find something else to do."
                },
                {
                    "author": "nacholian",
                    "text": "Bro is just jealous lol. Do not stop. That is absolutely foolish."
                },
                {
                    "author": "liquorshakes",
                    "text": "Jealousy and greed. DO NOT CLOSE DOWN. If your brother is willing to hurt the relationship because you are seeing success, is that a relationship you want to keep close? This is about you and your future, not your brother."
                },
                {
                    "author": "captain-doom",
                    "text": "Every business gets competition at some point when others see success. He won’t be able to tell them to stop…"
                },
                {
                    "author": "CulturalToe134",
                    "text": "Dude, do not stop. He's sounding like a sore loser and making you feel bad for doing better than he did. Keep going and see if you can get this going full-time for you and your friend!"
                },
                {
                    "author": "LipTicklers",
                    "text": "So if another company also picks up this idea?"
                },
                {
                    "author": "cookiemonster117",
                    "text": "I’d offer a “finders fee” or give him 10% ownership so he can get distributions each year."
                },
                {
                    "author": "GrimmActual",
                    "text": "He’s being a little bitch because you guys are making more money than he is at his own game, if you want talk to him and say you’ll give him 5% every month for a year or so but that’s it, because it was his idea , I wouldn’t recommend stopping"
                },
                {
                    "author": "Tall_Aardvark_8560",
                    "text": "Steal his part of the market then sleep with his wife.",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "Interesting idea. Let me run it by him first though."
                        }
                    ]
                },
                {
                    "author": "Various-Fold-4308",
                    "text": " He was happy and supportive when you weren’t making as much and now you’re turning more profit than ever and the markets bad? It’s pretty obvious he’s jealous because of you and your friends success. He should be making the change on his end to his attitude. As he’s the one that’s placed your relationship in jeopardy or at least made it feel that way. \n\n Don’t let your brother drag you down when you have something good going for yourself. Clearly his ego cannot handle that you are doing better than him thus it’s preventing him from even joining you guys and making more than he does at his full time job. I would give him another offer and try to get him onboard with what you’re doing. Show him some love and try to help him understand you’re not just trying to “1 up” him but don’t listen to him he’s clearly motivated by his own self interests even around you."
                },
                {
                    "author": "Friendzinmyhead",
                    "text": "Tell him to mind his business or buy yours from you. \n\nHe’s being a big baby and should be ashamed to ask you to upend your livelihood just to make himself feel better. \n\nI guarantee the moment you shut your business down someone else will pop right back up in your place. \n\nIt sounds like he’s still going to school and trying to figure out what he wants to do with his life. You, on the other hand sound like you are fully in on this thing and intend to grow. \n\nDon’t let his insecurities and lack of decisiveness dictate your path."
                },
                {
                    "author": "Octavie_Flinck",
                    "text": "You should have a serious conversion with him about WHY exactly he feels uncomfortable and doesn't want you part of the business anymore"
                },
                {
                    "author": "Luckylandcruiser",
                    "text": "What kind of business? Honestly this makes a big difference. How specialized is this?"
                },
                {
                    "author": "homer01010101",
                    "text": "Are you two close?  If so, go see him and find out what is really going on.  Pretty simple.\n\nRe-offer him to join in and show him how much more $$ he would make.  If he does not accept, look him in the eye and politely stand your ground.  You are providing for YOUR family and “Why does he have any say in what affects YOUR family.  Keep the discussion light, if possible, but giving him a chance to talk face-to-face with you shows him a ton of respect.   It doesn’t matter where he lives…. GO THERE AND TAKE THE TIME EARLY in your business’s life cycle."
                },
                {
                    "author": "dank_shit_poster69",
                    "text": "Ideas have no value without execution.\nYou figured out how to execute. That's where the value is. \n\nHe needs to grow up & gain the maturity to support his friends and family when they're successful. And face his insecurities around tying self worth to work outcomes."
                },
                {
                    "author": "hasanDask",
                    "text": "Your brother is acting like a loser and should be ashamed of himself."
                },
                {
                    "author": "Imaginary-Ear-2220",
                    "text": "Your brother doesn’t want you to stop your business. He wants to stop your SUCCESS. It is only fair he quit his job and stop working to be a good brother. If he can’t do that, he shouldn’t expect you to do so."
                },
                {
                    "author": "Full-Bathroom-2526",
                    "text": "What's the business? Sounds quasi-legit or you wouldn't want to walk away from it, just because your brother says stop.",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "I can't tell you what the business is man. \n\n  \nIt's legit. The only part that is \"quasi\" is that I source my items SOMETIMES from websites that tell people not to resell their items. Besides that though everything else is legit.\n\nThere is a shit ton of bullshit I deal with everyday. It's a lot of manual work. A lot of buying --> focus is on moving high volumes of stuff for low margins. We buy around 1500-1600 of these a month, sell around 1200, refund the rest, and make about 10-15 dollars per item. It's very difficult to automate and requires multiple people to keep track of all the moving processes.\n\n  \nI am very glad to be in a position where I can choose whether to continue this or not, but I'm not sure how sustainable this business is. As mentioned, it could die out within 5-10 years if other people figure it out; it's not some revolutionary SaaS service. So, I think it's incredibly risky to put all my ideas in this one basket, which is maybe why I'm don't seem devestated about stopping.\n\nDon't get me wrong though - making an extra 80-90k a year would help a fuck ton. I'm 24 years old and at this point this is life changing money.",
                            "replies": [
                                {
                                    "author": "Full-Bathroom-2526",
                                    "text": "Good luck"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RamBamoDam",
                    "text": "If it’s making money, don’t shut it down… but there’s just no way you didn’t think this wasn’t going to backfire on you. You gotta make the decision yourself man. Don’t rely on Reddit to ruin/fix your brothers relationship"
                },
                {
                    "author": "RiotsAndWarfare",
                    "text": "Fuck him!!! Any brother who wants to kill you off like that isnt being very brotherly. I would never do this to my bro, and it sounds like he is jealous. Offer him a partnership or he can fuck off."
                },
                {
                    "author": "Free-Isopod-4788",
                    "text": "He needs to buy the business from you, or you sell it to someone else."
                },
                {
                    "author": "madoneforever",
                    "text": "I would talk to your brother. Say something along the lines of “I really appreciate you sharing your knowledge. Is there anyway I can show how much I appreciate you, your ideas and inspiration?…mention that you are going to do your own thing (don’t elaborate.) Going forward, I would keep your business success to yourself. If asked keep it simple. Business is “ok.”"
                },
                {
                    "author": "iberonni",
                    "text": "Why didnt you join your brothers company instead of doing the same thing as a separate entity?"
                },
                {
                    "author": "sdriemline",
                    "text": "You are not his real competition. The Chinese sellers that are about to figure out how you are making 15k are.  The more market share \nyou and your brothers companies get the better.  Do not compete against each other there is an entire army of real competitors out there that you both need to crush and stay ahead of.  Do not get distracted by what each other are doing.  The entire market doesn't come close to noticing 18k per month."
                },
                {
                    "author": "BTC-Broker",
                    "text": "Is the product your selling like a legal product or could it be considered a black market item?",
                    "replies": [
                        {
                            "author": "JudgeInteresting8615",
                            "text": "Even if it was illegal or black market, business conditions and human behavior still exist all the same. So I don't understand what all these questions are hoping to achieve.",
                            "replies": [
                                {
                                    "author": "BTC-Broker",
                                    "text": "Would give a genuine reason his brother may want him out, eg the scene is getting more dangerous etc."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ResearchEffective660",
                    "text": "Can you guide me? I am looking to start my own business.",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "I mean, I’m not really sure how much help I could give. I got really lucky that I pretty much already had a brother that had an idea that worked. So I don’t think I would be the best outlet to give you advice about starting a business.\n\nRunning a business/mental aspects that’s a different story and I’m happy to talk abt it through dms if you would like. Although can say this openly that probably 99 percent of what I’ve learned has been through making my own mistakes.",
                            "replies": [
                                {
                                    "author": "ImaginationSeveral64",
                                    "text": "Have U ever dropshipped"
                                },
                                {
                                    "author": "ResearchEffective660",
                                    "text": "Thanks. I sent you a direct message, please chck."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Altruistic-Chair-399",
                    "text": "Why don’t you guys just merge the 2 businesses?",
                    "replies": [
                        {
                            "author": "theponderingpoet",
                            "text": "Please man for the love of god read my post..."
                        }
                    ]
                }
            ]
        },
        {
            "title": "Tech Co-Founder here! Looking to build Local platform together!",
            "author": "KadriShazan",
            "text": "I am Kadri Shazan, 28, platform maker, I have build two products elpage.live and redditsurfer.live all by myself completed this two products from frontend to fully functional web app. \nIt was hard to get it profitable as marketing is missing and required money. I am looking for someone who I can build platforms for them to grow it and invest and make it full scale platform.\nLet's connect",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "First-Meet-5260",
                    "text": "I personally am not in the tech space, but there are quite a few in a discord community I'm in! It has 160 people, all from this subreddit, with the one goal of building a space to talk about business and entrepreneurship. There is also no spamming or selling or promoting allowed, but that's only for selling someone's services, so you should be able to pretty much copy and paste your post and maybe find someone interested! Here is the link if you are interested: [https://discord.gg/VhrR9YRp](https://discord.gg/VhrR9YRp)"
                },
                {
                    "author": "Ill-Appearance1192",
                    "text": "Hey, I would like to connect with you."
                },
                {
                    "author": "Typical-Buy-9237",
                    "text": "Oh"
                },
                {
                    "author": "CremeSevere960",
                    "text": "Would love to connect Kadri"
                },
                {
                    "author": "craciun_07",
                    "text": "I am not your target user, but I have a website [DevMarket.pro](https://www.DevMarket.pro) that may have some designers that are looking for a partnership.\n\nIt's an extra channel for you to (hopefully) find the person you're looking for faster."
                },
                {
                    "author": "kodeepaulconsultant",
                    "text": "[https://www.linkedin.com/in/kodeeswaranp/](https://www.linkedin.com/in/kodeeswaranp/) \\- let connect"
                },
                {
                    "author": "Peterpan1845",
                    "text": "Shoot me a DM"
                }
            ]
        },
        {
            "title": "We hit $10k MRR by launching over and and over again. Here is how we did it.",
            "author": "CraftyKick5346",
            "text": "One of the things I think first time founders get wrong imo is that they not only wait too long to launch but also put way too much effort and time into their launch.\n\nThis mistake I believe is mostly because most of them assume launching is a one time thing. Yet, the truth is, you can launch over and over again in same and different places. And for each time, you get to iterate messaging, product and pricing based on all the learnings from the previous launch.\n\nIn fact, I recommend doing this to almost anyone who is getting started. And here is exactly how we did it.\n\n1. Every week, we published a completely new landing page under a new domain based on learnings from previous launch\n2. We then launched it on Product Hunt, Hackernews and Reddit.\n3. For product hunt launch, if you can afford, use an agency like tetriz to guarantee a top 5 spot since they usually have a network that will upvote for you. Alternatively, if you have a strong linkedIn, that helps to create some early traction.\n4. For reddit, you can either choose subreddits that allow promotion or again hire an agency like krankly who can work around the rules using certain black hat tactics (grey area but works)\n5. We repeated this almost 13 times now\n6. Our first few launches gave us like $100 in MRR\n7. By our 7th launch, we were making $1k in MRR per launch\n8. And as of today we have $10k in MRR\n\nHope this helps. If you have any questions, just let me know below :)",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "effyochicken",
                    "text": "This is the funniest form of A-B testing I’ve ever seen lol. Just relaunch the entire product over and over again until you find an angle that works. \n\nWhat’s the base product? I’m assuming it’s a software? ",
                    "replies": [
                        {
                            "author": "CraftyKick5346",
                            "text": "We help ecommerce shops grow faster using AI :)",
                            "replies": [
                                {
                                    "author": "MrPokeeeee",
                                    "text": "Dm me"
                                },
                                {
                                    "author": "sorainyuser",
                                    "text": "Dm me too, i have my own shop, and creating 3/5 new shop for new customers monthly."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spam-r1",
                    "text": "I think the mistake happens because most first time founders treat their product like a piece of art rather than just a tool to sell\n\nBut you are absolutely right in your approach, congratz!",
                    "replies": [
                        {
                            "author": "Jg_Tensaii",
                            "text": "totally agree, this is what happened with my first product, every told me it's great and nice to look at it but very little people were using it."
                        },
                        {
                            "author": "-nuuk-",
                            "text": "Agree"
                        }
                    ]
                },
                {
                    "author": "hpdcthefoodie",
                    "text": "what is your product?"
                },
                {
                    "author": "Peter_Kow",
                    "text": "Damn... I've been thinking about it but it seems like a lot of branding, copywriting etc.... but also you are right that now with AI you can just generate your website and have it all live in a couple of hours. I did 5 websites with custom domains using Pineapple Builder for the AI website and analytics... but I guess I could launch a new business every week?\n\nIs that the approach you suggest?",
                    "replies": [
                        {
                            "author": "Leading-Damage6331",
                            "text": "He is saying to keep relaunching the same bussiness every week on different platforms and communities",
                            "replies": [
                                {
                                    "author": "Peter_Kow",
                                    "text": "Yes, and even the same platforms , but also under new domain, so I guess with a website."
                                }
                            ]
                        },
                        {
                            "author": "CraftyKick5346",
                            "text": "Both works imo. For the same idea, it makes sense to launch multiple times. And if you dont have an idea yet, it makes sense to launch an idea per week or so till something sticks! Only issues is burnout/whiplash after a point if you are not getting traction. Well that and sometimes you get stuck in the wrong market. So you might need to step back and reset everything"
                        },
                        {
                            "author": "Leading-Damage6331",
                            "text": "He is saying to keep relaunching the same bussiness every week on different platforms and communities"
                        }
                    ]
                },
                {
                    "author": "Careless_Heat907",
                    "text": "Love this \"launch and learn\" approach! It's a smart way to validate your idea and find product-market fit. Did you use any specific tools or resources to manage all those different landing pages and launches?"
                },
                {
                    "author": "AccomplishedArt1791",
                    "text": "Great, it works for you, but I don't think it's a good idea for everyone. If I wanted to launch something in a similar manner, I would launch a free tool or directory every week, either as a subdomain or a new domain, targeting the same audience. Instead of launching a new domain for the same idea every week, I could easily promote those free tools or directories on all the platforms you mentioned, as well as on relevant platforms and directories.\n\nBased on that, if any of the tools get a good amount of traffic, I would double down on that tool."
                },
                {
                    "author": "GoldenTree9999",
                    "text": "Really? change landing page and domain config every week? that's a lot engineering power.   \nWhere on Reddit does any subreddit allow self promotion, haven't found any.  \nbut congrats on your progress!"
                },
                {
                    "author": "ssj1236",
                    "text": "Definitely sounds like some Ai slop that caught on cause of the hype. Will be a wait and see how well it fairs in the running. "
                }
            ]
        },
        {
            "title": "High income skills",
            "author": "carlos387",
            "text": "Hi guys . 16 yo currently not in education or apprenticeship so got lots of spare time atm. Looking for an online skill I can learn and make some money . What would you recommend ? I know that all the stuff you see on tiktok talking about making thousands in ur first month doing little to no work is a load of waffle . Cheers ",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "Nerditshka",
                    "text": "Sales. Has so many transferable skills.",
                    "replies": [
                        {
                            "author": "PrestigiousLeopard47",
                            "text": "So incredibly true. I'd also add building. As the saying goes, \"if you can sell and build, you will be unstoppable\"  Building doesn't necessarily mean physical things, but companies, products, systems, etc",
                            "replies": [
                                {
                                    "author": "First-Meet-5260",
                                    "text": "I absolutely love learning and talking about sales, but it's hard to find other people as interested. If anyone is interested, there's a discord community with 160 people, all from this subreddit, and there's no spamming, selling, or promoting of any services on there. There's tons of successful business owners in distribution, tech, web design, and real estate. I would love to engage in some talk about sales in there if anyone is interested. Here is the link: [https://discord.gg/VhrR9YRp](https://discord.gg/VhrR9YRp)"
                                }
                            ]
                        },
                        {
                            "author": "carlos387",
                            "text": "Would it be worth doing an online course and getting a qualification or would I be better off just watching videos and learning that way",
                            "replies": [
                                {
                                    "author": "Nerditshka",
                                    "text": "Watch videos and practice. Not sure if sales certification are valued. But here's the thing, the most influential people I met, know, read about have experience in sales.  It teaches you how to negotiate, lead and convince others to go your way. It will also help you understand aspects of the human psychology. \nAnd those my friend are skills that will take you to the top."
                                },
                                {
                                    "author": "FunFerret2113",
                                    "text": "Neither, by selling!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DigitalRichie",
                    "text": "Learn people skills over technical skills. \n\nIf you understand how people behave and react, and you understand how to engage authentically, whatever field you enter into later in life, whether you're employed or you start your own business, knowing *people*, understanding psychology, will be much more advantagious than knowing *things*.  \n\nSincerely, a bloke who's knocking on 50.",
                    "replies": [
                        {
                            "author": "SpeechGENXDogs",
                            "text": "This is the BEST answer on Reddit. I worked for a staffing agency and you would not believe the emphasis put on personality hires. This is the fact. People want to work with people they like. Period."
                        },
                        {
                            "author": "ConsistentArmy4943",
                            "text": "33 year old tech consultant here that totally agrees. I get paid far more than a lot of my technical counterparts just because I'm good with people and my company can trust me to be in front of customers. I have the same technical knowledge (if not less) than our help desk people, but I get paid probably 40% more because of the people side."
                        }
                    ]
                },
                {
                    "author": "iamawizaard",
                    "text": "the answers seem to be coming from 16 year olds too. haha!",
                    "replies": [
                        {
                            "author": "KnahD",
                            "text": "I thought the same"
                        },
                        {
                            "author": "Consistent-Soil-1818",
                            "text": "What do you mean? I made 4 trillion USD in my first week, it's easy. You need to work hard and get up when you fall. I can tell you all the secrets you need to know to become a successful entrepreneur in only 2 weeks. Buy my course with an Apple gift card. DM me for more details."
                        }
                    ]
                },
                {
                    "author": "IamshaqR",
                    "text": "If you’re UK based, look at doing a SAP Assessment course. It’s a service required for new build housing developments, you can charge approx. £300 for around 2 hours worth of work."
                },
                {
                    "author": "Maxxedlife",
                    "text": "In the 20yrs I been running businesses online, I have found writing to be the master skill that unlocks most of the others. \n\nEven big YouTubers usually write scripts before filming. And if you write scripts for TikTok videos they will be even better. \n\n85% or more of the millions I have made have come from writing emails to my email list. But social media and content (blogs, YouTube, podcasts) have driven people into my email lists."
                },
                {
                    "author": "yeetingonyourface",
                    "text": "Best thing you can do is learn how to network and get some kind of degree doesn’t have to be a bachelor’s but trust me it helps open doors"
                },
                {
                    "author": "WordCorrect4136",
                    "text": "Dude learn how to program not even kidding. This should be the only thing on your mind. Don’t listen to anything else."
                },
                {
                    "author": "JacksonSellsExcellen",
                    "text": "Sales.  It's kind of the only skill that matters."
                },
                {
                    "author": "Helpful-Rise-4192",
                    "text": "I thought myself make .com last year in one Week now people pay me $50+ on upwork per h",
                    "replies": [
                        {
                            "author": "Rivercitybruin",
                            "text": "Make.com? Is that correct?",
                            "replies": [
                                {
                                    "author": "acobb99",
                                    "text": "I think they’re saying ‘I taught myself how to make websites (ie .com)’"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "[deleted]",
                    "text": "[deleted]",
                    "replies": [
                        {
                            "author": "carlos387",
                            "text": "What actually is copywriting? Can you explain it like I’m 5 , don’t understand the google explanation too well",
                            "replies": [
                                {
                                    "author": "LibrarianExisting915",
                                    "text": "It’s creating text for ads and online presence in general- but not just random text, it has to bring out emotion and guide the reader towards the act of purchasing. So it has to be well thought out and also keep in mind some technicalities (trends, SEO, target market it’s aimed at etc) \nIs this a bit more clear definition?"
                                },
                                {
                                    "author": "[deleted]",
                                    "text": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChiefOpportunist",
                    "text": "AI Operator apparently"
                },
                {
                    "author": "FollowingInside5766",
                    "text": "stuff out there."
                },
                {
                    "author": "Commercial_Slip_3903",
                    "text": "Sales and building. With AI. There are going to be a lot of people building with AI.\n\n So you need the complementary marketing/sales skills - they go hand in hand \n\nGet a handle on those two and you’ll be good to go"
                },
                {
                    "author": "mahin1384",
                    "text": "Practice a skill. Find what you enjoy, be it programming, creating music, learning about some topic etc",
                    "replies": [
                        {
                            "author": "sammiexr",
                            "text": "Hey there \n\nI'm seeking a $200 investment for a companionship service providing personalized connections for individuals combating loneliness. In exchange, you'll receive a 5% equity stake in the business, entitling you to a percentage of the revenue for as long as it operates. Funds will be allocated to ads and ad revenue growth, capitalizing on a unique and growing market. By investing, you'll contribute to a socially impactful business making a positive difference in people's lives. If you're interested, let's schedule a call to discuss further.\n\nBest regards,\nSamuel"
                        }
                    ]
                },
                {
                    "author": "CQ_TheWatchGuy",
                    "text": "SALES! Find something you are passionate about and learn to sell it. If you like Luxury items you're a great age to pop into stores and ask about an internship or weekend job now or in the future. Just practicing selling something 1 day a week will help build amazing skills that can take you anywhere you want to be if you are willing to work at it and refine your skills. You would be amazed by the doors that can open just because you know how to talk and engage with people and leave a good impression. Good Luck!"
                },
                {
                    "author": "awlyewancook",
                    "text": "I think it's important to learn the school base, exact sciences now, money will be made in time. And in the process, you may find something you like, and the job will not take long to find you16 y.o. seller LOL"
                },
                {
                    "author": "spacemunkey336",
                    "text": "Broadly speaking, critical thinking and problem-solving skills always pay off"
                },
                {
                    "author": "Initial-Cat-5379",
                    "text": "Try a skill that every company seems to need, like email marketing, copywriting, or SEO. These are always in demand and so easy to learn online, like its all over youtube."
                },
                {
                    "author": "KaiCabrera208",
                    "text": "Find a job as a setter"
                },
                {
                    "author": "KaiCabrera208",
                    "text": "Go be a Setter for a great closer"
                },
                {
                    "author": "DarePsycho",
                    "text": "The most valuable realistic skill you can have is problem solving and critical thinking. Do all those critical thinking problems in your text book and build those skills. With that you can literally get any job anywhere and make huge amount of money with no restrictions"
                },
                {
                    "author": "naturalmystic420",
                    "text": "I'd recommend volunteering and developing leadership skills."
                },
                {
                    "author": "Loud_Cut_304",
                    "text": "Sales"
                },
                {
                    "author": "Noire_Lab",
                    "text": "Bro, I’ve got an awesome suggestion for you: learn something in the field of artificial intelligence. Trump’s already invested a ton of money into it—it’s the future, man. Take action, and in a few years, you definitely won’t regret your choice. 🚀🤖"
                },
                {
                    "author": "CulturalToe134",
                    "text": "Sales or marketing is likely one of the easiest in a market like this. There's a lower barrier to entry, you can start picking up skills, making money, and just keep going."
                },
                {
                    "author": "Conscious_Weight_642",
                    "text": "Easy, sales and copywriting. You’re mastering the psychology of people and how that plays into their decision making process - so many transferable skills."
                },
                {
                    "author": "swissmcnoodle",
                    "text": "Going back to school would have the biggest and fastest roi"
                },
                {
                    "author": "False-Idea6227",
                    "text": "Learn to program."
                },
                {
                    "author": "CreateAUnit",
                    "text": "Sales\nIs the best skill by a Country  mile."
                },
                {
                    "author": "GoldenTree9999",
                    "text": "Marketing and sales, I build software and one thing I realized is that marketing and sales are very important, it takes a lot to hussle, make your name out there."
                },
                {
                    "author": "PossibleHeron3511",
                    "text": "FB Ads! \n\nAlso i can help you with that if you want"
                },
                {
                    "author": "HerroPhish",
                    "text": "Go sell some shit door to door"
                },
                {
                    "author": "Libra224",
                    "text": "Sales Will always make money.\nOtherwise If you’re a nerd you could also do AI or crypto dev. \n\nBut sales works regardless of the domain, \n\nSo much that whatever you do I would suggest to learn sales on the side",
                    "replies": [
                        {
                            "author": "WordCorrect4136",
                            "text": "Crypto dev. It’s the future and it’s fast money. AI is overhyped and will go into winter for a long time and you can’t even participate if you’re not like a 40 year old PhD"
                        },
                        {
                            "author": "carlos387",
                            "text": "Sales has always interested me , just not sure how to get my foot in the door",
                            "replies": [
                                {
                                    "author": "LibrarianExisting915",
                                    "text": "More specific example: \nLet’s say you are into fitness and go to the gym a lot so you have some knowledge on machines and what people tend to use the most. You find some gym equipment stores online and contact them. You offer your services and see how much are they willing to pay you for each client you bring them (%). Then you contact bunch of gyms and sports clubs offering them those products, the best would of course be to find a chain of gyms that are constantly opening all over the place. That’s sales in a nutshell basically"
                                },
                                {
                                    "author": "Libra224",
                                    "text": "Great then ! Go for it, it’s a lot of work and a lot of hours but you’ll be happy with the result, work hard and you can invest all the money so later when you’re 40+ (even 30?) you can work a relaxed job and take care of your family"
                                },
                                {
                                    "author": "LibrarianExisting915",
                                    "text": "To start I would suggest: find an industry you’re interested in and have some knowledge about (IT would be my first suggestion as I personally made the most money from those), learn a bit more about it and get to reading and learning about sales online. Just ways to approach a sales pitch, a bit about sales tunnels and work on your email writing skills as well. Then create a very strong cold email that you will adjust for each outreach you make. Open LinkedIn and company wall site or just reach out to local businesses in your area offering your services. After you make your first sale it usually picks up from there with much faster pace.. the first one is the hardest one. Also in this area networking is quite important. So check some business meet ups and conferences in your area that you are able to attend. \nThat’s what I would suggest as a start in sales :D"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LibrarianExisting915",
                    "text": "Software development, UX/UI design, digital marketing (SEO, Google ads, content creation, Social media management, copywriting)\n\nThose would be my suggestions for high income skills :)",
                    "replies": [
                        {
                            "author": "kell3023",
                            "text": "This is what I’m interested in, I was even signed up to get a degree in UX/UI design. But in the back of my mind all I think about is AI. Is it something to worry about?",
                            "replies": [
                                {
                                    "author": "LibrarianExisting915",
                                    "text": "My opinion is no you shouldn’t be. You can even incorporate ai tools to bring your work to next level, but for now I don’t see AI taking away design jobs, human touch is what sells. AI solutions are good for startups without budget, but even then, as soon as they can afford it they will usually do a redesign with an actual experts. \nKeep yourself up to date with ai tools and how to incorporate them with your work and you should be fine :)"
                                },
                                {
                                    "author": "Natureboy_Rich",
                                    "text": "Real talk, use AI to help you. During learning and development use it. It’s not something to be scared of, however it’s not going away but neither are the jobs they supposedly are replacing."
                                }
                            ]
                        },
                        {
                            "author": "carlos387",
                            "text": "Is digital marketing and software development still worth learning ? Seems everyone and their mum is doing it atm",
                            "replies": [
                                {
                                    "author": "RossDCurrie",
                                    "text": "digital marketing is low barrier to entry. Anyone can stick up a sign and say they do it.\n\nThey can't necessarily do it well, but that's something else.\n\nSoftware development is a high barrier to entry skill - even with ai coding tools getting better, there's still a fairly high barrier to entry for this skillset"
                                },
                                {
                                    "author": "LibrarianExisting915",
                                    "text": "I believe so, I make money freelancing in digital marketing. There is a difference between everyone doing it and actually knowing it. If you are able to bring results to clients then it’s different from those presenting themselves as professionals when in reality they don’t make results or bring value to clients.  They won’t be making a lot (if any) money and they are just selling smoke which becomes quite obvious very soon. Digital marketing is not simply posting a reel on instagram. So if you dive deeper into the subject and learn those skills properly it will produce income. Another skill that’s very profitable to have is Sales. You can reach out to bunch of companies that sell goods or services and offer b2b sales service based on commission. Companies tend to agree on that since it’s without an actual cost to them, and let’s say you find a client for a software development company- those projects are expensive and you can walk away with quite a commission."
                                },
                                {
                                    "author": "AbbreviationsLow4798",
                                    "text": "if you want to be dying at the 8th round of interviews where they ask you to prove that americans wasn’t on the moon,\nbecause they already don’t know what to ask you more to choose between you and 100 other applicants then yes, it’s a work of a dream."
                                },
                                {
                                    "author": "Romanticon",
                                    "text": "Digital marketing can be worth doing because most people are bad at it. \n\nI’m one of them. I use Facebook ads but I’ll freely admit that I don’t understand a lot of their capabilities and I could have better, more finely tuned ads. \n\nI haven’t even touched ads on Google or Amazon. \n\nThey are powerful tools and most people don’t understand most of what they do."
                                },
                                {
                                    "author": "Rivercitybruin",
                                    "text": "Might not be worthwhile on its own if you want to make $100k+ but for $15 a hour and have unique life skill, it is worthwhile"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Objective_Fix_903",
                    "text": "Ok"
                },
                {
                    "author": "Unique_Ad_330",
                    "text": "Software Dev, Sales, Marketing"
                },
                {
                    "author": "future-millionare",
                    "text": "U Aussie too by any chance mate?",
                    "replies": [
                        {
                            "author": "carlos387",
                            "text": "Nah brother english",
                            "replies": [
                                {
                                    "author": "future-millionare",
                                    "text": "Oh ok thought u were Aussie bc not a lot of people say cheers online lol"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Original_Ad6887",
                    "text": "Maybe affiliate marketing?"
                },
                {
                    "author": "CanIGetAHuyah",
                    "text": "honestly dude, play some video games and make some memories. seriously.",
                    "replies": [
                        {
                            "author": "carlos387",
                            "text": "Going mental sat at home playing on my pc while all my pals are at college lol, it’s only fun for the first 2 weeks so I might aswell do something while I’m looking for work"
                        },
                        {
                            "author": "sampleCoin",
                            "text": "what."
                        }
                    ]
                }
            ]
        },
        {
            "title": "Entrepreneurship can be terrifying...",
            "author": "zoozla",
            "text": "To anyone who needs to hear it this morning:\n\nEntrepreneurship can outright terrifying, but it's just an emotion.\n\nIn reality the more you get pushed into a corner the more resources and capabilities you discover.\n\nThings that seemed impossible suddenly become easy.\n\nYou've got this!\n\n(And so do I)\n",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "AllUrUpsAreBelong2Us",
                    "text": "Get comfortable in being uncomfortable.\n\nAnd do not get stuck in coping mechanisms such as booze, drugs and sex.\n\nBeen there, done her, got the STD's.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": ":) Exactly. Unfortunately it's so intense that many people do reach for their addictions to cope. Which takes quite a bit out of the eventual win, and often kills your chances in the process."
                        },
                        {
                            "author": "AggyResult",
                            "text": "I actually went the opposite way. I think the focus and knowing I had to do it myself helped me kick my vices."
                        }
                    ]
                },
                {
                    "author": "CharacterDiscount936",
                    "text": "Thank you",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "My pleasure. Are you going through a bottleneck of some sort?",
                            "replies": [
                                {
                                    "author": "CharacterDiscount936",
                                    "text": "Not really, we are working on our first product and I am not sure how the market will respond to it, but if it fails, at least I can say we believed in ourselves and build something. Though I think I should know how it will do since I should perpetually be in communication with the target market."
                                },
                                {
                                    "author": "sammiexr",
                                    "text": "I am and I'm just starting at age 19 I need allot of advice"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sammiexr",
                    "text": "It's a dog eat dog world out there I'm 19 trying to push things and damn it's hard",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "I hear you man. It's good that you're starting out so young. It takes about a decade to get good at this like with anything else, and the earlier you start the more time you have to revel in your success.",
                            "replies": [
                                {
                                    "author": "sammiexr",
                                    "text": "Thanks allot can you send me a message please reddit won't let me send messages"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "theonewhodiddled-u",
                    "text": "It’s not that bad",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "I'm unironically to hear it's working out for you. It doesn't always, but it's beautiful when it does. Things are going well then?",
                            "replies": [
                                {
                                    "author": "theonewhodiddled-u",
                                    "text": "Yes pretty good, don’t be discouraged"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "everybodyspapa",
                    "text": "Whoever says it's terrifying is either...\n\nA: dramatic.\nB: over invested and didn't come up with a good exit strategy before starting.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "There's no exit strategy to entrepreneurship. It's a life style and those who choose it don't do so voluntarily. You may have an exit strategy for a particular business or choice, but not to who you are.\n\nAlso, the other side of terrifying is exhilarating. And I live for this shit. But you do you."
                        }
                    ]
                },
                {
                    "author": "Sufficient-Copy-9012",
                    "text": "How you come bottleneck if you are not technical ? Yet not in stage to look for technical co-founder to build the idea.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "The easiest answer is to start a non technical business or start with the non technical sides of it.\n\nIf you can line up clients willing to pay, you'll have no lack of tech guys wanting to join you and build with you.\n\nIf you don't have tech skills and can't sell either (especially things that don't exist yet), you're going to face a bit of a learning curve."
                        }
                    ]
                },
                {
                    "author": "your_debot",
                    "text": "What I've learnt is that sooner you start to fail faster you will succeed. We are gonna have failures anyway, so let those happen as soon as possible so we learn and move on.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "That's absolutely true. It's just emotionally hard to face those potential failures when you're jumping into the ocean and even harder to deal with them when you're swimming with the sharks.\n\nThat s why I used the word \"terrifying\" despite some objections here. It's definitely terrifying the first time around. Somewhat less so in futire rounds, but every step up - in scale, in velocity, in type of business - is still terrifying."
                        }
                    ]
                },
                {
                    "author": "ortagamalice",
                    "text": "agree, the pressure uncovers strengths you didn’t know you had. It gets easier the more you push through. Keep going"
                },
                {
                    "author": "GoldenTree9999",
                    "text": "I built a few software and currently trying to figure out the marketing and sales part. if anyone has any good advice, I'd like to listen and learn.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "I've got a small free Minimal Viable Marketing course on my YT. Could be a good starting point for you.\n\nI'm also working on a sales course for devs if you're more into B2B stuff.",
                            "replies": [
                                {
                                    "author": "GoldenTree9999",
                                    "text": "DM you!"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "What are my options? How do you fund a startup in your early 20’s without any collateral?",
            "author": "jrc1515",
            "text": "Here’s the scenario: You’re 22 years old, fresh out of college with a degree in Business. You have a rock solid business plan that requires $100,000 to fund. You have zero collateral besides a vehicle worth ~$10,000 and a part-time job making ~$30,000 annually. Borrowing from family is a no-go. How do you go about funding your dream? \n \nEdit: If anyone here is looking to park 50-100k making a healthy APY for a decade or so, let’s talk. Worth a shot, right?",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "adrenaline681",
                    "text": "Work like a savage at your main job and in your free time work like a savage on your company."
                },
                {
                    "author": "freshairproject",
                    "text": "Work a 9-5 job and save up. During that time, get promoted, get better jobs, and save up even more.   \n  \nRead the book \"originals\" by Adam Grant which shares a few stories of entrepreneurs who had a 9-5 job while they founded their startup.\n\nDuring the time, work on your startup project. Find ways to create a MVP cheaper, learn the skills to do it yourself (for example learn coding, or AI, or \\_\\_\\_\\_\\_ if thats a requirement).   \n  \nGrow a following on social media or email, so when you do launch, theres already buyers ready to spend. Marketing is a HUGE cost. Having a large email list makes your startup more valuable, and future investors will consider this. \n\nBy the way, I hope you can launch as soon as possible, but it doesn't matter if you launch in 10-15 years, it really doesn't. Theres a lot of hype on youtube, but its not always reality. \n\nGood Luck!"
                },
                {
                    "author": "Individual-Target-20",
                    "text": "Find a way to do it for 10K. No one is going to loan you money for an idea. You can do it. \n\nI started my business with zero capital, and I now produce over 1M a year,\n\nDM me if you want some guidance on how to get it done.",
                    "replies": [
                        {
                            "author": "reallytanner",
                            "text": "what business? :)",
                            "replies": [
                                {
                                    "author": "Individual-Target-20",
                                    "text": "I build customized trade show exhibits. If I had to start today with no experience I would look into some home service business.\n\nExample: my wife just paid over 2k to have our front door stained. I looked around and could not find anyone to even quote it.\n\nGutter cleaning, siding, concrete lifting…."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ibrahim_132",
                    "text": "Either start a side hustle and save up or if you can make a MVP and try to validate it people will fund the MVP if they find it useful and it will help you determine whether your plan is viable in the market as a lot of ideas fail when they come into existence due to environmental factor such as people may not deem it a core need for them. Try to make an MVP and then you can look at YC they have a lot of investors"
                },
                {
                    "author": "[deleted]",
                    "text": "[deleted]",
                    "replies": [
                        {
                            "author": "LivingLasers",
                            "text": "It was hard to get an sba loan for a property and I was selling a million with decent profit margins because I was under two years old."
                        }
                    ]
                },
                {
                    "author": "ragabekov",
                    "text": "On the very early stage you can get money from FFF ( family + friends (they know you and would like to support ) and fools ).\n\nIf it is a startup and your plan is to do something innovative that will solve problems for customers more effectively than now, then you can try to find first customers who might be your first investors or who might pay you upfront."
                },
                {
                    "author": "theDoodoo22",
                    "text": "Lots of advice here which is great. Get in front of people now. At 22 a lot of older biz guys will give you time as we were all there at one point. So get in front of wealthy business owners. Actually target them and walk into the office and personally hand over a biz plan. \n\nAnother point is, is it’s really $100k it’s not a lot, but also, if it’s say $10k per month until profitable that’s also a decent way to pitch it. \n\nYour first lesson is going to be how important building a network is. Go out and get in front of people now. \n\nAlso DM me your plan and I’ll look at it"
                },
                {
                    "author": "Terrible-Guitar-5638",
                    "text": "That's such an arbitrary figure to pull. What's your business? Have you proven market fit? Is seller financing or leasing an option?\n\nNeed more info.",
                    "replies": [
                        {
                            "author": "jrc1515",
                            "text": "It’s not very arbitrary in my case. I sense you’ve read some of my older posts, in which case you know this business requires the purchase of real estate. Seller financing has been discussed with the seller, however their terms are extremely unfavorable.",
                            "replies": [
                                {
                                    "author": "Terrible-Guitar-5638",
                                    "text": "Hadn't but have now. \n\nUnsolicited advice but you're looking at well over 100k for a very hands on, capital intensive startup. \n\nToo many people online paint pictures of rainbows & butterflies with campgrounds while glossing over the nitty gritty. They are a lot of ongoing work and capital expense. \n\nIf you want to discuss further, I can probably talk you out of it. I almost went down this route at one point."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "p1z4rr0",
                    "text": "I guarantee your business plan at 22 isn't rock solid.  Be ready to pivot.  Doesn't mean you can't make it work, but just be aware.  Work like a dog for 5 or even 10 years and save up some money.  Implement your business plan in phases."
                },
                {
                    "author": "BoshansStudios",
                    "text": "read the book \"The Millionaire Fastlane\"\n\nwhy do you need 100k to get started? Why can't you get started for $1,000 for instance?"
                },
                {
                    "author": "Tardiculous",
                    "text": "Get a sales job and save the 100k. If you can’t make that while getting paid to learn to sell, you wouldn’t make it in business anyway.",
                    "replies": [
                        {
                            "author": "relevante",
                            "text": "Good advice. It's like getting paid to go back to school. Looking back, it's probably what I should have done."
                        },
                        {
                            "author": "Fantastic-Idea611",
                            "text": "Curious to hear what field you recommend? Any specific niche?",
                            "replies": [
                                {
                                    "author": "Tardiculous",
                                    "text": "Something growing and in or adjacent to the field you want to end up in (for example: Construction, Saas, pharma etc.). If you can’t get hired, build sales skills selling big ticket low barrier to entry products like cars or rvs to build skills while getting paid."
                                }
                            ]
                        },
                        {
                            "author": "Individual-Target-20",
                            "text": "This is great advice. My mentor taught me to get as close to the cash register as you can. You must be able to get business to own a company!"
                        }
                    ]
                },
                {
                    "author": "AntWithAPlan",
                    "text": "30k annually is too low. also means you have low level understanding of the world so your \"rock solid business\" might not be that true; i dont mean that as an insult, but it's simply the truth that people higherup in the ladder (people who get paid more) also know more about the reality, behind the scenes, including market and unseen troubles of a field. make at least 70k at a job that gets you stability and knowledgeable about the field & competitors.\n\n  \nif you want to ignore all the above... with really low but possible chance you strike diamonds... putting your life on the line... sure you can go and make connections. for example, make friends with someone really rich about your age (including romantically if you are deep in this). get them interested and convinced. sell them the idea of the future in exchange for their family's involvement. 50\\~100k is really not that much from a rich family who wants their kid to build something up, and they are unlikely to steal the idea from their kid's friend. also maybe that rich family with good understanding of the world can help screen your idea.\n\n\n\ndon't get overconfident without testing the waters. be confident only when you know what is what. good luck"
                },
                {
                    "author": "Dannyperks",
                    "text": "Why you working part time?"
                },
                {
                    "author": "Good-Work2301",
                    "text": "Do the actual cap raise process and start with an angel investor. DM me and I will walk you through it."
                },
                {
                    "author": "johnxaviee",
                    "text": "I love your drive and determination to make your dream a reality!  \nConsider looking into options like small business grants, crowdfunding, or exploring angel investors who might see potential in your business idea. Also, don't overlook the power of bootstrapping or seeking out low-interest business loans for entrepreneurs in your position"
                },
                {
                    "author": "LibertyTrident",
                    "text": "I would need to know more about your business plan. But most likely you don’t need 100k to start the business. Learn sales and marketing, do it yourself, start small."
                },
                {
                    "author": "rohankale1985",
                    "text": "work work and work!"
                },
                {
                    "author": "killbillsexwife",
                    "text": "If this was easy everyone would be doing it."
                },
                {
                    "author": "vitaminbeyourself",
                    "text": "Work, relegate, market, network, add value\n\nOr onlyfans"
                },
                {
                    "author": "june_rudra",
                    "text": "1. select a skill\n\n2. build projects\n\n3. start building a portfolio\n\n4. work for free (ik it's controversial, but why should someone trust you without any proof, make sure to get their feedback and use it testimonials)\n\n5. keep working and start marketing (don't try to be perfect)\n\n6. keep repeating, see what works, take constant feedback, network with people- ask for advice, feedback\n\nit's a long game. all the best! hope this helps"
                },
                {
                    "author": "TeamNeuphonic",
                    "text": "Have you thought about going down the VC route? You’ll have to let go of some Equity but if you get a good VC to support you they’ll not only bring you money, but introduce you to existing founders who went through a similar journey or built similar products. \n\nThey’re mostly there to solve the $$$ problem."
                },
                {
                    "author": "theonlyvasudev",
                    "text": "Simply a side hustle or a job is a must"
                },
                {
                    "author": "onlyhav",
                    "text": "Make more money to spend that money trying to make more money. You could also drop your living expenses to the floor."
                },
                {
                    "author": "reallytanner",
                    "text": "Crowdfunding. Your initial investment is then into making a promo video, and I mean a damn good production level promo video. Maybe a couple grand but not 10 or 100k."
                },
                {
                    "author": "robotlasagna",
                    "text": "What is the proposed payback schedule on the $100,000. How many points are you offering?"
                },
                {
                    "author": "RainMakerJMR",
                    "text": "You start it with considerably less.  Ask yourself what is the money for?  If it’s for people or equipment, you can work around the need and build it over time.\n\nMost times for startup owners that means being the person that does the labor.  If you have to pay someone at all, learn to do the thing you’re paying them for.  Paying people for work is something you do when there isn’t enough time in the day to physically add any more to your workload and you need to offload some low value tasks to make room for high value tasks.\n\nIf the money is for equipment, start with smaller equipment and work your way up.  Make incremental investments and fund them with the profits from your smaller setup and also with cashflow from regular employment if you need to right off the bat.  Lots and lots of startup owners are really great bartenders on weekend nights and use that extra cash to fund their business.  \n\nSource: I started a healthy food delivery company with $5000, and it took about two years before we had all the things I thought we needed to get started.  After 6 years we were doing $1.2 a year and I sold the company."
                },
                {
                    "author": "John_Gouldson",
                    "text": "I recently wrote a business plan, rewrote it actually, for an investor about to put over $280,000 into a project he'd been approached with. Long story, which I'd share if interested, but we got the actual investment needed down to $31,000. I see many plans nowadays priced so unrealistically high, with big rounded off figures, and often a variation in amounts estimated bigger than what would be the actual amount needed. \n\nWe started Real\\_Business to answer things directly and realistically, and to put out information on what we're doing. Feel free to ask detailed questions in a post there if you like."
                },
                {
                    "author": "Own_Maintenance8386",
                    "text": "Just don’t. \n\nYou probably fail many times before something you do will be successful. And you will burn a lot of money. It’s better be your money and after you learn to be ok to burn them - that’s the time you can start to think about funding. Otherwise you are playing with fire."
                },
                {
                    "author": "_Schrodingers_Gat_",
                    "text": "Entrepreneurship via acquisition. \n\nFind a company for sale, build the plan, pitch it to some investors and likely some bankers.\n\nBuy, manage and grow a company."
                },
                {
                    "author": "ttv_vegan_chef",
                    "text": "Find a way to run the business without the 100k. Can’t do it? Run a side hustle until you get that 100k"
                },
                {
                    "author": "bumpgrind",
                    "text": "\\- Develop a comprehensive business plan.\n\n\\- Sell the hell out of it - at investment networks, on fundraising websites dedicated to entrepreneurs seeking investment, etc.\n\n\\- Be prepared to give up a significant % (e.g. 51%+) of your business and ongoing returns in exchange for the investment risk. Any investor is going to require an ROI for their risk, and that ROI is going to be very high considering your risk is 0 since you are seeking all of the money required to get started.\n\n...or follow the other guidance here, you'll be way more successful. Save, build an MVP, prove the concept, generate revenue, put your own money where your mouth is and seek an investor where the risk is shared, once you've proven the concept."
                },
                {
                    "author": "AiDigitalPlayland",
                    "text": "Welcome to America. That will be $103,358 please."
                },
                {
                    "author": "_afresh15",
                    "text": "I'd recommend using a high-limit 0% interest business credit card. You can get upwards of $50k on one card. Since it is a business card the utilization won't report to your personal credit. Plus the terms are often for 12-18 months and if your deal is not done by then you can get another card and transfer the balance for another term. You will need a 700+ credit score and a solid credit profile to qualify though. The term is called \"credit card stacking\" or \"no doc loans.\""
                },
                {
                    "author": "First-Meet-5260",
                    "text": "Is there really no way to create a micro-version of the business that would require less funding? There should be some way you can start the business, even if you are just doing a tiny piece of the full plan, that would require less up-front investment, that you can grow into the full plan that involves $100k funding. If you would like to talk about it more with me or 160 other business owners, we have a discord server with no spamming, selling, or promoting that is meant for conversation on business and entrepreneurship. I bet there's in there that would be happy to help. Here's the link if you're interested: [https://discord.gg/VhrR9YRp](https://discord.gg/VhrR9YRp)"
                },
                {
                    "author": "AbusedShaman",
                    "text": "Can you find a way to start smaller and lower the captial you need to start it? Right now you are asking how to get $100,000. You don't; that's not going to be possible for you. You will have to work to earn that. The most difficult money to make is the first $100,000. Work, invest, and live below your means. As time goes by, you will grow your worth, but by that time your business plan may no longer be relevant. However, as you gain experience, you will come up with other great ideas. Ideas and business plans are the easy part. The difficult part is the execution to make your dream a reality.  \n\nEntrepreneurship is hard and it takes time."
                },
                {
                    "author": "TornadoEF5",
                    "text": "VC venture capitol ,   organise an event to pitch your ideas to possible backers in your area ( ps if you go on to be rich remember me ! )"
                },
                {
                    "author": "DiscoExit",
                    "text": "I mean, there's no hidden trick. Your options are either:\n\n* borrow wherever you can - bank, gov, family, loan shark (jk!)\n* get vc or Kickstarter funding\n* save for it\n\nThere's a billion examples of people in your shoes."
                },
                {
                    "author": "sammiexr",
                    "text": "Hey there \n\nI'm seeking a $300 investment for a companionship service providing personalized connections for individuals combating loneliness. In exchange, you'll receive a 5% equity stake in the business, entitling you to a percentage of the revenue for as long as it operates. Funds will be allocated to ads and ad revenue growth, capitalizing on a unique and growing market. By investing, you'll contribute to a socially impactful business making a positive difference in people's lives. If you're interested, let's schedule a call to discuss further.\n\nBest regards,\nSamuel",
                    "replies": [
                        {
                            "author": "jrc1515",
                            "text": "As far as I am aware, your business model is only legal in the state of Nevada.",
                            "replies": [
                                {
                                    "author": "sammiexr",
                                    "text": "Why do you think so it's not a hookup site"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Setup under 5k for running AI models efficiently?",
            "author": "camchillas",
            "text": "I’ve tested different LLMs like Llama 2 (7B & 13B), Mistral 7B, and Falcon 40B and now it’s time to set up a private hardware solution to keep the data local (for more info, i build AI agents specialized for healthtech)\n\ndon’t really trust cloud options as I value privacy more than anything. Some of these models require at least 24GB GPU VRAM per instance, especially when running larger versions like Llama 13B or Falcon. Ideally I’d also like to finetune these models locally for specialized tasks.\n\nI want to start with the minimum cost possible and have a dev with me, so a setup that doesn’t require too many backend requirements would be ideal. Looking for suggestions on the best GPU workstation to start with. Hope to get ideas from you guys. Thanks so much!",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "HonestCucumber8184",
                    "text": "have 2 opts in mind: \n\n\\- Tinygrad with 6 7900 XTX - $15k\n\n\\- AnonAI pro with 2 RTX4090 -  $9K\n\nYou should consider your scaling plans too",
                    "replies": [
                        {
                            "author": "Efficient_Sound_2220",
                            "text": "Anonai is slighly better"
                        }
                    ]
                },
                {
                    "author": "Whidog",
                    "text": "I was in a similar situation not too long ago. I wanted to run Llama 2. I built a setup around RTX 4090, Ryzen 9 7950X and 64GB RAM. It handles inference well and for fine-tuning, I’ve been using LoRA to make things more efficient. Ubuntu 22.04 with Docker has been my go-to for keeping things simple on the software side. If you're looking for something more expandable, maybe consider grabbing a used 3090 for savings and investing in better cooling",
                    "replies": [
                        {
                            "author": "camchillas",
                            "text": "sounds like a solid build. How’s the setup process been? I’ve been thinking of going the DIY route too, but I’m worried about spending too much time getting everything to run smoothly",
                            "replies": [
                                {
                                    "author": "Whidog",
                                    "text": "setting everything up took more time than I expected, especially getting all the dependencies and configurations right for different models. If you're looking for something more ready to use without the backend headaches,  try local solution like AnonAI core with 1 4090"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bananalord666",
                    "text": "Same struggle, privacy is key for me too. Looking at the RTX 4090 since it’s the most affordable option for 24GB VRAM but cant figuring out the rest of the specs"
                },
                {
                    "author": "Ralphisinthehouse",
                    "text": "I think you're fine with cloud personally. It works for the most governments!"
                },
                {
                    "author": "dreadul",
                    "text": "I haven't reached this stage yet, but I am looking to set up something similar down the road for analyzing calls. Will keep an eye on this thread."
                }
            ]
        },
        {
            "title": "Just a reminder: STOP DOUBTING YOURSELF",
            "author": "Alexle0",
            "text": "I have nowhere else to complain about this so I will just share with you guys.\n\nLast year I became interested in dropshipping. I found a butterfly bouquet set from China to resell. I made a website, I bought the product, filmed ads, etc..  I did all the work, but I started to doubt myself. I kept seeing posts online of people saying that dropshipping was dead, and let a bunch of different creators online get into my head about the fact that my product wouldn’t sell. I was also very anxious because I’m not the type of person to share my face online, so I was worried people would make fun of me.\n\nFast forward to this year, sales for this product are exploding online. I saw a single TikTok shop that made 60 grand in revenue. And there are many others selling the same thing.\n\nHonestly, a huge reason that I gave up was just insecurity and self-doubt. I come from a non-business background. I let my self doubt kill my ideas because I convinced myself they weren’t good enough.\n\nThis year, I’ll be starting an online business again, and I will NOT give up this time. Take this as your sign to do the same.\n\nAlso just FYI, if anybody is interested in connecting, feel free to DM me. I’m looking to break into online business, and would like to know more people in the space. \n\nGood luck ",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "ImpossibleBell4759",
                    "text": "Thanks for the powerful positive message. CHEERS!"
                },
                {
                    "author": "labellavita1985",
                    "text": "Thank you so much for this post."
                }
            ]
        },
        {
            "title": "Tips to Expand B2B Handmade Carpet Business Worldwide",
            "author": "Icy-Comfortable9201",
            "text": "Hi everyone,\n\nI hope you're all doing well! 😊 \n\nI wanted to reach out to this amazing community for some advice and insights. I'm a manufacturer of handmade carpets and rugs based in India, and my business operates on a B2B model. We produce high-quality carpets and rugs based on orders from our clients, who are primarily wholesalers, retailers, and resellers.\n\nLately, I've been trying to grow my business by being active on social media and emailing potential clients about our products. Unfortunately, I haven't seen the results I was hoping for. This is why I'm turning to you, fellow entrepreneurs, to seek your advice on how to better connect with wholesalers, retailers, and resellers in our industry.\n\nIn addition to finding new clients, I'm also looking to build a strong supply chain all over the world. If anyone here has experience or tips on successfully building relationships with B2B clients, strategies for effectively reaching out to potential clients, or insights on establishing a robust global supply chain, I would greatly appreciate your input.\n\nAlso, if you're interested in our products, feel free to send me a message",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "[deleted]",
                    "text": "[deleted]",
                    "replies": [
                        {
                            "author": "Icy-Comfortable9201",
                            "text": "Thank you for the advice, I've been active on LinkedIn for 6 months and connected with a few interested parties. As for trade fairs, I plan to participate once my business grows a bit more. Your suggestion about partnering with logistics companies for global shipping is helpful, and I'll definitely look into it."
                        }
                    ]
                },
                {
                    "author": "No_Second7603",
                    "text": "Hi, I'm a wholesaler and I can add handmade rugs to my product list. Please DM me your number so we can discuss further.",
                    "replies": [
                        {
                            "author": "Icy-Comfortable9201",
                            "text": "That sounds awesome, I’ll DM you my number so we can discuss further. Looking forward to working together."
                        }
                    ]
                },
                {
                    "author": "More-than-Master",
                    "text": "It would be worth looking at how local people in Carpet-known countries sell their carpets. It seems like several Carpet store owners in Turkey (or Pakistan etc) have some connections here in the states and they get away with taxes and stuff!",
                    "replies": [
                        {
                            "author": "Icy-Comfortable9201",
                            "text": "You're right—Pakistan and Turkey are known for their rich traditions of handmade carpets and rugs. Learning from how businesses in these countries establish strong supply chains and connections could be very beneficial for me. I'll explore their strategies further."
                        }
                    ]
                },
                {
                    "author": "First-Meet-5260",
                    "text": "Hey! You can get tons of advice from entrepreneurs from all over the world in tons of different industries in this discord server that has 170 members, all from this subreddit, with the sole purpose of talking about business and entrepreneurship. Spamming and selling is banned, so you don't have to worry about that either. You can even just copy and paste this post as a message in general and I bet a few people would be happy to give their input! Here is the link if you're interested: [https://discord.gg/VhrR9YRp](https://discord.gg/VhrR9YRp)"
                }
            ]
        },
        {
            "title": "Frustrated with people who ghost after initial agreements",
            "author": "ibrahim_132",
            "text": "I really need to get this off my chest. I’m part of a dev studio, and we often get approached by people with genuinely exciting ideas who are eager to collaborate. We discuss prices, outline plans, and everything feels set to start a great partnership. However, after that initial enthusiasm, many clients suddenly disappear no messages, no calls, nothing. It’s not about the price, as they seem to agree with our quotes.\n\nRecently, a tire detailing store owner reached out to us needing a POS system (if I remember correctly). We thoroughly discussed his requirements and provided a detailed quote. He was very serious and ready to move forward, but then he started ghosting us. Despite multiple follow-ups, we never received a response.\n\nAll I’m asking for is a bit of respect and basic communication. If your circumstances change or you decide not to proceed, at least let others know. It helps them save time and focus our efforts elsewhere. I understand that not every lead will convert, but a straightforward update would be greatly appreciated.\n\nHow do you handle people who ghost you after showing initial interest?\n\n",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "PrestigiousLeopard47",
                    "text": "Not uncommon. So on my sales/discovery call, literally the last thing I say is \"I have one final ask- I'm going to put a bunch of time into this proposal to make sure it's the best for your business, but in return I want you to agree to not ghost me and give me the respect of telling me Yes or No either way. Does that sound fair to you?\"   People usually kinda laugh, then realize I'm serious, and then agree and don't ghost me. Still plenty of Nos, but at least I know.",
                    "replies": [
                        {
                            "author": "yourbizbroker",
                            "text": "A litigation attorney shared a game with me he uses in cross-examination. I apply it to proposals. \n\nIf they say yes, it’s 2 points. If they say no it’s 1 point. If they say something else (or nothing at all) it’s 0 points.",
                            "replies": [
                                {
                                    "author": "PrestigiousLeopard47",
                                    "text": "Love it \\^"
                                }
                            ]
                        },
                        {
                            "author": "ibrahim_132",
                            "text": "That seems like one way to go around ghosting at least no more ghosting. That still counts as a win even though no deal closed",
                            "replies": [
                                {
                                    "author": "Ralphisinthehouse",
                                    "text": "All that happens here is a) you look desperate and b) the person agrees not to ghost you and then ghosts you."
                                },
                                {
                                    "author": "PrestigiousLeopard47",
                                    "text": "Ya, for my companies I usually am doing 10-20 calls a week for high dollar clients. My personal goal is to sort the Nos from the Yes (even before they get on the call, again trying to not waste call time). So if they gawk at my statement then that's perfectly fine by me, as it likely wouldn't be a good fit and a waste of time. Doesn't work for everyone, but I'm very happy with the process as I run my companies super lean (no extra staff that can waste time).  Even if I close a deal and they aren't a good fit, that's a situation I don't want to be in. I'd rather just not work with them, and know long before that we aren't a good fit."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "New-Asparagus-4522",
                    "text": "Honestly it’s part of the game. It’s super annoying but will happen all the time. Best thing to do is ignore it and keep pushing."
                },
                {
                    "author": "Aggravating_Owl_5591",
                    "text": "Yeah seriously like if you gotta say no then say no nobody is forcing you but people choose to ghost rather than saying no. Pathetic."
                },
                {
                    "author": "iUeMagazineOfficial",
                    "text": "This is happening a lot of late where people come in with all the excitement informed the mutual agreement agreements and then aren’t delivering on those commitments, two hours it largely seems like an air around in the world where in the dopamine release of merely forming the agreement has already given them the cake and they are now no more ready to deliver on the actual commitment to see the deadline and then finish the zeal of having completed something\n\nit’s more like the content consuming generation that is thrilled only at the consumption and doesn’t really want to act on what they’ve just consumed",
                    "replies": [
                        {
                            "author": "JealousZealousJesuit",
                            "text": "I don't? Fuck my data lol I don't really use the internet for myself anyway so any data they do pull from me is super corrupted"
                        }
                    ]
                },
                {
                    "author": "Ralphisinthehouse",
                    "text": "Birds fly, fish swim and deals fall through.\n\nIt's just part and parcel of owning a service business. Don't count on more than 10% of your enquiries leading to real business."
                },
                {
                    "author": "Crafty-Ad2992",
                    "text": "This is unfortunate. Ghosting is unprofessional! Here's to hoping that you land clients :)"
                },
                {
                    "author": "Conscious_Weight_642",
                    "text": "Don’t get discouraged, get better at the process. Is it taking too long to get your proposal out? Are you shocking your customer with too much info in your initial conversation (as bad or worse than not enough info)? Do these customers fit into your business model? All these questions can really help you narrow down the pitfalls in your sales process."
                },
                {
                    "author": "AllUrUpsAreBelong2Us",
                    "text": "Risk is part of being an entrepreneur, lol.\n\n\"if I remember correctly\" - if your recollection isn't 100% then you might be missing the clues of why people ghost you."
                },
                {
                    "author": "JacksonSellsExcellen",
                    "text": "This is the sales process.  This is why sales people are paid so highly, because they deal with this 24/7.  It's their job to deal with this and filter through this.  \n\nHow do you handle it?   Move onto the next."
                }
            ]
        },
        {
            "title": "The common trait of successful entrepreneurs (working intentionally)",
            "author": "moretimeoffline",
            "text": "Something that I've learned thats really helped me as an entrepreneur (that I don't hear much), is to be **intentional.**\n\nWhile working hard is important, what you’re actually working on is much more important.\n\nA scary but beautiful reality of entrepreneurship, is that you can work on *anything.*\n\nThere's nobody telling you what you should be doing, and because of this, it is very important that you're intentional about what you're working on. Because there are many entrepreneurs working hard on things or projects that aren’t putting them on trajectory to reach their goals.\n\nFor example, someone may dream of being a millionaire, but they live a lifestyle that won't take them there, regardless of how hard they’re working. \n\nThey may be working very hard, but it may be on the wrong things.\n\nI think this likely happens because we’re so distracted, with TV, social media, video games, etc. \n\nWe fill the entirety of our free time with distractions, and never take the time to think about where we want to go in our lives, and whether or not our current routine takes us there.\n\nMost entrepreneurs, once they’ve been established and can get by financially, tend to begin thinking **inward**.\n\nWhat I mean by thinking inward, is thinking only in terms of their actual position.\n\nEssentially they become indulged in what their business is, and don’t think about what their business could be, and they get stuck.\n\nI heard once, that it’s lazier to work a 9-5 until retirement, than it is to spend just 3 years starting a successful business. And this is true! Because this requires you to be **intentional** in an unintentional and distracted world. This is not easy to do, but it is responsible for bringing me to where i’ve gotten in my years of entrepreneurship.\n\nHard work will never substitute a bad plan, the same way good marketing can never substitute a product nobody wants.\n\nMy lesson is to look at what you’re doing and where you’re headed, ask yourself where you would be if you repeated your daily routine for 365 days, or even 10 years. will this take your business where you want to be? These are great questions to frequently ask yourself and reassess\n\nThis is something i’ve learned that helps keep me on track, and it has kept me doing things that bring me closer to where i want to be in my life. I hope my lesson has taught you something too.\n\nI would love to read the comments and hear what everyone else thinks about this too!\n\n**P.s.** I learned this from moretimeoffline+com, they have much more similar advice for entrepreneurs like this for free (called Neuroproductivity). If you enjoyed this, then you’ll love the stuff there.\n\nHope this helps! cheers :)",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "OneEntire482",
                    "text": "Love this part. Thanks for sharing.\n\n“ My lesson is to look at what you’re doing and where you’re headed, ask yourself where you would be if you repeated your daily routine for 365 days, or even 10 years. will this take your business where you want to be?”"
                },
                {
                    "author": "RichardtheDesigner",
                    "text": "Well-written post with a great reminder! I have nothing to add. Thanks for sharing!"
                }
            ]
        },
        {
            "title": "If you're a non-tech guy looking for a tech partner...",
            "author": "zoozla",
            "text": "(Got a question on another post and thought this could be valuable for some of you)\n\nIf you have an idea for an app or a website, but you're not technical enough to build it, you're in a bit of a bind. Tech folks get approached all the time by founders with an idea who'd love to split equity in return for work.\n\nThe problem is that the idea is 2% of the business. The other 98% are building and selling (or marketing for B2C), split roughly evenly.\n\nSo what a potential tech guy is looking for isn't someone with a good idea, but someone who can sell. Because tech people hate selling and typically avoid it like the plague, but recognize its necessary for a business to work out.\n\nSo that's the deal - you want tech people to chase you to join your startup? You need to show them you can sell. If you have clients lined up with wallets open and ready to pay (or even better - have already paid something up front), you'll have no problem finding a tech partner.\n\nBut if you can neither sell nor code, you've got a bit of a learning curve to go through. And I recommend learning how to sell - it's way easier than coding (I've been a dev for 25 years and have been selling for 5).",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "HuckleberryNo6269",
                    "text": "agreed. we hate selling.\n\npassion for tech + money is the ultimate reason to join a startup",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "Exactly. I actually discovered I enjoyed selling quite a bit when I'm selling the right thing and after I actually developed the skills for it. It's radically different than engineering, the opposite in many ways. But it can be quite fun."
                        }
                    ]
                },
                {
                    "author": "GoldenTree9999",
                    "text": "Totally agree. Marketing and sales is way important than the idea guy. A lot people think idea is the key, actually implementation, operation and sales are. Idea alone without implementation and sales has zero value.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "Oh crap. I completely discounted operations in my post above. It's obviously a super important part and it becomes even more important as the business matures. The post is a bit myopic in that way and is only relevant for the early stages.\n\nAlso... I think it might be possible for ideas to become more valuable as AI take over more of the tech bits, but that's just a guess. An AI that can code anything can probably come up with decent ideas too."
                        }
                    ]
                },
                {
                    "author": "Fun_Night_196",
                    "text": "When the founder has the cash and the right idea  💡 ✍️",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "Absolutely. Not even cash in hand - the skills to bring in cash can be enough."
                        }
                    ]
                },
                {
                    "author": "patrona4life",
                    "text": "How did you learn how to sell?",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "A lot of trial and error and eventually a book I read. It's called The Secret of Selling Anything and it has the most cringe cover photo in history of cringe cover photos. But it's exceptionally good.",
                            "replies": [
                                {
                                    "author": "patrona4life",
                                    "text": "Do you mind sharing what has worked for you?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "eddurham",
                    "text": "I can sell with moderate tech skill. This motivates me for my 2nd venture.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "That's an excellent combination. I'm pretty sure AI can compensate your limited tech skills at least to get you to a point where it's easier to sell.\n\nSo your 1st one was successful? A life changing amount of money sort of success?",
                            "replies": [
                                {
                                    "author": "eddurham",
                                    "text": "Life changing and growing. Yet still humble beginnings. It’s only two years into the venture, and I don’t see an end in sight. I do accredit AI for not only my success, but our teams as well. \n\nI have a good idea for another venture that isn’t much workload once established. Most of the workload would be on the initial setup, and not much maintenance."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FireHamilton",
                    "text": "Speaking of which, if anyone does want to partner up I’m an engineer at a FAANG, lmk.",
                    "replies": [
                        {
                            "author": "zoozla",
                            "text": "Hope you hear from people here!\n\nAre you looking for a way out? Or being nudged out in favor of AI?",
                            "replies": [
                                {
                                    "author": "FireHamilton",
                                    "text": "One day I want to move towards running my own business. As far as LLM’s, nobody in my field is concerned about it whatsoever. It’s not even remotely capable of replacing what we do. In fact my team just hired a lot more the last few months. Coding is just a means to an end, the real engineering is done in the design meetings and planning. \n\nBut yeah, I don’t really like being a cog in the machine. One day it would be great and fun I think to have something to own."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "I have a Saas idea for the construction industry but no idea how to code….",
            "author": "hahawerrewer",
            "text": "You read that right, I have an idea, I think it’s the best idea anyone’s had in the history of ideas. But, I have no idea how to make it real. \n\nJokes aside, can someone offer me some advice on the best way to go about building this business. \n\nWhat I have \n- Knowledge of my industry and specifically where a Saas product would create a lot of efficiency.\n- Relationships with executives, directors and decision makers of said industry.\n- General to above average understanding of how software and web apps are created. \n- No time or lead to properly code or create the product. \n\nThe idea \n- Pretty basic software I reckon. Mostly just a project management tool. \n- Local industry specific. \n\nWhat do you think? Please feel free to ask questions. ",
            "subreddit": "Entrepreneur",
            "comments": [
                {
                    "author": "ali-hussain",
                    "text": "I advise tech services companies and off-hand I can tell you that you'll be able to find a great agency that can get your app built for 20k. That's not the problem. The problem you have is that the asset you have is: \"Relationships with executives, directors and decision makers of said industry.\" and you need to convert this asset into sales. Product development happens with the customer. You need the customer first. So you need to think about what is the minimum thing you can sell to said executives, directors, and decision makers today, or well at best literally next month. \n\nMaybe the burden of switching to your platform is too high and you need to create a plugin for their existing platform. Maybe your app vs is a Trello plugin. Maybe you need to sell it as IP-backed consulting. I don't know. But unless you know what you're selling don't bother writing a line of code."
                },
                {
                    "author": "mohit-Dubey2",
                    "text": "I think you should learn the No code tools it will merely take any time and you can do it on your own. Either go for No Code tools like Bubble or AI agents like Cursor, Bolt or Lovable. They are insanely awesome.",
                    "replies": [
                        {
                            "author": "Traditional_Crazy200",
                            "text": "They are incredibly overhyped and will fail when the smallest level of complexity arises."
                        }
                    ]
                },
                {
                    "author": "phibetared",
                    "text": "Have you done \"back of the envelope\" financial projections?  Figured out how much money you can reasonably expect to make - and compared that with the cost ($5K? $20K? $100K?) or developing your service?   Let's say you can get everything working for $50K.  Is the income going to surpass that? \n\nIf you are CERTAIN  - then:\n\n\\- Draw pictures of the APP, make a presentation, and go show it to a couple of potential customers.  Tell them you are NOT trying to sell this to them. Just wanting their input on your idea - and then ask them what it might be worth to them (monthly, yearly, whatever).  \n\n\\- Adjust your economic projections based on their answers.  Maybe you over/underestimated the value of your idea.   (And you said it is a \"local\" idea... which I assume limits it's value.  If you can re-purpose to other \"local\" areas, obviously that greatly increase the value of your service. \n\n\\- If it's still worthwhile based on above, then write up a \"technical\" document that explains exactly what the service is (page 1)... and how the software/service would work.  I.e, show every screen your users would see, and explain to the computer programer(s) exactly what each screen and each button would do.  Draw pictures and notate them with arrows to each button, etc. \n\nYour software development costs increase with complexity.  E.g.,  if you have different levels of users (Admin, super user, basic user) that is more complex than a \"stand along\" system with only one type of user.  \n\n\\- Take your tech doc and find some developers to talk to.  Their pricing will be all over the place.  Make sure they have working examples of their work that demonstrate they know how to do what you need.  (E.g. Do you need 3 types of users? Have they done something with different types of users?)   If you go to them and say \"I need this (pointing to tech doc) can you do this?)\"  - you can figure out which can or can't do the project - then ask them to give you a price and a timeline.    (To be fancy you could turn your tech doc into a \"request for proposal\" (RFP) and send that to your candidates)"
                },
                {
                    "author": "Rivercitybruin",
                    "text": "What aspect of construction industry?.. Actual construction? Or something that supports it (logistics, inventory management)"
                },
                {
                    "author": "Responsible_Cod_3240",
                    "text": "Design everything about the software. Use pen and paper or get fancy and use figma. Try tools like Bubble to do an MVP. Find coders on fiverr or upwork."
                },
                {
                    "author": "kodeepaulconsultant",
                    "text": "Consult me - [https://www.linkedin.com/in/kodeeswaranp/](https://www.linkedin.com/in/kodeeswaranp/)"
                },
                {
                    "author": "RaulBrindusan",
                    "text": "Sent you a dm"
                },
                {
                    "author": "Perllitte",
                    "text": "I worked with a great dev to build out the MVP for my product. They use an app-building platform spiced up with custom code where necessary. It's working great and my beta program is prompting some minor changes that are easy to tweak. It's been exceptionally affordable, I won't share the price because that highly depends on complexity, but I got a quote for $120,000 for the same functionality which is insane (for my stage). \n\nConnect with them here: https://kealy.studio/\n\nBut I'd do everything you can with the tools you already use. The more you can get into an excel document or Airtable, graph paper etc will speed things up. That process helped me find some significant gaps in my idea before they were developed."
                },
                {
                    "author": "SenorTeddy",
                    "text": "Software can appear simple but end up being massive hidden features. Feel free to ask me any coding questions. What's special about your software that others can't do? Which ones have you looked into?"
                },
                {
                    "author": "revonssvp",
                    "text": "Man, there are a LOT of startups in this domain. I know startups, software for middle companies, and big companies have their own systems.\n\nYou have to search if you have a true differentiation, know who is your target niche, test with prospects..."
                },
                {
                    "author": "AbusedShaman",
                    "text": "You don't need to know how to code. Can you afford a development team? I have a team that does my development that I found on Upwork. You need some upfront capital though. Having a great idea is good, but you need to execute. Execution is the hard part."
                },
                {
                    "author": "zaidkhan00690",
                    "text": "I and another coder friend of mine started a software agency. We develop saas and custom software with upto 2 modules for almost close to free. So if you want to give this idea a shot dm me."
                },
                {
                    "author": "TenatoAccount",
                    "text": "You need to figure out the business aspects first, not just dive into product coding. I suggest thinking in 3 stages:\n\n1. RESEARCH: Do some market research to confirm what features your buyers need, what pricing model would work, and what they might pay.  You could do this by taking a few people you trust out for lunches/coffee, and maybe even asking a few others you don't know as well. Also look online to see what competition you have, and what features/pricing they have.\n\n2. PLAN: Draft out a rough business/marketing plan - to make sure it'll make money, and that there's a good outline of how the product/service will work and generate revenue for you.  In this process, you can also decide how/who to fill the roles required of the business, if it's a go. \n\n3. EXECUTE: If AND ONLY IF the plan makes sense, and you're prepared to put in some effort, then you can proceed to 1) developing a brand for your product, and getting a web domain/site for it.  2) getting the money together (some of your old customers/connections might invest, or you can hit the banks, etc) and 2) contracting the programmers and building the product out.\n\n  \nMake sense?  If you're stuck, just ask."
                },
                {
                    "author": "SAnderson1986",
                    "text": "I work with a bubble agency, and we can build MVPs that scale. DM me a project brief and requirements and I can share a rough order of magnitude quote. "
                },
                {
                    "author": "Jc0175",
                    "text": "My two cents:  \n\\- [Bubble.io](http://Bubble.io) to build the MVP. Hire on Upwork - it's fairly simple to learn, but I doubt learning it would be the best use of your time right now.  \n\\- Talk to your connections, have them DEMO the product, ask for their honest feedback (what was confusing, what they liked, what they wish it did), ask how much time & money they saved/what they'd pay. Do *not* try to sell customers right now - feedback is infinitely more valuable at this stage than the few bucks you could get by selling customers on a half-baked product (that they'd probably leave after a few months anyway).  \n\\- Iterate product, onboarding, etc. w/ the feedback, launch a website, run some paid traffic to the website to test offer.  \n\\- Play around with different offers, audiences, etc. - see what connects.  \n\\- Onboard first few (paying) customers, use proof of concept to recruit a technical co-founder that can help you fully flesh out the product from MVP to scalable software.\n\nBest of luck, rooting for you."
                },
                {
                    "author": "Able-Development9269",
                    "text": "Let's connect! I've worked for a couple years in the construction industry and am a startup co-founder. I can help you get started! \n\nThe way forward would be to build an MVP (either a hi-fidelity figma mockup, or an actual MVP) and then show it to potential customers. Take feedback, iterate, and repeat. That's the only way to build out a SaaS. Given you relationships with decision makers, and industry-specific expertise, you can get a lot done on the none-technical side and the initial product design side."
                },
                {
                    "author": "ayyyoowatsup",
                    "text": "DMed you ;)"
                },
                {
                    "author": "Rivercitybruin",
                    "text": "You probably need to learn how,to code. A big VC in Canada,says hiring your first coders,can't be your first use of proceeds\n\n  \nYou do though bring alot to the table.. Not just a college gradcwith an idea"
                },
                {
                    "author": "Rivercitybruin",
                    "text": "Maybe hire a high school or college coder",
                    "replies": [
                        {
                            "author": "jerome0512",
                            "text": "You would not hire a high school or college student for legal advice or medicine.\n\nThe same goes for the IT world.",
                            "replies": [
                                {
                                    "author": "LRG_idk",
                                    "text": "It’s a startup. The goal is to make it cheap and fast. Zuckerberg was a college student and his code was notoriously bad. The comparison with legal advice or medicine does not make any sense."
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}