{
    "items": [
        {
            "title": "Perplexity Assistant: Assistant for Android with smarter AI for tasks and context!",
            "author": "ssalmanlodhi08",
            "text": "Introducing Perplexity Assistant for Android! It uses reasoning, search, & apps to handle daily tasks ranging from simple questions to multi-app actions—booking dinner, finding songs, calling rides, setting reminders, and more—all with voice or gestures. \n\nShow your support on PH here → [https://www.producthunt.com/posts/perplexity-assistant](https://www.producthunt.com/posts/perplexity-assistant) ",
            "subreddit": "GrowthHacking",
            "comments": []
        },
        {
            "title": "Shimmer 2.0: ADHD Coaching, now AI-enhanced",
            "author": "ssalmanlodhi08",
            "text": "Meet the #1 ADHD Coaching Platform’s v2.0. We’ve supercharged our original science-backed ADHD Coaching program with AI. \n\nGet more out of your coaching journey with session summaries, action reflection insights, smart searching through your history, and more. \n\nShow your support on PH here → [https://www.producthunt.com/posts/shimmer-2-0](https://www.producthunt.com/posts/shimmer-2-0)",
            "subreddit": "GrowthHacking",
            "comments": []
        },
        {
            "title": "Trae: Adaptive AI IDE that helps you ship faster",
            "author": "ssalmanlodhi08",
            "text": "Trae is an adaptive AI IDE that transforms how you work, collaborating with you to run faster. \n\nShow your support on PH here → [https://www.producthunt.com/posts/trae](https://www.producthunt.com/posts/trae) ",
            "subreddit": "GrowthHacking",
            "comments": []
        },
        {
            "title": "Telescope 2.0 now with Smart Criteria - search for leads using fully custom criteria and filter by anything you want.",
            "author": "ssalmanlodhi08",
            "text": "Telescope 2.0 now with Smart Criteria - search for leads using fully custom criteria and filter by anything you want. With Smart Criteria, Telescope becomes your very own lead research agent. Quickly find exactly who you’re looking for, no matter how niche.\n\nTelescope makes Apollo, Sales Navigator, etc. look primitive. Give it a try! \n\nUp until now you’ve had to adhere to standard filters and keywords to find the companies and leads you’re after. But with Smart Criteria you can filter by whatever you want!  \n\n\n\n❌Headcount: 50-100 \n\n✅Company must have at least 5 Product Managers and nobody working in QA  \n\n\n\n❌Industry: Software Development \n\n✅Company must be a SaaS company developing a mobile app  \n\n\n\n❌ Graduation year: <2015 \n\n✅ Lead should have graduated with a degree in a finance-related field from a top-level university 10+ years ago \n\n\n\nShow your support on PH here → [https://www.producthunt.com/posts/telescope-2-0-2](https://www.producthunt.com/posts/telescope-2-0-2)",
            "subreddit": "GrowthHacking",
            "comments": []
        }
    ]
}