{
    "items": [
        {
            "title": "2 Months, 387 Users, and it paid for my rent",
            "author": "hennobit",
            "text": "The growth continues to blow my mind! Since my last update, the number of users has more than doubled to 387 active users who are now tracking 416 different subreddits. And the revenue from pro subscriptions even covered my next rent!\n\nWhat started as a simple tool for myself to find what to post and what the best posting times on Reddit are has turned into something way bigger.\n\nThe response on X has been crazy good and the tool is getting serious traction there, with users spreading the word way beyond what I ever expected!\n\nGrowth has been so wild that I actually had to upgrade my server to handle the load (which is a pretty awesome problem to have lol).\n\nSeeing people actually use and love something I built feels unreal.\n\nMassive thanks to all the early believers who took a chance on the tool and helped get the word out.\n\nYour feedback and bug reports have been key in shaping this.\n\nThanks for being part of this ride.",
            "subreddit": "indiehackers",
            "comments": [
                {
                    "author": "Worried-Intern8000",
                    "text": "Can you share the link?? Would love to try it out",
                    "replies": [
                        {
                            "author": "hennobit",
                            "text": "Sure it's DontPostYet.com"
                        }
                    ]
                },
                {
                    "author": "Coolzie1",
                    "text": "What is your process for X? Can you link a post as an example?\n\nI see a lot of people saying it works for them, but at first glance to me, I don't understand where to start.",
                    "replies": [
                        {
                            "author": "hennobit",
                            "text": "I built a community there. I don't have specific posts to show",
                            "replies": [
                                {
                                    "author": "Coolzie1",
                                    "text": "That makes sense, can you elaborate on how you got started? What worked and what didn't?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pandelissym",
                    "text": "What motivated you to start this tool given that there are already many free tools available? What do you think made yours stand out and therefore gain users?"
                }
            ]
        },
        {
            "title": "We just launched on TAAFT! 🥳",
            "author": "milkyral",
            "text": "Try it out and let us know what you think :)\n\nTLDR:\n\n* Fully automated SEO end to end (no need to prompt anything, just need your blog URL)\n* We do everything end to end: keyword research -> write content -> publish to your blog automatically -> optimize existing content constantly\n* You can book a demo with me or try it out for free and get 2 free articles!\n\nLMK what you think! 🙏\n\n[https://theresanaiforthat.com/ai/mega-seo/](https://theresanaiforthat.com/ai/mega-seo/)",
            "subreddit": "indiehackers",
            "comments": [
                {
                    "author": "mrtcarson",
                    "text": "Good Luck",
                    "replies": [
                        {
                            "author": "milkyral",
                            "text": "appreciate you 🙏"
                        }
                    ]
                },
                {
                    "author": "dariushabbasi",
                    "text": "I think theresanai.com is better than taaft",
                    "replies": [
                        {
                            "author": "milkyral",
                            "text": "noice, i'll take a look - thanks the tip!"
                        }
                    ]
                }
            ]
        }
    ]
}