{
    "items": [
        {
            "title": "This pisses me off",
            "author": "Rude_Welcome_3269",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "NonOptimized0",
                    "text": "This is what happens when people talk about things they don't understand",
                    "replies": [
                        {
                            "author": "haikusbot",
                            "text": "*This is what happens*\n\n*When people talk about things*\n\n*They don't understand*\n\n\\- NonOptimized0\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                            "replies": [
                                {
                                    "author": "Xombridal",
                                    "text": "Damn this goes unreasonably hard"
                                },
                                {
                                    "author": "crippledspahgett",
                                    "text": "This must be the \"Reflect on Idiocy\" haiku from Ghost of Tsushima where the reward is a dunce cap."
                                },
                                {
                                    "author": "planchart-code",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "SaltFollowing2466",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "sunspecified",
                                    "text": "good bot"
                                },
                                {
                                    "author": "Historical-Outside-1",
                                    "text": "Is this bot’s post AI generated or procedurally generated?"
                                },
                                {
                                    "author": "Uebelkraehe",
                                    "text": "The haiku for our time."
                                },
                                {
                                    "author": "SparkleFox3",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "Silverware09",
                                    "text": "This is brilliant. Because now it means that people who talk about things don't understand. And that's just what happens."
                                },
                                {
                                    "author": "Merjia",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "TOGUDV",
                                    "text": "good bot"
                                },
                                {
                                    "author": "Didicit",
                                    "text": "This, and only this, is an acceptable use of AI."
                                },
                                {
                                    "author": "morfyyy",
                                    "text": "Im gonna use this"
                                },
                                {
                                    "author": "SonOfSkyrim22",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "zapotron_5000",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "TSTXD777",
                                    "text": "good bot"
                                },
                                {
                                    "author": "Available-Cow-411",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "Wulphram",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "Klutzy_Scene_8427",
                                    "text": "Good bot"
                                },
                                {
                                    "author": "Ace-of-snakes",
                                    "text": "This is my new favorite Haiku"
                                },
                                {
                                    "author": "NonOptimized0",
                                    "text": "People rlly be making bots for anything nowdays huh"
                                }
                            ]
                        },
                        {
                            "author": "poilsoup2",
                            "text": "My job recently classified an address recommender as AI"
                        },
                        {
                            "author": "Standard_Abrocoma_70",
                            "text": "AI \"artists\" think Neural Networks are comparable to Human brains and their models blatantly ripping off artworks is comparable to inspiration",
                            "replies": [
                                {
                                    "author": "Nytohan",
                                    "text": "AI Artists are just the \"You made this?\" meme."
                                },
                                {
                                    "author": "ifandbut",
                                    "text": "Learning is just pattern recognition when you get down to it.\n\nNow we made a machine that can pattern match. That scientific and technical achievement is amazing."
                                }
                            ]
                        },
                        {
                            "author": "default_Mclovin",
                            "text": "As an Informatik I kinda have a Bad feeling about AI. I mean thats just my personal opinion. I still think it will come with great advances and Its nessesary for our Future. \nSorry for my Bad englisch XOXO"
                        },
                        {
                            "author": "DevilDoc3030",
                            "text": "Haiku bot came in clutch on this one."
                        },
                        {
                            "author": "SXAL",
                            "text": "The \"AI steals from the artists\" crowd are exactly that"
                        },
                        {
                            "author": "Arrestedsolid",
                            "text": "I tell you this as an artist that doesn't use AI.  Anti AI people have to be the people that LEAST understand both AI and art and they shoulnd't be able to have an opinion on neither."
                        },
                        {
                            "author": "Servus_of_Rasenna",
                            "text": "Just like most AI critics",
                            "replies": [
                                {
                                    "author": "Adghar",
                                    "text": "Looks like the subreddit in the original post pic would be a perfect echo chamber for you to hang out in"
                                },
                                {
                                    "author": "Timely-Instance-7361",
                                    "text": "Ever wonder why every single artist alive is against AI? Wonder why it's ONLY loser tech bros that support it?"
                                },
                                {
                                    "author": "Standard_Abrocoma_70",
                                    "text": "I'm a Software Development student, I am self-taught on LLM and Machine-Learning, I also enjoy making Art.\n\n  \nFuck AI Art."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Due_Bobcat9778",
                    "text": "Literally different things.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Ikr"
                        },
                        {
                            "author": "Bwob",
                            "text": "Meh.  Too many people seem to think that \"AI\" is just another word for LLMs or diffusion-based image generation algorithms or whatever.\n\nAI is a huge, broad term that has [existed since the 60s](https://en.wikipedia.org/wiki/History_of_artificial_intelligence).  It covers a lot of fields and techniques.  And while it includes things like ChatGPT, it also includes a ton of other stuff, including:\n\n* Playing chess or other games.  \n* Recognizing objects in an image.  \n* Procedural generating maps or images.  \n* Understanding and responding to natural language.  \n* Speech recognition.  \n* Email spam filters.  \n* Autonomous cars.  \n* Netflix recommendation algorithms.  \n* Language translation.  \n* Facial recognition.  \n* Story generation.  \n* many many more\n\nAnyway, both ChatGPT and No Man's Sky use AI.  This meme is technically correct.  (the best kind!)  The people who are mad at it are just mad because they've swallowed the techbro marketing speak and think \"AI\" only means LLMs or whatever.  Technically, [LLMs are just a subset of the field of Machine Learning, which itself is just a subset of AI.](https://en.wikipedia.org/wiki/File:AI_hierarchy.svg)",
                            "replies": [
                                {
                                    "author": "Particular-Place-635",
                                    "text": "This meme is not correct. Procedural generation is not remotely a subset of AI. Procedural generation is so incredibly broad you could make a really strong argument that AI actually falls under the procedural generation umbrella."
                                },
                                {
                                    "author": "the8thbit",
                                    "text": "Context is relevant here. This is posted in a subreddit called DefendingAIArt, which is primarily concerned with art generated using LLMs. The \"technical correctness\" *is* the problem here, they're obfuscating what they're actually talking about when they use the term \"AI\" by appealing to a broader, technical definition.\n\nTo understand what's actually being communicated we need to consider not just a technical definition of \"AI generated\", but also and primarily what the original OP thinks \"AI generated\" means, and what the intended audience thinks \"AI generated\" means, which, outside of the context of this specific smokescreen trick, is something very different.\n\nThe contemporary popular understanding of \"AI\" is more or less LLMs, and in particular, very large LLMs trained on unpermissioned datasets. That subreddit leans towards \"more\" given that the topic and the kind of content that gets posted there primes the reader to understand \"AI\" in this way. By using this smokescreen they are implicating tools and techniques that lack the properties which are being critiqued in the critiques they are trying to rebuff. For example, it would require some ingenuity to involve copy protected work in an implementation of A*."
                                },
                                {
                                    "author": "FR3Y4_S3L1N4",
                                    "text": "I got into an argument about exactly this with my brothers, like they completely forgot that how npc's behave in gakes has always been referred to as AI"
                                },
                                {
                                    "author": "NoteThisDown",
                                    "text": "I love all the people obviously dumber than you trying to argue with you about things that they dont understand. You are 100% correct, and its so painfully obvious that the people who are fighting against you just seem extremely delusional."
                                },
                                {
                                    "author": "2-AcetoxybenzoicH",
                                    "text": "The screenshot shows this is from a subreddit called \"DefendingAIArt\". This implies that the meme is equivocating generative AI art with simple roguelike procedural generation. You added some great context about AI, but I think most people angry/annoyed with the meme understand what the poster was implying."
                                },
                                {
                                    "author": "ThinkExtension2328",
                                    "text": "It’s also fascinating how many people thing >AI< is new , it’s been around since the 80’s \n\nYou know how your npc decides what actions to take on its own? \n\nWhat about got to react to the character depending on the characters moral scores? \n\nHave a guess 😝"
                                },
                                {
                                    "author": "Sir_Eggmitton",
                                    "text": "Idk, I think this meme specifically is referring to LLMS/ChatGPT and stuff as “AI”. “AI generated” typically specifically refers to that field of AI."
                                },
                                {
                                    "author": "Einskaldjir",
                                    "text": "There are a lot of really good replies below so please read them, but I wanted to respond that the meme may be technically correct, but the tweet absolutely isn't.\n\nThe criticism of AI art is that it steals existing art by using artwork without crediting the original artist. Procedural generation does nothing of the sort. Equating the two is absolutely nonsense, not because of the AI portion, but because the tweet ignores the reason people criticize AI art in the first place.\n\nMaybe everyone already knew that though..."
                                },
                                {
                                    "author": "FurViewingAccount",
                                    "text": "the sub is literally \"defendingaiart\". The use of AI in the meme almost certainly refers to machine learning specifically"
                                },
                                {
                                    "author": "Antisa1nt",
                                    "text": "While you are technically correct, do you think this argument holds water when acknowledge the context that the meme comes from r/defendingaiart ?"
                                },
                                {
                                    "author": "cripple2493",
                                    "text": "I think this is underestimating the power marketing has on language. You are technically, both are \"AI\" - however, the current use of the term AI isn't including stuff outside of LLM and image generators.\n\nIs the correct usage? No, it technically isn't, but culturally the term has become tied to LLMs/image generation in current English speaking webspaces. Imho ignoring that isn't very helpful."
                                },
                                {
                                    "author": "DrHypester",
                                    "text": "'AI Generated' refers to LLMs. We always look at context for words. Particularly on a sub like this, if a tech bro says 'AI' we know its not WFC, if a gameplay designer says 'AI' we know he's not talking about ChatGPT. AI Mobs, AI Books, we are all bright enough to use that context to understand the different usages, just like we would vanilla iced latte and Vanilla Ice. There is no need for additional specificity."
                                },
                                {
                                    "author": "earth418",
                                    "text": "The difference between what games do with procedural generation and AI is that technology used in AI, like neural networks, SVMs, etc, are *designed* to replicate biological processes and neurons and the things we use in our brains that give us intelligence. As opposed to procedural generation algorithms, which are mathematical, usually stem from techniques observed in nature that aren't biological, or are just made up entirely. \n\nProcedural generation is *not* AI because it is not meant to be *intelligent* -- it's quite rare that a procedural generation algorithm undergoes a \"learning\" process like ML or AI, whereas other similar tasks like image classification and game agents do go through some kind of \"learning\" or \"thinking\".\n\nYour comment is mostly correct, though I don't know if No Man's Sky uses ML in any way; Minecraft definitely does not."
                                },
                                {
                                    "author": "ZucchiniNo1892",
                                    "text": "I can't stand that the abbreviation ai is becoming synonymous with LLMs. It's giving the term such a negative connotation as well."
                                },
                                {
                                    "author": "sessamekesh",
                                    "text": "It's tricky. Any discussion of AI in gaming needs a bit of splitting hairs because we have decades of calling simple decision trees \"enemy AI\" on top of the pretty bad general industry confusion.\n\nANN tech is magnificent for signal processing and has been used for a while now with great success. I'm a huge believer in that application of the tech. Speech to text, cheating detection, face tracking, basically your whole list. Love it for all that. \n\nGenerative AI was a niche toy until it pretty abruptly wasn't, I remember handwriting generators being old tech back in 2010 when I was learning about neural net tech. And goodness me here be dragons when talking about ethics, ownership, training sets, bias...\n\nBut even just to get to the _starting_ place of meaningful discussion takes an annoying amount of nuance. Worth the effort to talk about IMO but wow it's a confusion factory."
                                },
                                {
                                    "author": "Polygnom",
                                    "text": "I wouldn't call proc gen AI. Its proc gen. It is still a hand-crafted system that generates based on fixed rules. Its an expert system, but calling it AI stratches the definition a bit, imho.\n\nI mean, company I now employs \"AI\" to categorize emails. They use hand-written regular expressions for that. Thats not AI, either, even tho it appears smart to the user.\n\nJust because something like prroc gen uses pseudo-randomness, thats not AI.\n\n\\> Procedural generation absolutely falls under the definition of \"a task that normally requires human intelligence\"\n\nThe point here is intelligence. If proc gen is AI, then so is EVERY computer program or expert system, because it required human intelligence to write. Thats not a very useful definition of AI.\n\n  \nProc gen \\*can\\* incorporate AI, but it usually doesn't."
                                },
                                {
                                    "author": "Odisher7",
                                    "text": "Aren't image generators kinda ai because neural network? I mean i guess it's a bit hard to define specifically xd"
                                },
                                {
                                    "author": "slinkycanookiecookie",
                                    "text": "No one thinks AI is just LLMs and it says everything that you're listing such general stuff. Yes, AI can play chess, but I can also write a program that plays chess without using those pathing or decision algorithms, and write a program without AI for most of what you listed, including procedural generation. So no, you can't say definitively that all those things fall under artificial intelligence. They're examples of things you could use it for, sure, but since the dawn of time, people have been labeling programs as \"AI\" when they barely qualify as such."
                                },
                                {
                                    "author": "TheChief275",
                                    "text": "Procedural generation is not purely random, that would be boring as fuck. Instead, it involves randomly connection *manmade* patterns to create entirely new content.\n\nFor instance, Minecraft’s mineshaft chunks themselves aren’t generated, but are randomly picked from a pool.\n\nSo the difference is you at least have to make something yourself (which is a pretty important part but I digress)"
                                }
                            ]
                        },
                        {
                            "author": "protector111",
                            "text": "I have tv thats 20 years old and It has “ai” options in the menu."
                        },
                        {
                            "author": "buyingshitformylab",
                            "text": "so are nails and screws, but the comparison is useful."
                        },
                        {
                            "author": "ThatOneCactu",
                            "text": "I agree. Procedural generation is from a list of stock assets combining randomly according to a set of rules. AI generation is just a shitty game dev. Sure, it's fast, but not worth it, and it takes a lot of the artistry out of the media."
                        }
                    ]
                },
                {
                    "author": "DamnItDev",
                    "text": "The internet is full of people spouting their ignorant beliefs\n\nPart of the problem is rage baiting for engagement, and how effective that is on social media.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Yeah :(",
                            "replies": [
                                {
                                    "author": "SpacerDev",
                                    "text": "I feel compelled to point out that by taking it and posting it here you're 100% part of the cycle now.\n\nNo value judgements on that, discourse is a dark wood but it is odd for you to agree with the sentiment that what you're doing is inherently negative (not that I believe it is)."
                                }
                            ]
                        },
                        {
                            "author": "TheBullysBully",
                            "text": "Even if no one argues them, they just get applause from their echo chambers."
                        },
                        {
                            "author": "fragro_lives",
                            "text": "I know, being against AI is like the rage bait karma guarantee.",
                            "replies": [
                                {
                                    "author": "Timely-Instance-7361",
                                    "text": "AI is anti-human and anti-art. Video games are art made by humans."
                                },
                                {
                                    "author": "MimiVRC",
                                    "text": "See it worked! Every time!"
                                }
                            ]
                        },
                        {
                            "author": "thegfks",
                            "text": "the fact that subreddit called Defending AI Art even exists is rage bait on its own"
                        }
                    ]
                },
                {
                    "author": "stonebrokegames",
                    "text": "Pissing people off is the whole point of that post.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Yeah. Whole point of the whole subreddit too",
                            "replies": [
                                {
                                    "author": "Kirbyoto",
                                    "text": "The point of the whole subreddit - or, rather, one of its key defenses of AI - is that people get mad at \"AI\" but have no actual understanding of where the concept begins or ends."
                                }
                            ]
                        },
                        {
                            "author": "Xombridal",
                            "text": "Everything I've seen to \"combat AI\" is literal slop\n\nLike sure I get artists don't want people to rip them off, that's fair \n\nI get coders don't want their code stolen by AI, that's fair\n\nBut all other arguments are garbage\n\nLike if you don't like it it's fine, I don't particularly like ai either but it is useful and helpful for people who need to overcome writer's Block, artists block, overcome a hurdle in code, or just screw around\n\nAlso without AI we couldn't have such confidentiality incorrect sentences as Google's AI telling me you can buy rare candies in Pokemon Scarlet off of ebay",
                            "replies": [
                                {
                                    "author": "orangutangulang",
                                    "text": "What exactly are you going on about? Are you against AI stealing the work of artists and coders or not?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChipmunkObvious2893",
                    "text": "I’m 99% sure that was the goal."
                },
                {
                    "author": "LuckyIntel",
                    "text": "Here's a bigger take,\n\neverything is just an if else condition (and theoritically even life is)",
                    "replies": [
                        {
                            "author": "theycmeroll",
                            "text": "Then why the fuck am I stuck in a while loop",
                            "replies": [
                                {
                                    "author": "LuckyIntel",
                                    "text": "It only lasts 'till you think false"
                                },
                                {
                                    "author": "mauri9998",
                                    "text": "Recursion"
                                },
                                {
                                    "author": "EleidanAhapen",
                                    "text": "Dah, press ctrl+c"
                                },
                                {
                                    "author": "XxNaRuToBlAzEiTxX",
                                    "text": "You gotta update your condition big dog"
                                }
                            ]
                        },
                        {
                            "author": "Big_Award_4491",
                            "text": "Sometimes I think about the number 2. How its just a combination of zeroes and ones. And that in a philosophical sense it doesn’t exist inside the computer.",
                            "replies": [
                                {
                                    "author": "LuckyIntel",
                                    "text": "Think about number 9 and it just takes a couple bytes for big smoke"
                                }
                            ]
                        },
                        {
                            "author": "JMH5909",
                            "text": "Even crazier, everything is a NAND gate"
                        }
                    ]
                },
                {
                    "author": "eyadGamingExtreme",
                    "text": "Procedural generation isn't even a form of AI, it's just a regular algorithm",
                    "replies": [
                        {
                            "author": "psychularity",
                            "text": "What you consider AI is very subjective. For instance, A* pathfinding algorithms are literally ~30 lines of code and are very easy to understand and program, yet you learn it in multiple classes while getting a degree in AI. A lot of people would argue it's not AI, but the line is very blurry. \n\nSame concept with a lot of robotics algorithms like localization with particle filters. It's not reinforcement learning, but it's still an intelligent algorithm. I could certainly see an argument that procedural generation is a form of AI"
                        },
                        {
                            "author": "R3Dpenguin",
                            "text": "Both procedural generation and AI are actually just a bunch of algorithms. Procedural generation might use an algorithm like wave function collapse. AI might use something like gradient descent. There's also algorithms that can be used by both, like pseudo-random number generation. \n\nSource: Software engineer, have worked on procedural, AI, and other types of algorithms.",
                            "replies": [
                                {
                                    "author": "eyadGamingExtreme",
                                    "text": "obviously it's all algorithms what I mean is procedural generation is not even close to being in the same realm as artificial intelligence"
                                },
                                {
                                    "author": "MoistMoai",
                                    "text": "The difference is one uses a neural network and the other doesn’t."
                                },
                                {
                                    "author": "RineRain",
                                    "text": "Well, yes. In fact procedural generation is  sometimes even referred to as AI. All of these are very vague terms. But none of this matters, because this conversation is clearly about procedural generation and generative AI, as in the type that takes a bunch of already made things and produces slop. It's clear what they meant by \"regular algorithm\". You contributed nothing to the conversation."
                                },
                                {
                                    "author": "SocksOnHands",
                                    "text": "The difference is that procedural generation involves algorithms carefully crafted by the decisions made by a human designer to achieve specific characteristics in their output, and a neural network based AI is trained by being given a bunch of data and gets incrementally adjusted to predict outputs for given inputs.  It's like the difference between an inventor tinkering with a machine they're making vs a pigeon who had been trained that pecking a picture of a battleship gives them birdseed, but they don't know why."
                                }
                            ]
                        },
                        {
                            "author": "Tasik",
                            "text": "Funny how things change. Once upon a time devs used to go out of their way to pretend their procedurally generated content was \"AI'. \n\nJust look at this [https://www.kickstarter.com/projects/1024146278/dungeon-alchemisttm/faqs](https://www.kickstarter.com/projects/1024146278/dungeon-alchemisttm/faqs)   \n  \n\"Are you actually using AI or is that just a buzzword?\"  \n\nand they answered. \"It depends on what you consider “AI”. We use a custom learning algorithm inspired by the popular Wave Function Collapse algorithm (https://github.com/mxgmn/WaveFunctionCollapse) to procedurally generate dungeon layouts and rooms. Most people would consider this a form of AI.\"\n\nBecause at the time it was cool to use AI.",
                            "replies": [
                                {
                                    "author": "SocksOnHands",
                                    "text": "The term AI has changed multiple times over the years.  When the field began, AI was largely about symbolic manipulation for tasks like deriving proofs.  Now someone might just consider that to be like a search algorithm to find solutions satisfying a set of constraints."
                                },
                                {
                                    "author": "beyondthef",
                                    "text": "The difference is people creating algorithms themselves versus talentless people using a program that someone else made to \"create\" art and think they're geniuses for doing so."
                                },
                                {
                                    "author": "LuxTenebraeque",
                                    "text": "The claim here is that they use an AI derived seed for procedural generation - two differnt stages in the process!"
                                },
                                {
                                    "author": "nuker0S",
                                    "text": "The whole algorithm is very similar to how diffusers works, the most hated AI.\n\nThey both have the process of: Input data -> process data into instructions -> use instructions in the process.\n\nAlso, the repo doesn't only contain WFC. it contains code to give the instructions to the WFC.\n\nWave Function Collapse is about collapsing a cell based on rules, the generation of rules is not included in the original algorithm.\n\nSadly, the author doesn't inquire how the program chooses the NxN patterns, but i would guess that they are chosen at random. Which is kinda close to how diffusers work too."
                                }
                            ]
                        },
                        {
                            "author": "ThinkExtension2328",
                            "text": "![gif](giphy|l36kU80xPf0ojG0Erg)\n\nComputer decides what to do next in  automated way, that’s the >artificial< part of artificial intelligence.\n\nEven when it’s hand coded it’s still AI , eg read up on >Expert systems<, just because it’s pre programmed does not mean it’s not ai."
                        },
                        {
                            "author": "Diligent-Jicama-7952",
                            "text": "whoosh"
                        }
                    ]
                },
                {
                    "author": "Rude_Welcome_3269",
                    "text": "https://preview.redd.it/mqvrxikd5zee1.jpeg?width=1170&format=pjpg&auto=webp&s=205aa9f6fa8c1a29bd3943d01a495fe26dc22a1e\n\nRatio",
                    "replies": [
                        {
                            "author": "QuantumRedUser",
                            "text": "god this is so cringe",
                            "replies": [
                                {
                                    "author": "Rude_Welcome_3269",
                                    "text": "Ratio"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "The_Cozy_Zone",
                    "text": "Or, hear me out, procedurally AI generated"
                },
                {
                    "author": "Brad12d3",
                    "text": "There are two types of procedural generation in games. The first is traditional procedural generation, which relies on deterministic rules and randomization to create content. The second is AI-based procedural generation, which uses machine learning, neural networks, or adaptive logic to generate content in more dynamic and adaptive ways.\n\nSome modern games are already using AI-based procedural generation. For example, Microsoft Flight Simulator 2020 incorporates AI to help generate its incredibly detailed world. \n\nAI is very broad and incorporates a lot of different things.",
                    "replies": [
                        {
                            "author": "Correct-Money-1661",
                            "text": "AI is just a broad term for anything we give rules to function similar to a human. LLMs and image generation models are just the new thing.\n\nBack when I was in school, AI usually referred to independent actors in a simulated environment or a robot that could navigate its surroundings.\n\nNowdays people use it just for media creation like ChatGPT or dall-E. It's just tech jargon at this point but the original meme is trying to defend games made with AI art assets which are trained on copyrighted materials and comparing it to Rogue which generates based on game rules. Things like Microsoft Flight Sim was trained on data it was allowed to access and just procedurally generated houses based on rules given to it. They are all AI but one AI one was stealing art for its data model and the others used legally obtained data or original data."
                        }
                    ]
                },
                {
                    "author": "VulpesViceVersa",
                    "text": "Enemy AI \"\"\"programmers\"\"\" are taking real jobs from real enemies, and I'm going to downvote anyone who disagrees"
                },
                {
                    "author": "goliathusthehunter",
                    "text": "I don't get it, that's two different things",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "I know"
                        },
                        {
                            "author": "EyoDab",
                            "text": "Idk, it really depends on what the goal/end product is imo"
                        },
                        {
                            "author": "Correct-Money-1661",
                            "text": "They are both AI but the original mean is trying to claim Roguelikes and AI generated assets are the same.\n\nThey may do similar things (create assets/levels/content) but one is given set rules and original data by the game designer the other steals art to generate its own (usually)\n\nThere is nothing wrong with using procedurally generated content or using AI generated. Even back in the day everyone hated seeing the procedural buzzword everywhere cause it usually meant a lack of good content. What matters is if you use the AI model and data you have the rights to to make something good."
                        }
                    ]
                },
                {
                    "author": "ProperDepartment",
                    "text": "The meme is incredibly dumb and whoever made it doesn't understand what either of those things are.\n\nThat being said, some people here are so intensely against any form of Ai generation simply because they don't like it.\n\nUse it to concept whatever, help with scripts, or unblock some writing or ideas, get a feel for the music you want. It **is** a tool, despite what people here are saying.\n\nJust don't use it _in place_ of your art, design, writing, code, or music on your final product.",
                    "replies": [
                        {
                            "author": "PcPotato7",
                            "text": "Agreed. Using AI as a starting point is very helpful for me, especially when I don’t know how to start, can’t find information online, or can’t easily search something because I can’t ask it simply enough"
                        },
                        {
                            "author": "HustlinInTheHall",
                            "text": "I mean those people are the point of the meme. People are happy to let procedural generation slide but get pissed off at the idea that any AI is being used to develop any game, largely because they feel like it will mean fewer opportunities for them and other artists and devs\n\nEspecially for indie devs and indie programmers AI is a tool of enablement, you can solve problems with it that you can't solve on your own. But even where an AI can do a passable job, an AI+expert person is always going to yield a better final product."
                        },
                        {
                            "author": "Similar_Vacation6146",
                            "text": ">Use it to concept whatever, help with scripts, or unblock some writing or ideas, get a feel for the music you want. It **is** a tool, despite what people here are saying.\n\nThe problem with this sentiment is that it 1) misunderstands the creative process and 2) way overestimates what AI is capable of. \n\nRight now, today, if you're told to use AI to draft a script, you're most likely going to spend more time fixing the garbage the AI \"wrote\". This isn't a tool for creativity; it's a way, ostensibly, to generate more product.",
                            "replies": [
                                {
                                    "author": "ProperDepartment",
                                    "text": "Who's drafting an entire script with ai?\n\nJust draft some dialogue, a plot point, or side quest.\nThen re-write or edit it, it just helps unblock you or give you ideas.\n\nMidnourney is great for concepting ideas, or even just mood boards.\n\nAnd I had ChatGpt write a python script to reduce texture sizes from an asset pack i downloaded that was way too inflated for what I needed. After cleaning it up, I got the pack down from about 4gb to 500mb."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Tasik",
                    "text": "Here's what I find funny. \n\nThe indie dev community will eat it's own. Bashing, threatening, boycotting, banning, and overall just making their own lives more miserable and their development process more costly.  \n  \nMeanwhile AAA studios are going to incorporate various forms of AI throughout all their workflows. From coding assistance, language translations, voice synthesis, resolution scaling, model texturing, and more. And they'll do it in ways that don't come cross as garbage low quality content.   \n  \nAnd your average player doesn't care. The end product is all they care about. \n\nAll we're achieving by this is making low budget indie devs \"accountable\" in a way that puts them at a competitive disadvantage against the AAA studios.\n\nAnd for no reason. LLMs aren't going away. Large corporations will figure out ways around the generative content issues. We aren't helping each other by attacking indie devs right now.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Ehhhhh. Players do care about who makes the games. Gamers usually don’t play games known to have a lot of ai made stuff in it. Also, I think people are fine using ai to translate. I’ve used ai in dev before and it is fast to create what I want but it is really awful at building on anything. It takes so much longer to debug everything it hallucinates than just to write the code yourself. Just overall and especially with integrating with other scripts, it’s not very good in my experience.",
                            "replies": [
                                {
                                    "author": "Thermic_",
                                    "text": "This will change in time, and if it still looks great to a player looking for errors, then bam you’ve done it. It’s about having quality AI art, and not allowing an amateur to create it.\n\nPS: if you’re looking for early concept art or whatever for your game get in touch."
                                },
                                {
                                    "author": "Tasik",
                                    "text": ">Ehhhhh. Players do care about who makes the games.\n\nIf that were true, people would have boycott Diablo 4 or other blizzard games when we found out about the toxic workplace culture and sexual harassment which lead to the suicide of an employee. \n\nDiablo 4 instead has record profits.\n\nThere are things worse than AI and people don't care."
                                },
                                {
                                    "author": "PineappleDipstick",
                                    "text": "As long as the end product is good, gamers will buy it. Has there actually been any games that was successfully boycotted over ethical concerns?"
                                }
                            ]
                        },
                        {
                            "author": "AaronKoss",
                            "text": "You are confusing using AI in workflows to help the human create something or iterate on something faster with people (in that subreddit) saying they can type \"paella rule 55\" on chatgpt and they get back the equivalent of the divina commedia.\n\nNot sure about this sub in particular, but anywhere else other indie devs are not against the use of AI as a tool to iterate stuff faster.  \nIt's like those people saying \"you shouldn't use a commercial game engine, you should make your own, your game will not be a real game otherwise\". Theres an extreme in both directions.\n\n*This brings us to today's sponsor:*"
                        },
                        {
                            "author": "game_jawns_inc",
                            "text": "slurp",
                            "replies": [
                                {
                                    "author": "Tasik",
                                    "text": "It's hard to tell what that means, but I like amphibians so I'm just going to upvote it."
                                }
                            ]
                        },
                        {
                            "author": "dokkanosaur",
                            "text": "Players do care about there being lots of interesting games to play, and LLMs are really good at producing regressive output. So sure, lots of games will make use of AI and succeed, but every game will be a little bit more bland as a result, especially where LLMs are used to replace creative staff. \n\nWriting, concepting art, animation, sound design and music. A company can save lots of money by replacing human work in these areas with LLM output, but they'll suffer for it when all their games feel like schlock because it's not about how good the AI models are, it's about the accountability in actually being creatively responsible for every part of the process. \n\nAccountability over intent is a good thing. It's the difference between Peter Jackson's LoTR and The Hobbit films."
                        }
                    ]
                },
                {
                    "author": "Goliathvv",
                    "text": "This is a bit funny for me personally because my Master's 10 years ago was on Artificial Intelligence applied to procedural content generation in games.\n\nI used neural networks to evaluate the difficulty of level segments based on gameplay data and then created a level generator that would use the artificial networks to evaluate the difficulty of the levels it produced.\n\nIt was fun, and AI meant an entirely different thing back then as well.\n\nOh well, how sad that the person in the image is just being a troll.",
                    "replies": [
                        {
                            "author": "fragro_lives",
                            "text": "AI meant something different maybe, but algorithmically little has changed. What has changed is perspective, largely due to a misinformation campaign pushed by those that believe they are going to lose money.",
                            "replies": [
                                {
                                    "author": "theycmeroll",
                                    "text": "Yes, most people don’t understand what “AI” is and only assign it stuff generated by things like chatGPT, so the broad term definition of AI is different than what it is, like how everyone likes to call internet WiFi nowadays even though WiFi and the internet are two different things, and you can have one without the other."
                                },
                                {
                                    "author": "Goliathvv",
                                    "text": "Yeah, \"mean\" might have been a poor choice of words. The perception of AI was different at the time."
                                }
                            ]
                        },
                        {
                            "author": "6E696767657267617363",
                            "text": "that sounds fascinating, do you have a research paper i could read?"
                        },
                        {
                            "author": "BMFeltip",
                            "text": "How well did it work at evaluating the difficulty? This just sounds cool/interesting."
                        }
                    ]
                },
                {
                    "author": "MrP4L",
                    "text": "\"If my grandmother had wheels, she would've been a bike\"",
                    "replies": [
                        {
                            "author": "MrP4L",
                            "text": "Here's the reference source for the uninformed reader -\nhttps://youtu.be/A-RfHC91Ewc?si=O2IU65y5v6pGi1Jg"
                        },
                        {
                            "author": "plonkman",
                            "text": "if yir granny had baws she’d be your granddad"
                        }
                    ]
                },
                {
                    "author": "FernPone",
                    "text": "imagine looking for a good take on r/defendingaiart of all places",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Fair"
                        },
                        {
                            "author": "Thermic_",
                            "text": "[this post](https://www.reddit.com/r/DefendingAIArt/s/LPSmLJ9tBG) was pretty rich lmao"
                        }
                    ]
                },
                {
                    "author": "LawStudent989898",
                    "text": "Gamers have no idea what procedural generation actually is"
                },
                {
                    "author": "mana_hoarder",
                    "text": "I don't understand why an indie dev would be against AI? For a one man studio it's like a wet dream come true. Now I can make programming, art, sound, dialogue and storytelling, all without hiring someone else. Sure, AI doesn't do the work for you and you still need to know something from all of those fields if you are going to do them yourself, even with the assistance of AI, but isn't it just awesome? I think it's awesome.",
                    "replies": [
                        {
                            "author": "Comic-Engine",
                            "text": "It's very simple, it's become a purity test. You have to understand that they see more value in *being* an indie dev, than what they are making as an indie dev. Once you understand that, it makes sense."
                        },
                        {
                            "author": "MoistMoai",
                            "text": "The post isn’t even about if AI is good or bad, it’s just OOP blatantly misunderstanding the vast differences between AI and Procedural generation."
                        },
                        {
                            "author": "dokkanosaur",
                            "text": "If you're a game developer then you typically actually enjoy doing the development. It's like asking someone who likes solving puzzles why they aren't jumping to buy a puzzle solving machine.",
                            "replies": [
                                {
                                    "author": "mana_hoarder",
                                    "text": "You make it sound like there exists a tool that will make a ready product with one press of a button. Personally I enjoy seeing my vision come true. If you talk to a random indie dev, you'll notice many are miserable. There's a lot of depression in the profession. It's partly because it's so hard. There is so much to be done and so little time. I've commissioned people before. But I also work a low paying job and I don't have all the money in the world. As the main architect of the project, the more I can do with my own hands, the better. And I do consider using AI, doing it with my own hands, as far as I can get the desired outcome."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Affectionate_Bit6540",
                    "text": "Quick reminder: if you ever get a reddit ad that's AI generated (the image, not the caption), you should report it for \"low quality\", lol"
                },
                {
                    "author": "NoteThisDown",
                    "text": "I think most people against AI make sub par creations and know that even a basic AI could do better, and thus look at it as an enemy. I feel like it's the damn bell curve meme.\n\nPeople who are super shit love AI because it can do things for them that they could never do.\n\nPeople who are just average or \"okay\" hate AI because it does their level or work, and is a direct replacement for them.\n\nPeople who are actually good at creating things love AI again because it can do all the busy work and let's them focus on the truly creative and interesting parts of their creation.",
                    "replies": [
                        {
                            "author": "Tohu_va_bohu",
                            "text": "Total bell curve. The only ones crying are the painfully average normies"
                        },
                        {
                            "author": "wexleysmalls",
                            "text": "Can you point out some skilled artists who are pro AI? I have never seen this.",
                            "replies": [
                                {
                                    "author": "NoteThisDown",
                                    "text": "Well it depends what you mean by artist. if you mean someone who just makes classical art of drawing, painting, digital pictures, ect. Sure, why would they be pro AI? Some probably dont care, but why would they be pro? They would never use it. So of course you have not seen it. \n\nIf you count people who make movies/games visual effects, textures, scene design, ect, there are tons of people I have worked with personally that are really excited about where things are going."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "QuantumHue",
                    "text": "genrative ai does do procedural generation\nbut not everything that is proceduraly generated uses generative ai\n\nsimilar to how every elephant is big,\nbut not everything thats big is an elephant\n\nthe vast majority of regulikes do not use AI for procedural generation"
                },
                {
                    "author": "L30N1337",
                    "text": "How is \"Generates a semi-random sequence of rooms (that where all designed by the creator of the game) based on parameters\" the same as \"eats 5 artists and pulls an image out of it's ass\".\n\nI know it's rage bait, but if I bite here, there is no extra engagement on the original post."
                },
                {
                    "author": "PhoonTFDB",
                    "text": "I'll always be pro-AI, but the AI bros are actually some of the dumbest people I've ever met. Some points I've made that get me downvoted to oblivion, despite defending AI:\n\n*AI is a free tool that requires little to no skill. As long as you understand how to describe what you want, you can generate content every four seconds. If anyone on the planet can make art with no skill, no money, and no time incentives then no one should pay for any AI generated products.*\n\n*If you make AI content, you shouldn't put watermarks or any other defining \"symbol\" on the work. That prevents me from stealing it, making it useless. We're all ok with stealing other art, so don't get pissy when I steal yours*\n\n*The AI is the artist. You just told it what you want.*\n\n*AI content is a supplement to create content that time, skill, or money constraints prevent you from making. Don't let others gaslight you into believing that because you can't afford to hire an artist that your ideas just shouldn't exist, but also don't gaslight yourself into thinking it's higher quality than a real artist.*",
                    "replies": [
                        {
                            "author": "NoteThisDown",
                            "text": "So I agree with all but the first. The worth of something is rarely actually tied to the skill or effort it took to make. The value of something is what someone is willing to pay for it. If there are two pieces of art, and I'm looking to put one on my wall, I will pay more for the one I like more, not the one that took more effort to make.\n\nCould i have just made it myself? Sure. But I can also go and drive and pick up my food instead of using Uber eats, but I don't.",
                            "replies": [
                                {
                                    "author": "PhoonTFDB",
                                    "text": "Fair enough. I'm just annoyed by the people who make shit like this: No style prompts, no effort. Just \"mouse in neon lights\" and think they deserve to have money thrown at them for it. \"Effort\" in AI content is literally just adding a couple sentences for style.\n\nhttps://preview.redd.it/ufqi7v4yczee1.png?width=1080&format=png&auto=webp&s=4b381a87dd03a4c08c3b1e1b821be5f73cc64cfe"
                                }
                            ]
                        },
                        {
                            "author": "Timely-Instance-7361",
                            "text": ">*The AI is the artist.*\n\nArt is inherently human, a machine can never make art.",
                            "replies": [
                                {
                                    "author": "PhoonTFDB",
                                    "text": "Art is an end-product. It's the image on the screen, the music coming from your speakers. The emotion behind art is human. But that's not what I look for when I use AI, only the end-product."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "waspwatcher",
                    "text": "That subreddit has some of the most delusional people I've ever seen",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Yeah"
                        }
                    ]
                },
                {
                    "author": "Char_Zulu",
                    "text": "is spellcheck ai generated?",
                    "replies": [
                        {
                            "author": "Didicit",
                            "text": "It depends on what you mean by AI. It used to be an acronym for Artificial Intelligence but in the last few years the definition has been broadened to give as much room as possible for private equity to generate profits without generating any goods, services, or innovation.\n\nBy the second definition spellcheck could conceivably be considered AI if a sufficient amount of capital is invested into a company which claims spellcheck is AI."
                        },
                        {
                            "author": "MoistMoai",
                            "text": "Depends on how it’s done. Idk if anyone else does it, but I like defining AI as anything using a neural network. If it doesn’t use a neural network, then it’s just a regular algorithm."
                        }
                    ]
                },
                {
                    "author": "averysadlawyer",
                    "text": "I just think they're both neat."
                },
                {
                    "author": "YeetedSloth",
                    "text": "Modern “ai” is not real ai by definition, it is a learned network that outputs information based on its inputs. Nothing about it is actually intelligent, other than the design. Essentially just code running, the exact same thing as procedural generation."
                },
                {
                    "author": "Homeless_Appletree",
                    "text": "That's like calling the script I wrote to delete massive amounts of unneccesary files AI. "
                },
                {
                    "author": "Anarchist-Liondude",
                    "text": "AI-Gen shills have always tried to fiddle their way into a bunch of strawmen and illogical fallacies to try to justify their \"tech\" because they know that when you present the facts on the surface, it's really hard to find an angle to defend."
                },
                {
                    "author": "NoRegrets30",
                    "text": "It’s almost as if most assets used for Procedural generation are specifically made for the game and are not literally stolen from other artists without permission \n\nMaybe that’s what makes people mad \n\nBut idk",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Sometimes but often they’re paid assets to use in a game",
                            "replies": [
                                {
                                    "author": "NoRegrets30",
                                    "text": "True enough, but the same argument stands\n\nThey paid for those assets because they where in a store but AI art legit just takes art from deviantart of twitter and uses it to make its own stuff"
                                }
                            ]
                        },
                        {
                            "author": "Asneekyfatcat",
                            "text": "You could do the exact same thing with AI."
                        },
                        {
                            "author": "drearyd0ll",
                            "text": "You know you can train an ai on your pc using your own personal art right?"
                        }
                    ]
                },
                {
                    "author": "Gertsky63",
                    "text": "I use it, but in a limited way. For example, if I am having trouble with a broken weave in a recursive narrative, I may run my script through a gen ai programme to try to find a solution. It sometimes does. But usually its proposed solutions don't work."
                },
                {
                    "author": "tenaciousDaniel",
                    "text": "Tell me you don’t see or appreciate the subtleties of the finer things in life without telling me."
                },
                {
                    "author": "LucazCrazy",
                    "text": "Dang, I read the Defending Ai art subreddit and I agreed with them. I thought nobody would bait an eye to that post and now, here I am. I am stuck between disagreeing or agreeing with your post or their post.",
                    "replies": [
                        {
                            "author": "Xav2881",
                            "text": "Op cherry picked the worst shitpost on the subreddit\n\nAny other normal post and they would be doing mental gymnastics to get around it"
                        }
                    ]
                },
                {
                    "author": "Mantequilla50",
                    "text": "Proc gen usually involves handcrafted algorithms to achieve a specific effect while keeping randomness. The 'handcrafted for purpose' bit is what's important imo"
                },
                {
                    "author": "InternalActual334",
                    "text": "What about procedurally ai generated?"
                },
                {
                    "author": "HermeticHeliophile",
                    "text": "Where does the procedure come from?"
                },
                {
                    "author": "TheFinalPieceOfPie",
                    "text": "Who would have thought, AI Bros don't know shit about anything."
                },
                {
                    "author": "Ordinary_Swimming249",
                    "text": "One thing is pure math, the other is pure stolen data."
                },
                {
                    "author": "Oniros_DW",
                    "text": "\"defending ai art\"\n\nall the explanation you need"
                },
                {
                    "author": "moohooman",
                    "text": "I love how now we are considering random number generators as AI"
                },
                {
                    "author": "IAmNewTrust",
                    "text": "This actually does make me want to kms, WTF",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "It pisses me off for sure"
                        }
                    ]
                },
                {
                    "author": "GrindPilled",
                    "text": "Wait till they hear about enemy and combat AI"
                },
                {
                    "author": "SkyBusser9000",
                    "text": "\"Procedurally generated\": Blueprinting layouts hopefully from rules and assets that you own or produced using your own algorithms or devkit algorithms you paid for.  Good for Minecraft and Terraria-type games.  Most of the time you actually playtest the results.  Subnautica put a giant damper on the trend once people realized that a crafted world was still worth paying for compared to most auto-generated versions.\n\n\"AI Generated\": a bunch of lawyers met a bunch of rich guys to hammer out what level of auto-editing, derezzing, and algorithmicizing on massively scraped text and graphics doesn't technically count as 'stealing' and  whether or not you can actually hold the managers and administrators accountable when it makes an 'oopsie'.  Now being auto-pushed and reuploaded to crowd out actual search results from humans online (there is no working \"Not AI\" option.)  No one wants to play or playtest the AI games, assuming they exist, nor does anyone say YOU GOTTA LISTEN TO THIS AI MUSIC.  The only saving grace is that the AI hype bubble may actually get us to build nuclear power plants again."
                },
                {
                    "author": "flashmedallion",
                    "text": "Oh look, bad faith comparisons from AI dribblers. This is a very new development"
                },
                {
                    "author": "Cynis_Ganan",
                    "text": "AI...\n\nWhat does the \"I\" stand for?"
                },
                {
                    "author": "vyxxer",
                    "text": "You'd think AI junkies would hate misnomers on what AI is. \n\nGuess I can start using the roll table I used for DND monster strategy be called AI.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "lol yeah"
                        }
                    ]
                },
                {
                    "author": "Ok_Business84",
                    "text": "It’s sorta not tho, the term ai has grown to encompass so many things now. 10 years ago a chatbot was a chatbot, and an algorithm was an algorithm. But now both are easily considered “Ai”"
                },
                {
                    "author": "Rerrison",
                    "text": "That sub is incredibly dumb. Like... almost admirable how dumb they are."
                },
                {
                    "author": "cobaltSage",
                    "text": "While procedural generation is also very important for video games I do think that it is something that is very much criticized even in the gaming sphere, at least if we’re talking assets. In BotW, it may be easy to forget that all these character models are in fact upscaled Miis, but when you look three inches to the left at Bethesda, and let me tell you people did not like those procedurally generated planets one bit, and when it comes to characters, people have definitely had things to say about how bad some of the characters look when they’re made mixing and matching assets into model, especially the older it goes.\n\nLike if the argument here is that people like procedurally generated assets to defend art, no people absolutely don’t. \n\nProcedurally generated gameplay can be a fun experience, but the art assets have historically always been a mixed bag. Hell, I can’t think of a single person who’s clicked on any character creator’s randomized setting and thought “oh yeah, no adjustments needed for sure.” Your Minecraft world? Oh yeah, you can make it your own but I know you take a look at where you spawned and immediately thought “ugh, why is there this ugly rift like gash here like 50 blocks away I am changing all of this.” \n\nThe only time I’ve seen people like procedural generation is either when the game gives them such creative freedom that they can clean it up and work around it (like Minecraft, terraria, etc) or where the procedural generation is so guided that it’s never a question of if something is going to look bad to start (Pokemon Mystery Dungeon, Binding of Isaac, Dark Cloud)."
                },
                {
                    "author": "KillerNail",
                    "text": "That's why I hate people using the term \"AI\" for literally anything. 10 years ago when someone said \"AI\" you would think of robots that are indistinguishable from humans, that think, act and talk like us. But today people call any program that is more complicated than a calculator \"AI\". Even fucking fridges and ovens are called AI now, just because they have a fancy screen on them."
                },
                {
                    "author": "Suitable-Piano-8969",
                    "text": "that's...wrong just Straight incorrect"
                },
                {
                    "author": "Spooky_Leaves",
                    "text": "Procedural can mean wavefunction collapse no? Thats not AI its math. \n\nCorrect me if I'm wrong please"
                },
                {
                    "author": "Soulless35",
                    "text": "In respect to video games, what exactly is the difference? I assume ai generated would just be a more sophisticated feeling version of procedural generation?",
                    "replies": [
                        {
                            "author": "nathanielx9",
                            "text": "AI takes in data that isn’t own by the creator of set game or exc. procedural the dev has to put in code and assets themselves to create the randomness"
                        }
                    ]
                },
                {
                    "author": "DangerDragonXCV",
                    "text": "“Defending AI art”\n\nSaddest thing I’ve seen in a while"
                },
                {
                    "author": "CellObvious3943",
                    "text": "username checks out"
                },
                {
                    "author": "TreeGuy521",
                    "text": "Imagine if the binding of Isaac had actual ai generated rooms instead of a vast amount of pre-created ones that get combined. It would be so dogshit lmao"
                },
                {
                    "author": "MoistMoai",
                    "text": "Neural networking and training time should be the defining factor between a procedurally generated thing and an AI generated thing. If I code the procedural generator, then it’s not AI. If AI procedurally generates something based on its training data, then it’s AI."
                },
                {
                    "author": "A_Scav_Man",
                    "text": "Tf is lil bro talking bout lol"
                },
                {
                    "author": "hello350ph",
                    "text": "Wow mincraft is the root of all evil then"
                },
                {
                    "author": "MrP4L",
                    "text": "That's like comparing a fork and a sword then trying to figure out which one can wash your car better",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "This is a pretty good comparison"
                        }
                    ]
                },
                {
                    "author": "Old-Mango-9357",
                    "text": "Of course you screenshot the worst argument from that sub. If you had shared almost any other post from that sub, you all would be doing a ton of mental gymnastics and blatantly disregard logic."
                },
                {
                    "author": "PKblaze",
                    "text": "Up next - making images using photoshop is equivalent to using an AI to generate an image.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Good comparison. Me approved 👍"
                        }
                    ]
                },
                {
                    "author": "CaptainR3x",
                    "text": "This subs is an echo chamber don’t give them attention",
                    "replies": [
                        {
                            "author": "Xav2881",
                            "text": "So is this comment section\n\nAnything vaguely against ai gets upvoted, no matter how stupid the argument and anything vaguely pro ai, no matter how correct and factual, gets downvoted"
                        }
                    ]
                },
                {
                    "author": "samu1400",
                    "text": "That subreddit is straight up delusional.",
                    "replies": [
                        {
                            "author": "Xav2881",
                            "text": "In what way?"
                        },
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "You would be correct"
                        }
                    ]
                },
                {
                    "author": "ProgrammingDysphoria",
                    "text": "Procedural generation generates environments and maps to create a unique experience.\n\nProcedural generation is NOT typing into a box and getting a \"uncanny valley\" result that you claim as your own.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Yes"
                        }
                    ]
                },
                {
                    "author": "firemark_pl",
                    "text": "That's the problem with art. Most of people don't see how many time and skills are required to make art. And that's beautiful when you can see, read and talk about process of making an art. But it requires nonzero knowledge about that."
                },
                {
                    "author": "NeonFraction",
                    "text": "This is how it feels as a tech artist when when people talk about optimization and ‘day one patches.’ \n\nDear god no that is NOT how that works."
                },
                {
                    "author": "AkemiSasakii",
                    "text": "Who made this shit 😭😂",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Oh his username is fitting @starvingly_stupid227",
                            "replies": [
                                {
                                    "author": "Introvoi",
                                    "text": "r/UsernameChecksOut"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Little-Particular450",
                    "text": "lol. Its like saying using a calculator to do math and asking AI to solve the equation is the same thing."
                },
                {
                    "author": "Loud-Ad-1084",
                    "text": "OOP username checks out"
                },
                {
                    "author": "Affectionate_Bit6540",
                    "text": "Never seen an ai bro \"\"\"make\"\"\" anything as enjoyable or as meaningful as an average Spelunky level",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "lol"
                        }
                    ]
                },
                {
                    "author": "rwp80",
                    "text": "Wikipedia says:\n\n***Artificial intelligence*** *(AI), in its broadest sense, is intelligence exhibited by machines, particularly computer systems. It is a field of research in computer science that develops and studies methods and software that enable machines to perceive their environment and use learning and intelligence to take actions that maximize their chances of achieving defined goals.*\n\n*In computing,* ***procedural generation*** *is a method of creating data algorithmically as opposed to manually, typically through a combination of human-generated content and algorithms coupled with computer-generated randomness and processing power.*\n\nThey are clearly two different things, although of course there is some overlap depending of what examples you cherry-pick and how you interpret these definitions.\n\nThe key point is that definitions are themselves vague, somewhat subjective, not any kind of rock-solid \"law\".",
                    "replies": [
                        {
                            "author": "Introvoi",
                            "text": "Artificial Intelligence: It employs machine learning models to analyze data and identify patterns to make decisions or generate content. AI can adapt, learn from new information, and improve its performance over time, enabling more dynamic and complex results.\n\nProcedural Generation: It uses predefined algorithms that follow fixed rules or established parameters to automatically create content. These algorithms can be deterministic or include controlled randomness, allowing for systematic or variable outcomes.\n\nAt least, that's why i understand from my computer science course"
                        }
                    ]
                },
                {
                    "author": "GingerVitisBread",
                    "text": "Humans can think of things while creating a world and offer a complexity and depth at the cost of time. Generated worlds will only offer vast expanses and unique experiences at the cost of detail. There's a time and place for each. I don't think anyone really hates generated worlds, we all just dislike when they're poorly integrated."
                },
                {
                    "author": "Odisher7",
                    "text": "I am so fucking tired of people not understanding AI. Usually it annoys me because they attack it without reason, but mate, there are morons on both sides. For the love of god people do some research, it's not the second coming of jesus and it's not satan. People are way too opinionated for not having any idea about how it works"
                },
                {
                    "author": "DrDread74",
                    "text": "I remember when all the Candle makers would riot and sabotage the Light bulb factories when they came out, demanding we all use Candles.\n\nPeople never change"
                },
                {
                    "author": "armorhide406",
                    "text": "Is r/defendingaiart not a troll subreddit?\n\nIs the OOP making the statement unironically? Starvingly stupid is apt",
                    "replies": [
                        {
                            "author": "Usual_Ad6180",
                            "text": "The entire subreddit is techbros who don't understand tech thinking they understand tech 😭",
                            "replies": [
                                {
                                    "author": "Xav2881",
                                    "text": "It’s mostly people who understand what they are talking about responding to the ridiculous and factually inaccurate claims of people against ai and artist who desperately want ai to disappear so they can keep charging 200$ for their art."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "alexzoin",
                    "text": "This makes me so mad.\n\nI've been a fan of generative art for a long time and I'm so upset that people don't know that it has nothing to do with machine learning or \"AI\" at all.\n\nAlgorithmic generation is cool and interesting and fun and creative in so many ways. It's also hand crafted in an artistic and unique way. Programming and art touching in the best way."
                },
                {
                    "author": "TheBullysBully",
                    "text": "You just have to ignore the people who complain about it. All they have is how loud they can be. No one is doing anything illegal or even unethical."
                },
                {
                    "author": "Peppermute",
                    "text": "Dude, I’m not even a game dev and I can list 5 reasons why this comparison doesn’t work."
                },
                {
                    "author": "Cloud_SHmof",
                    "text": "The difference between Procedurally Generated and AI Generated is the difference between Minecraft and AI Minecraft"
                },
                {
                    "author": "SaltStatistician4980",
                    "text": "Meanwhile the reaction pics are from a hand animated game."
                },
                {
                    "author": "numbernon",
                    "text": "Regardless of your opinion on AI, this is such a hilariously bad faith argument, especially with the “roguelikes are bad for the environment” subtext. Commenters in the OP are supporting it while claiming to be game devs, and I can’t tell if they genuinely do not know the difference between procedural generation and generative AI, or are just pretending that the argument makes sense since it supports their beliefs"
                },
                {
                    "author": "No-Revolution-5535",
                    "text": "Procedural generation is art, and AI 'art' is not."
                },
                {
                    "author": "Seallypoops",
                    "text": "It's amazing how well some can talk directly out of their ass"
                },
                {
                    "author": "MadeySlime",
                    "text": "Me when I don't know what I'm talking about:"
                },
                {
                    "author": "jnellydev24",
                    "text": "Remember you can block people who post rage bait and defend AI. Looks like they are in this thread, so you can start there. Honestly people should be more trigger happy with the block button in general."
                },
                {
                    "author": "Post-Hungry",
                    "text": "Only somebody who doesn't know about procedurally generated content will even consider posting something like this."
                },
                {
                    "author": "Wiyry",
                    "text": "My hottest take is this: AI is not a tool. A tool is there to allow for new forms of expression. Photos allowed us to capture natural beauty, audio software allowed us to create new forms of music, etc. a chisel and a drill both allow us to make marks in marble but neither outright replaced things.\n\nAI (LLMs and stable diffusion, because when people say they “made X with AI”: this is what they mean) doesn’t do that. It REPLACES the need for effort and creativity. “Oh but I don’t know how to make textures” then learn. Start drawing and who knows: maybe you’ll come up with ideas while making said textures to improve your game. “Oh but I don’t know how to make music” then learn. Maybe you’ll find ways to make music that incorporate things that have never been done before. “Oh but I don’t know how to write” then learn. Continue this ad infinitum.\n\n“But why should I be forced to hire an artist if I don’t want to learn” because you’re not only getting an artist: you’re getting someone to bounce ideas off of. You’re also giving people who are new to the industry a in-road for future career expansion. By hiring an artist, a writer, a musician: you’re creating new talent and gaining team members. There are no negatives to hiring people or learning things yourself.\n\nLastly: AI is just a really bad business practice all around. Multiple studies done on the marketability of AI shows that products that are deemed as “AI powered” or in relation to AI usually bomb hard.\n\nSo in short: AI is nothing more than an excuse to be lazy. It does not allow you to improve and only hurts you when you use it. If you wanna make a game: then **MAKE** a game. Learn the skills or hire a team. Don’t stop at the front door and complain that it’s “too hard”.\n\nThis is why I’ve made it mandatory that all new artists, writers, musicians, etc, who I want to hire understand that if they ever use AI: they are fired. I make sure that every artist I hire is an actual artist who understands how to draw, make music, write, etc. I will NEVER hire anyone who uses AI in any capacity. I despise it with my entire being as it takes something as human as the act of creation and expression and automates it. \n\nIt’s disgusting.\n\nEdit: and before people try and “gotcha” me with “you wouldn’t hire a shit artist” yes I absolutely would. I would rather hire an artist with zero experience who’s actually TRYING to learn how to draw than someone who just types a prompt into a machine to get an image.\n\nI do not care about saving money: I care about actually making something with my own hands.",
                    "replies": [
                        {
                            "author": "Asneekyfatcat",
                            "text": "Ok",
                            "replies": [
                                {
                                    "author": "Wiyry",
                                    "text": "Ok"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GameplayTeam12",
                    "text": "Check the subreddit, just by the name I would say to stay away from it.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Yeah…"
                        },
                        {
                            "author": "IMissMyWife_Tails",
                            "text": "Why the downvotes"
                        }
                    ]
                },
                {
                    "author": "ahawk_one",
                    "text": "One is AI theft that creates garbage.\n\nThe other is AI given strict guidelines to use legally obtained and owned material in a very specific way",
                    "replies": [
                        {
                            "author": "Timely-Instance-7361",
                            "text": "People need to stop calling algorithms \"AI\"",
                            "replies": [
                                {
                                    "author": "TheNinjaNarwhal",
                                    "text": "That and we also need to call generative AI \"generative AI\", because \"AI\" encompasses tons of things and not all of them are bad😭"
                                }
                            ]
                        },
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "It’s not even ai 99% time. It’s just perlin noise with tons of different effects and other algorithms stuff applied to it"
                        }
                    ]
                },
                {
                    "author": "cloudncali",
                    "text": "The question is, does a rogue like outsource the processing of its procedural generation to data centers that consume more water then the entirety of r/hydrohomies."
                },
                {
                    "author": "Mikey_entertains",
                    "text": "The difference with procedurally generated maps and such is that someone programmed and designed everything, so that when they run the randomizer script it puzzles everything together.   \nA.i. just plagiarizes everything."
                },
                {
                    "author": "DamagedCoda",
                    "text": "OOF"
                },
                {
                    "author": "basedbb1992",
                    "text": "Just reading the sub’s name pisses me off."
                },
                {
                    "author": "VegtableCulinaryTerm",
                    "text": "These AI dorks are insane.\n\n\nHad this interaction recently\n\n\n\nhttps://www.reddit.com/r/insanepeoplefacebook/comments/1i7y9uo/argument_about_ai_use_this_pro_ai_poster_compared/"
                },
                {
                    "author": "Ligeia_E",
                    "text": "that sub legit consists of all children / man-child."
                },
                {
                    "author": "cerwen80",
                    "text": "I've always felt angered by procedurally generated things in games. I always feel that they are a lazy shortcut at worst and a barrier between the player and the artist at best. all art is communication and games are art. When I play a game, I am experiencing the thoughts and feelings of the artists, the level designers, etc. procedurally generated levels are soulless and I gain nothing from playing them.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Bruh"
                        }
                    ]
                },
                {
                    "author": "MasterVule",
                    "text": "I'm just fascinated they can use reddit while having IQ of 10"
                },
                {
                    "author": "Kudzu_93",
                    "text": "Holy shit that subreddit did psychic damage to me"
                },
                {
                    "author": "DreamingElectrons",
                    "text": "Entirely different technologies."
                },
                {
                    "author": "Low-Polygeist",
                    "text": "Focus more on cool indie projects, not rage bait from delusional people seeking validation."
                },
                {
                    "author": "Luna2442",
                    "text": "Well it's not ai so lol"
                },
                {
                    "author": "xav1z",
                    "text": "they are just envious. they will stop soon"
                },
                {
                    "author": "Flight_Harbinger",
                    "text": "It's going to get a lot worse. Already companies that market their products as AI or AI-assisted are indistinguishable from pre-AI algorithms. I sell cameras for a living and every brand now markets their newest cameras as having \"AI-trained\" autofocus systems."
                },
                {
                    "author": "KSOYARO",
                    "text": "Hot take: people who cannot adapt and want to stop progress are those who hate AI. Like those guys who used to destroy robots in factories because it is easier to continually work manually rather to adapt and grow",
                    "replies": [
                        {
                            "author": "SprightlyCompanion",
                            "text": "~~Hot~~*Shit* take\n\nThere, fixed it for you",
                            "replies": [
                                {
                                    "author": "KSOYARO",
                                    "text": "This reaction was predictable. I cope with that"
                                }
                            ]
                        },
                        {
                            "author": "Timely-Instance-7361",
                            "text": "When digital art came around, there where a lot of artists who hated it, refused to call it art. However A LOT of artists saw the potential in digital tools and adapted.\n\nWhen AI came around NOT ONE SINGLE ARTIST supported it, because AI isn't a tool, it's plagarism with extra steps.\n\nWhat you want is the death of art and humanity.",
                            "replies": [
                                {
                                    "author": "Comic-Engine",
                                    "text": "I was a career artist long, long before generative AI. I absolutely see the potential and have adapted."
                                },
                                {
                                    "author": "KSOYARO",
                                    "text": "Who the f said I want that?! Don’t put your dumb words in my mouth. I am an artist. It is in my interests to have a healthy industry and good instruments. I don’t hate AI because I am not as dumb as people who can’t comprehend that the operators of the technology are those who should be taken into account. Not the tool. It has a great potential and as any other great tool it has to be properly regulated. Currently it isn’t and it is a problem of the corporations. Not the technology"
                                }
                            ]
                        },
                        {
                            "author": "stopmotionskeleton",
                            "text": "Hot take: just because it’s new doesn’t mean it’s good. Any technological update doesn’t automatically equate to progress, because progress implies the betterment of humanity. Look at nuclear weapons, look at all the poison we’re being force fed by corporations ever day. There are things that are objectively bad for us, that we don’t need, and despite many people wanting to bend over and take it in the ass from these tech companies, we should collectively be rejecting this trash. Gen AI is a solution to a problem that doesn’t even exist because art isn’t broken and it doesn’t need fixing. AI is environmentally destructive, foundationally built on mass plagiarism, and wholly unnecessary. It should have been created to find cures for diseases and relieve us from various hardships and tedium and instead it’s being used to automate the soul of our creativity and weaponized against us to fill billionaire pockets.\n\nIt’s garbage tech built by garbage people.",
                            "replies": [
                                {
                                    "author": "KSOYARO",
                                    "text": "I partially agree with you. Some technologies has terrible impact on humanity. But it doesn’t mean they don’t have good impact. Gunpowder not just killed thousands and millions but helped in many other fields to improve people’s life. AI is not an exception. It is another technology that has good and bad impact. It just means we have to regulate it properly. Otherwise I we should leave our homes undress and move to forests to live without all the bad technologies. Sounds like extremism. This is what I see"
                                }
                            ]
                        },
                        {
                            "author": "King_Cain",
                            "text": "Absolutely incorrect. I appreciate what people have been able to create with AI, but generative AI is dogshit & needs regulations.\nThe people who make an AI for their specific needs and feed them their own data? Lovely, please push forward with whatever you want.\nThe people who create AI's that steal whatever it can get its grubby mitts on and uses said stolen work to make images for people with zero credit to the OG artists? The LLMs that are used to 'talk' with your favorite characters/celebrities/YouTubers/streamers? Horrendous, please stop you've developed an unhealthy parasocial relationship with them.",
                            "replies": [
                                {
                                    "author": "KSOYARO",
                                    "text": "I see how people blindly hate AI as a technology itself and I personally don’t see any specific rescissions on how we could regulate it. This is what I cannot accept. Indeed, your points are absolutely right and I am 100% agree with you. My original message was more about how people blindly cancel everything that relates to AI so it looks like just laziness - refusing to adapt and improve\n\nStealing data is not good though. Indeed. It just means that this technology must be regulated properly. AI is cool as hell and it is our future"
                                },
                                {
                                    "author": "Asneekyfatcat",
                                    "text": "People blindly hate ground up LLMs too. You can find countless examples of it. Go ahead, get it regulated, everyone agrees on that, but let's not act like a scary AI indie artist is stealing your job."
                                },
                                {
                                    "author": "SavvyBevvy",
                                    "text": "As someone who loves technology, it pisses me off so much that I can't get excited about Gen. AI due to how incredibly unethical it currently is. The technology itself is remarkable, but it has the potential to make things so much worse for everyone, and let people profit unjustly out of other's works."
                                }
                            ]
                        },
                        {
                            "author": "ghostwilliz",
                            "text": "How is using bad images gonna get me ahead?\n\nHey guys, look at all this slop! Do I stand out now??? I don't think so, I think it's one of the fastest ways to capsize your project"
                        },
                        {
                            "author": "FernPone",
                            "text": "ai destroys the environment AND produces slop results, end of story",
                            "replies": [
                                {
                                    "author": "NoteThisDown",
                                    "text": "So if it didn't hurt the environment and produced good results, you're for it then?"
                                }
                            ]
                        },
                        {
                            "author": "Anarchist-Liondude",
                            "text": "AI-Gen wouldn't be as much of an issue if it wasn't for capitalism, creativity can still exists despite the soulless corporations and idiots who's biggest personal achievement is winning an argument against their shampoo bottles while taking a shower. But unfortunately people have to put food on their table.\n\nThe same reason why the worker destroying robots is justified in doing so is because while his company is about to becomes much more profitable, they'll also fire 95% of the workforce and hire 3 engineer for maintenance, while these workers will face homelessness and starvation because of a broken economical system.\n\n\\---\n\nTho I believe the difference here is that the factory robot's algorithm doesn't need child porn and illegally acquired artist's portfolio work to exists."
                        }
                    ]
                },
                {
                    "author": "C_Pala",
                    "text": "Probably said this with tremendous confidence and authority to somebody"
                },
                {
                    "author": "Rian352",
                    "text": "Wut?"
                },
                {
                    "author": "StarCitizenP01ntr",
                    "text": "People who are anti-AI are fighting a losing battle and will look more and more silly over time."
                },
                {
                    "author": "arqe_",
                    "text": "Power Generation = Boiling water.\n\nComputer Based Generation = If-then.\n\njust in case, /s"
                },
                {
                    "author": "MagicHands44",
                    "text": "Procedurally generated is ass in like 95% of games. And b4 u say 95% of games r ass or smthn I aint talking abt those"
                },
                {
                    "author": "Ok-Transition7065",
                    "text": "oh man.............................  ohh   man  3 of my  teachers will  kill this man with hammers xd"
                },
                {
                    "author": "OctaviusThe2nd",
                    "text": "That person has absolutely no idea what they're talking about, thus their opinion is irrelevant.",
                    "replies": [
                        {
                            "author": "Rude_Welcome_3269",
                            "text": "Which makes it annoying that they have to broadcast their stupid opinion to the informed"
                        }
                    ]
                },
                {
                    "author": "karma629",
                    "text": "Create a faction > rule that faction > profit.\n\nWelcom to any type of entertainment today.\n\n\"Fationism\" is generating ton of revenue.\n\nPeople are loosing 2 words:\n- Dibating.\n- Argumenting.\n\nIn order to formulate sentences and opinion you need TIME. Thing is the average focus time is 0,2 seconds ....so... here we are!\n\n:D love to see all the monkeys killing eachothers menawhile we have social global issues that nees UNIONS and Collective Thinking to be fixed....\n\nWe will see how the game industry will collapse in the next years. Maybe we will see new companies with new genres? Who knows!\n\nOr are we all gonna crazy GAIN with Pokemon 200000 gen, Dragonbal , Cod ,AS and WoW? Ahhah\n\nCheer guys"
                },
                {
                    "author": "ProfessionalAd3472",
                    "text": "Meh....Procedurally generated refers to generation within environments, whereas AI generated is used primarily in the context of stand alone creations, so these are vastly different things, contextually. The implication that they are the same thing is as simplistic as the the conflation in the meme IMO."
                },
                {
                    "author": "Anomaly_Entity_Zion",
                    "text": "What the actual...i think the meme maker doesn't get what procedural generation means holy sh...\n\nNo mans sky would like to have a word with this entity"
                },
                {
                    "author": "snakebite262",
                    "text": "There is a huge difference between the two.... Procedurally Generated content is still created by an individual. It takes from a pool of curated items and then puts them into several potential slots. AI Generated, especially using today's models, is typically using art taken from unwilling artists, copying them and yet changing them slightly enough to make it difficult to take legal action. Moreso, going through such massive stores of data is heavily intensive, causing a large use of energy. \n\nOne of the biggest problems with AI nowadays is that they use one word to refer to multiple systems. It's somewhat difficult to note that \"Hey, the AI used as a tool is better than the AI used to replace artists or to deflect blame from management.\""
                },
                {
                    "author": "RedVillian",
                    "text": "What, you don't just let LLMs generate new levels for you? What are you? Living in 1995?"
                },
                {
                    "author": "Cuprite1024",
                    "text": "I think I just felt several brain cells die upon reading this."
                },
                {
                    "author": "Prodigy_of_Bobo",
                    "text": "I demand you rephrase this using machine learning!"
                }
            ]
        },
        {
            "title": "We're making a game where you play as two kids having a soccer tournament in their grandparents' house",
            "author": "TimBuh",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "dehimer",
                    "text": "I would to play it with my children on xbox",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "We'd love to bring it to Xbox! so who knows!",
                            "replies": [
                                {
                                    "author": "Govt-Issue-SexRobot",
                                    "text": "Yes please!\n\nIt looks awesome - my kids and I would love this\n\nWish listing on steam for myself for now lol"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DeltainStudio",
                    "text": "Love the concept keep it up !",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you! :)"
                        }
                    ]
                },
                {
                    "author": "cani633",
                    "text": "As a former kid who used to play soccer with my brother or friends in our living room, this is one of the most fantastic ideas I've recently seen. Keep it up!",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Same here! That's where the concept started!\nThank you so much, means a lot! :)"
                        }
                    ]
                },
                {
                    "author": "AdowTatep",
                    "text": "Remind me of some games i'd get on those CDs back in the day \"1005+ games\" which I think were just flash games.\n\nI remember there was one where two siblings hated each other and they'd throw shit at each other from a slingshot, so it was basically angry birds but you had to hit your sibling"
                },
                {
                    "author": "ImCodeveloper",
                    "text": "This definitely looks like a fun game, bro, congratulations and good luck 👏🏻",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! Means a lot!"
                        }
                    ]
                },
                {
                    "author": "coatshelf",
                    "text": "I love this",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you!"
                        }
                    ]
                },
                {
                    "author": "Gamex07",
                    "text": "The game looks absolutely fantastic! The graphics are stunning, and the details are impressive. You can tell a lot of work went into the visual design.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! It definitely did!"
                        }
                    ]
                },
                {
                    "author": "NewSpread4",
                    "text": "This looks so chaotic, I love it",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! Chaos was our goal!"
                        }
                    ]
                },
                {
                    "author": "TimBuh",
                    "text": "Wishlist now! [https://store.steampowered.com/app/3028560/Footsy/](https://store.steampowered.com/app/3028560/Footsy/)\n\nFootsy is a chaotic multiplayer soccer party game set inside grandma's house! Smash furniture, shatter bottles, and tumble TVs as you compete in wild, goal-scoring action. Customize your characters, challenge your friends, and make every room look like a battlefield!"
                },
                {
                    "author": "stonebrokegames",
                    "text": "That looks hella fun!! :O",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much :D"
                        }
                    ]
                },
                {
                    "author": "SnooDoubts9380",
                    "text": "I love this!",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much!! Glad you like it!!"
                        }
                    ]
                },
                {
                    "author": "MapleSyrupDev",
                    "text": "nailed it. wishlisted.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! That helps out a lot! :)"
                        }
                    ]
                },
                {
                    "author": "OpenDevKit",
                    "text": "Incredible, looks fun to play too! I would love to see more 😄",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! :)"
                        }
                    ]
                },
                {
                    "author": "Byeka",
                    "text": "As a dad this gives me anxiety. But as a gamer and game dev this impresses the heck out of me.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! Maybe we should add a big \"Don't try this at home\" warning before the game👀"
                        }
                    ]
                },
                {
                    "author": "ixent",
                    "text": "Looks fun! Would be funny to have a 'damages' counter somewhere that keeps increasing according to what the kids break xd \n\nNew TV: $120 \n\nGrandma's favourite cookie jar: $999",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "That's actually a REALLY fun idea!",
                            "replies": [
                                {
                                    "author": "earlyriser79",
                                    "text": "Damages counter unblocks stuff."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "redtigerpro",
                    "text": "This is a good looking game.  Would you be interested in adding your game to our indie game bundle for GDC?  Good way to get in front of investors and publisher without actually having to go.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Sounds very interesting! Would it be possible for you to PM me the details?"
                        }
                    ]
                },
                {
                    "author": "Independent_Pain_266",
                    "text": "I used to play like this with my sibling in Peru! I think its a super LATAM insight",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Yes!! That sounds great! We used to also play like this in Holland when we were young! It seems like chaotic indoor football (with the occasional broken vase) is a universal experience 😂",
                            "replies": [
                                {
                                    "author": "Independent_Pain_266",
                                    "text": "That´s so interesting to know about other countrys!  Also awesome game btw!! ✨"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hentaiichan",
                    "text": "Such a fun and unique concept! I love the cute style!! Excited to see how it turns out!! #wishlisted",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you!!! We're actually planning to add a playable egg to the game :DD"
                        }
                    ]
                },
                {
                    "author": "tomsccp",
                    "text": "Looks awesome! Will definitely check it",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! Wishlisting helps a lot!💕"
                        }
                    ]
                },
                {
                    "author": "CodyTheLearner",
                    "text": "This looks clean!",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much!"
                        }
                    ]
                },
                {
                    "author": "StoicBountyHunter",
                    "text": "This is so awesome! I used to play football indoors with my brother when we were kids! And we broke a lot of stuff too!\n\nThe nostalgia on this one is on point!",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "That's exactly where the concept came from! Now we wanted to make sure the next generation kids wouldn't break as much!"
                        }
                    ]
                },
                {
                    "author": "Aggressive-Falcon977",
                    "text": "\"How many times have I told you not to kick the ball indoors\" Simulator!! Neat!"
                },
                {
                    "author": "SuccotashGreat2012",
                    "text": "you need to get some clever marketing for this cause it could absolutely blow up.\nEvery couple years another cutesy multiplayer game goes huge.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "We're definitely working on that! So let's hope it gets there👀"
                        }
                    ]
                },
                {
                    "author": "mega-stepler",
                    "text": "Will buy if it's a couch co-op and supports steam deck with controllers.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "It's definitely a couch co-op game! Have to check if it's deck compatible but would love to find that out!"
                        }
                    ]
                },
                {
                    "author": "SelectionOnly9631",
                    "text": "That's so cool!"
                },
                {
                    "author": "Sassbjorn",
                    "text": "This looks so sick. I'm loving the style and the gameplay seems like a blast!\n\nI could imagine this is a type of game that would be great with more friends. Is 2v2 something you've considered? If not it would of course be a huge scope creep so don't worry about it, I'm just wondering",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! We're definitely considering it, but we have to see if that fits within our time and budget limitations!"
                        }
                    ]
                },
                {
                    "author": "NoLubeGoodLuck",
                    "text": "This is incredibly wholesome",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! That's the goal :)"
                        }
                    ]
                },
                {
                    "author": "hatstaller",
                    "text": "Great vibes and the trailer shows off a really good variety in the mechanics/maps that keep it interesting",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! I worked very hard on trying to showcase as much as possible! :)"
                        }
                    ]
                },
                {
                    "author": "FatefulDonkey",
                    "text": "I love it. Would definitely get it on my Nintendo",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "We're first focussing on the steam launch, but would LOVE to release the game on Switch (or even Switch 2) in the future!"
                        }
                    ]
                },
                {
                    "author": "kinoki1984",
                    "text": "This is such a fantastic concept! Looks great. Exactly what I used to do with my brother growing up… broke some stuff too! 😅"
                },
                {
                    "author": "ekimarcher",
                    "text": "this is adorable"
                },
                {
                    "author": "ecusbucus",
                    "text": "Looks so much fun! It brought some memories!",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Glad it did!!"
                        }
                    ]
                },
                {
                    "author": "SolSurvivor101",
                    "text": "This looks great! Any switch 2 plans?",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "That would be a dream come true! Have to see how that would work though!"
                        }
                    ]
                },
                {
                    "author": "NocturnalRaindrop",
                    "text": "This is the first time I'm interested in soccer and I'm German.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "That makes us very proud haha!"
                        }
                    ]
                },
                {
                    "author": "RBZk",
                    "text": "That’s so cool man.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much man!"
                        }
                    ]
                },
                {
                    "author": "ProperDepartment",
                    "text": "Why stop at 2? This would be dope 4 player.\n\nOr add some simple Ai, so you can be on the same team.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Both features we would love to add! Let's wait and see what will be in the final version👀"
                        }
                    ]
                },
                {
                    "author": "MorphingReality",
                    "text": "you finna be rich",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "That would be great haha!"
                        }
                    ]
                },
                {
                    "author": "t0ska369",
                    "text": "Reminds me of something outta It takes two. Looks like a fun little mini game."
                },
                {
                    "author": "supakazes",
                    "text": "This is a great idea and looks very fun to play. Keep on !",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! :)"
                        }
                    ]
                },
                {
                    "author": "MegaCatStudios",
                    "text": "Love the concept! Looks like a lot of fun, too!",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much!"
                        }
                    ]
                },
                {
                    "author": "No-Ranger7179",
                    "text": "I love the art direction. It's cute and refreshing!"
                },
                {
                    "author": "earlyriser79",
                    "text": "I love the concept, the execution, almost everything. This seems to be as fun as \"boomerang fu\".\n\nHowever I think this would be a hit if the characters were less cute and more \"cool\", this seem oriented to small kids, which is great, but I find it too cute for general appealing.",
                    "replies": [
                        {
                            "author": "TimBuh",
                            "text": "Thank you so much! We're just basing the game on experiences we had as children :)\n\nWe like to think that a very large variety of gamers from all age groups can get excited about cuteness (as we have noted with playtests)\n\nAnd we try to have a look for everybody, if you wanna be cool goth, you can be one, if you wanna play as a tough guy with a mohawk, you can!"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Coming up on two years of work on my solo project after leaving AAA after 7+ years!",
            "author": "BeaconDev",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "SeaaYouth",
                    "text": "Looks fantastic. Gonna try out the demo",
                    "replies": [
                        {
                            "author": "BeaconDev",
                            "text": "Thank you! Would love to know how you find it!"
                        }
                    ]
                },
                {
                    "author": "BeaconDev",
                    "text": "Hey folks! I'm the ex-AAA solo-developer of [AETHUS](https://store.steampowered.com/app/2541530/AETHUS/?utm_source=redidev), a sci-fi survival/base-building game set on (and below) an alien planet, which you'll explore to mine and gather resources to build up your mining outpost on the surface, while unravelling a dystopian narrative involving ultracapitalist megacorporations!\n\nI left AAA in May 2023 after 7 years at studios like R* North, Build a Rocket Boy and Splash Damage, working primarily as a Lead Technical Designer.\n\nI wanted to make a survival game that **didn't fall into the classic combat tropes** that seemingly every single other one does, where you kill everything in sight, build turrets to defend against hostile aliens, etc. \n\nIn AETHUS, the environment itself is the only moment to moment danger, and you will craft and discover new tools and items to overcome those dangers, upgrade your suit and your sentient AI robot mining drone companion, to uncover the mystery of what's going on in this place! You can take it all at your own pace, and there's a strong narrative to drive you forward and keep you interested.\n\nI've also been working to make the game as 'comfy/cozy' as possible without it being an outright cozy-only game. There are a TON of decorations (including functional ones, like furniture!) and the building system is designed to be as easy to use, but powerful, as possible. I've also implemented a lot of QOL features that other games often miss, like crafting and building from storage,\n\nOh, and if you like decorating your base, [you can place pretty much any item in the game as a decoration!](https://streamable.com/5eckhs)\n\nIf you like the look of the game, please feel free to [Wishlist on Steam and try out the demo](https://store.steampowered.com/app/2541530/AETHUS/?utm_source=redidev), or join us in the [Discord!](https://discord.gg/WJEBMYgpgt) where you can with me directly. I'm really keen on developing the game together and integrating everyone's ideas as much as possible, where they fit the vision.\n\nI'd love to answer any questions you might have about the game :)",
                    "replies": [
                        {
                            "author": "Low-Polygeist",
                            "text": "Will this game be a solo experience or look at the possibility of multiplayer?\n\nWhat kind of obstacles are present in the absence of combat?\n\nAre resources renewable or do they remain depleted?\n\nWill there be controller support?\n\nIs this planned as a PC exclusive or ideally multiple consoles?",
                            "replies": [
                                {
                                    "author": "BeaconDev",
                                    "text": "Hey! Solo as the story is really at the heart of the game and I think that only works best solo, plus I'm just one dev so multiplayer was out of scope for the first game!\n\nIn terms of obstacles, the world is the main antagonist - you need to manage your oxygen level while exploring, and navigate environmental challenges. Boiling hot springs, giant chasms, lava, etc!. Hunger and thirst are present but are primarily a buff-only system (with exceptions) like Valheim.\n\nResources respawn, and spawn in random, defined locations.\n\nController support is planned, as well as Steam Deck support (though it actually already works).\n\nPC exclusive for now, depends how the release goes!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thoogah",
                    "text": "I tried the demo, overall it looks good and plays smooth, best of luck with 1.0 release.\n\nTwo main things that bothered me were the move speed and the rubble (the broken pieces) that comes from mining stuff.\n\nIf running was default that would be nice imo or having current run speed as base movement speed and a stamina bar for limited sprint.\n\nIf the rubble left after mining was intangible (with no collision) that'd be really neat because it got annoying when I was grinding for materials or maybe having them despawn faster might be better.\n\nAlso as QoL instead of the drone tehtering the mined materials with those little beams sucking them in might be better. When there are multiple materials sometimes they get stuck on stuff. Ignore this if there is a drone upgrade that hoovers resources.",
                    "replies": [
                        {
                            "author": "BeaconDev",
                            "text": "Thank you! Appreciate the feedback!\nSpeed is relatively low to start as there are a lot of ways to increase it over the game, upgrades, consumables, buffs etc. You can also set on auto-run in the options :)\n\nNoted on the other points!"
                        }
                    ]
                },
                {
                    "author": "redtigerpro",
                    "text": "This is a good looking game. Would you be interested in adding your game to our indie game bundle for GDC? Good way to get in front of investors and publisher without actually having to go.",
                    "replies": [
                        {
                            "author": "BeaconDev",
                            "text": "Appreciate the interest, but no thanks. All the best!"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Me when I start a new indie project",
            "author": "Allthebees_",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": []
        },
        {
            "title": "Would FromSoftware hire me?",
            "author": "NonOptimized0",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Esrrlyg",
                    "text": "r/shittydarksouls would love this\n\nEdit: never mind I see you've already posted there."
                },
                {
                    "author": "stonebrokegames",
                    "text": "You would be immediately hired once they see you! 🔥"
                },
                {
                    "author": "Tyrexas",
                    "text": "I love the way you don't have a dodge roll but just a forward flip lol",
                    "replies": [
                        {
                            "author": "NonOptimized0",
                            "text": "Haha yeah that's definitely not because I couldn't figure out how to make him roll on the ground without glitching through the floor",
                            "replies": [
                                {
                                    "author": "Tyrexas",
                                    "text": "Ship it"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EmperorLlamaLegs",
                    "text": "Absolutely, everyone needs janitors and security guards.",
                    "replies": [
                        {
                            "author": "NonOptimized0",
                            "text": ":(",
                            "replies": [
                                {
                                    "author": "EmperorLlamaLegs",
                                    "text": "Don't be sad! The mail room could need people too..."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ice_hammer893",
                    "text": "They'd make you ceo of the company"
                },
                {
                    "author": "Bwob",
                    "text": "Why are the walls covered with pictures of feet?",
                    "replies": [
                        {
                            "author": "Bored_Dal",
                            "text": "That's his resume"
                        },
                        {
                            "author": "NonOptimized0",
                            "text": "Because you can't make a souls game without feet",
                            "replies": [
                                {
                                    "author": "LifeOfTheCookie",
                                    "text": "Defeet"
                                }
                            ]
                        },
                        {
                            "author": "Dunmeritude",
                            "text": "Same reason you'd put a shit load of zippers and chains in the background when applying as a Square Enix character designer.",
                            "replies": [
                                {
                                    "author": "Bwob",
                                    "text": "When you put it like that..."
                                }
                            ]
                        },
                        {
                            "author": "MrSmock",
                            "text": "How did I not notice that"
                        },
                        {
                            "author": "aknockingmormon",
                            "text": "Funding from Quentin Tarantino is his backup plan"
                        }
                    ]
                },
                {
                    "author": "devilash_",
                    "text": "I think sir Quentin Tarantino would xD"
                },
                {
                    "author": "Bloodbath-and-Tree",
                    "text": "Hire ahead of peers"
                },
                {
                    "author": "BlueMoon_art",
                    "text": "Yes"
                },
                {
                    "author": "Kuregan",
                    "text": "Something's a foot"
                },
                {
                    "author": "AlexanderTroup",
                    "text": "Kojima might"
                },
                {
                    "author": "Soul_Bacon_Games",
                    "text": "Depends? Do you speak Japanese? xD",
                    "replies": [
                        {
                            "author": "NonOptimized0",
                            "text": "https://preview.redd.it/qhxshifqj0fe1.jpeg?width=2000&format=pjpg&auto=webp&s=263a0d8692d020f3aeecfc3414e17666903b24ca"
                        }
                    ]
                },
                {
                    "author": "Ok-Assistance7692",
                    "text": "Yes"
                },
                {
                    "author": "Aggressive-Falcon977",
                    "text": "They would be scared you'd put perform all of them my dude 🙌"
                },
                {
                    "author": "PerfectionOfaMistake",
                    "text": "Feet pics on walls are a bonus at application presentation."
                },
                {
                    "author": "SpectralFailure",
                    "text": "Add a marginally depleted mana bar and I bet pirate software would look at you and say \"look at his mana, what can he do\""
                },
                {
                    "author": "GodzillaGamer953",
                    "text": "Well the animation isn't 20+ years old so no, they wouldn't, sorry :("
                },
                {
                    "author": "captainAwesomePants",
                    "text": "I liked the bit where he thought about explosions."
                },
                {
                    "author": "Ok-Transition7065",
                    "text": "definitely  bro"
                }
            ]
        },
        {
            "title": "First Look: My Game's Main Menu - What do YOU Think?",
            "author": "InilyxStudio",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "mr-figs",
                    "text": "Nobody's mentioning mixels?\n\nThe background is very low res compared to your menu. They should be the same ratio. I.e. A pixel on the \"Enigma Isle\" title should more or less be the same size as a pixel in the background. When you mix them, you get what's called \"mixels\" and generally looks bad, kinda like it does here",
                    "replies": [
                        {
                            "author": "InilyxStudio",
                            "text": "Thanks for the feedback, I did not think of that"
                        },
                        {
                            "author": "SpacerDev",
                            "text": "> mixels\n\nYeah that's pretty good."
                        }
                    ]
                },
                {
                    "author": "DensetsuVII",
                    "text": "Like the colors on the island background\\~ Will it be animated? \n\nLogo feels very Stardew, which is great if you mean this to be a chill farming sim, though I do think the 'parchment' background color is too similar to that of the sky, kind of blends in, in an unintentional way. Consider either removing it or maybe replacing it with, for example, a dark, wide palm tree in the foreground? \n\nA great start!",
                    "replies": [
                        {
                            "author": "InilyxStudio",
                            "text": "I plan to make it animated but for now it is fixed",
                            "replies": [
                                {
                                    "author": "The_Real_tripelAAA",
                                    "text": "I might suggest centering the menu. When you click play, the menu fades. The screen shakes slightly while the volcano begins to smoke.\n\nI know the volcano is meant to be the focus. Maybe the menu buttons are worked into the terrain."
                                },
                                {
                                    "author": "GrindPilled",
                                    "text": "no you dont lol, its a still image you generated with ai"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Yodek_Rethan",
                    "text": "I'd say ditch the cloth behind the menu. Backdrop looks nice and inviting."
                },
                {
                    "author": "AppointmentSea3007",
                    "text": "I think it would look nicer without the translucent orange background and the title and buttons in the bottom center"
                },
                {
                    "author": "Neo2486",
                    "text": "I like it. I can smell the air just by looking at the background."
                },
                {
                    "author": "Creative_Patience450",
                    "text": "artwork is Ai. that’s why there is no animation and doubt they can add animation if they can’t make the art themselves. "
                },
                {
                    "author": "Deklaration",
                    "text": "Ditch the AI pixel art. Use it as a template if you’d like, but the pixels are smudged and that won’t do. It’s not fun to spend so much time on building a game, for it to end up with smudged pixels."
                },
                {
                    "author": "Brief-Discipline-411",
                    "text": "look like fake stardew valley"
                },
                {
                    "author": "GrindPilled",
                    "text": "horrible AI generated background, why are lots of devs using crappy AI art?, the pixels look all smudged",
                    "replies": [
                        {
                            "author": "VisibleExplanation",
                            "text": "You know why they use it. Because they can't do it themselves or pay to have an artist do it."
                        }
                    ]
                },
                {
                    "author": "PKblaze",
                    "text": "The background looks nice but there's something off about the title and options. I think it may be the colour of the paper throwing it or the fact that it's translucent. Or both."
                },
                {
                    "author": "Ransnorkel",
                    "text": "Decent"
                },
                {
                    "author": "crmsncbr",
                    "text": "I think the paper is a little too orange. It doesn't read as dusk lighting, if that's what you were going for. The background scenery is beautiful."
                },
                {
                    "author": "Mefist0fel",
                    "text": "It's nice, but the color palette is too reddish. It's ok for the island, like it's evening, but for the menu it's dark"
                },
                {
                    "author": "ViciousLegacyAUS",
                    "text": "I like it! I think definitely animating the smoke and water will go a long way. Maybe dont make the button background transparent?"
                },
                {
                    "author": "Upset-Captain-6853",
                    "text": "I'm not sure about the theme of your game, but I'd suggest making the background brighter - you already have that cloth(?) to make the buttons and logo stand out."
                },
                {
                    "author": "VisibleExplanation",
                    "text": "Game design nerd here, I think it looks great - the only changes I would make are removing the cloth BG behind the main menu and centring the logo and menu options. This will give it a cleaner look and let your main art shine.\n\nIf you didn't want to make those changes then just move the whole widget to the left side - our eyes look from left to right when looking at a screen or page, so this will be more pleasing to the eye. Hope that helps!"
                },
                {
                    "author": "einhaufenpizza",
                    "text": "Feels like a 90s adventure"
                },
                {
                    "author": "Rawesoul",
                    "text": "The style cloned from Catan"
                },
                {
                    "author": "Poiab",
                    "text": "I liked it.\n\nBut will the background be animated or is it just an image?\nThe menu I think is clearer than the back I don't know if it was on purpose, it depends on the objective.\n\nI think it's cool but I would put the menu and image more similar in terms of clarity/color and the left part of the background would put some info/button/something to fill"
                },
                {
                    "author": "StockFishO0",
                    "text": "Looks cool. I hope the background is animated cause if not then it would look uncanny. If it’s not animated then at least make it parallax. Also I’d say making the buttons a little bit more transparent OR just make the button colors a little bit less vibrant"
                },
                {
                    "author": "ArtDock",
                    "text": "Looks pretty clean, love the pixel art, but the buttons for play, settings and exit don't match the vibe of other elements and generally do not match up with the chosen color pallet. also, I would recommend making the font for the name of the game and the buttons match up better, again they looks good separately, but lack harmony together."
                },
                {
                    "author": "Ok-Buddy4499",
                    "text": "Looks nice, I hope there is animated background?"
                },
                {
                    "author": "smokebang_",
                    "text": "The background reminds me of catan."
                },
                {
                    "author": "Pisquilah",
                    "text": "Sorry for pointing this out since everyone seems to be avoiding it, but this looks like a stardew valley mod. I don't want to be rude, since I'm sure you had a lot of work doing this and it turned out really pretty, but it looks a little too much like SV. I get inspirations and references but you asked what I think.\n\nthis is what I think. although it really looks good, it also looks uninspired because it is just too close to stardew."
                },
                {
                    "author": "SoulofThesteppe",
                    "text": "The resolution contrast between the background and the menu is a bit too sharp. Also, the menu background can be a bit more transparent. Idk if it looks better but just a thought."
                },
                {
                    "author": "MadMonke01",
                    "text": "Background looks off to me . Did you use AI ??"
                },
                {
                    "author": "Scared-Manager-5166",
                    "text": "Honestly it looks really nice and inviting! If the image were slightly animated, a slight breeze on the tree, it could be good. But ita already great!"
                },
                {
                    "author": "Sufficient-Main-3266",
                    "text": "looks amazing!"
                },
                {
                    "author": "MadeySlime",
                    "text": "My only complains are the mixels"
                },
                {
                    "author": "Intelligent_Arm_7186",
                    "text": "im an indie developer. did u use AI to create this?"
                }
            ]
        },
        {
            "title": "First time we create a full building with our design software... And it's actually pretty satisfying ! (we are looking for testers)",
            "author": "DeltainStudio",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "DeltainStudio",
                    "text": "Hey everyone!\n\nWe're a two-person team working on a building design tool that makes creating urban environments way easier and faster, especially for indie game devs. Our software uses advanced procedural generation, letting you build anything from simple houses to entire cities with just a few clicks—and it's all highly customizable.\n\nIt's the first time we take the time to properly try our software and even if we are still in early stage of dev the result is actually pretty decent !\n\n💬 Want to follow our development more closely? Join our Discord! We're sharing regular updates about our progress, challenges, and brainstorming sessions. Since this software is being built for the community, we'd love to have your input on features and improvements.\n\nWE ARE LOOKING FOR TESTERS ! (check the discord)\n\nDISCORD: [https://discord.gg/sJbneVvEcB](https://discord.gg/sJbneVvEcB)\n\nWe're still in development, so your feedback would mean a lot as we gear up for Alpha. Sign up for the waitlist if you're interested in joining early and following our journey!\n\nWAITLIST: [https://cygon.deltainstudio.com/waitlist](https://cygon.deltainstudio.com/waitlist)\n\nThanks for the support! 🚀"
                },
                {
                    "author": "maxpower131",
                    "text": "It looks quite rustic! Are there plans to add modern props and could this be used for real world interior design?",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "Don't worry it's only the beginning ! We spent 1.5year creating a solid foundation and have the flexibility to create tools for tones of uses. Now it's only a matter of time and in which order we prioritise them. So if you have any suggestions or if you're thinking about any specific use cases we'll be more than glad to discuss them on Discord for example. And the props that you see are only a very basic set that we made purely to showcase the prototype of our tech but we're working on a way to import/create you're own designs to give that unique style every creator is looking for."
                        }
                    ]
                },
                {
                    "author": "Lanky_Use_4947",
                    "text": "Wow I’m interesting that. Waitlisted!",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "Thanks you won't regret it ;)"
                        }
                    ]
                },
                {
                    "author": "jeev21",
                    "text": " Looks great!"
                },
                {
                    "author": "redtigerpro",
                    "text": "I would be very interested in using this in a game I'm developing.  Are you creating this as a store asset or an API or what?",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "It's meant to be a standalone software independent from any platform or game engine. You'll be able to export you creation in a standard 3D format like FBX. What type of games is it ?",
                            "replies": [
                                {
                                    "author": "redtigerpro",
                                    "text": "It is an RPG in which players can create town buildings and dungeons in game.  The tool would need to be integrated into the game and be user friendly."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "isticist",
                    "text": "Wow, I love everything about this!",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "Thanks 🔥"
                        }
                    ]
                },
                {
                    "author": "Lol-775",
                    "text": "How much will this cost on release?",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "Ahah that’s a good question… it’s going to be a subscription but the price is yet to decide but feel free to come by on the discord to discuss about the future of this project 😉"
                        }
                    ]
                },
                {
                    "author": "avrguy004",
                    "text": "What is that program?",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "It’s our 3D building software called Cygon. It’s still in early stage of development but we working hard to make this dream happen !"
                        }
                    ]
                },
                {
                    "author": "FryCakes",
                    "text": "Exportable to FBX or similar?",
                    "replies": [
                        {
                            "author": "DeltainStudio",
                            "text": "yup only fbx for now but soon maybe other formats who knows ;)",
                            "replies": [
                                {
                                    "author": "FryCakes",
                                    "text": "It looks really good! Do I have to join your discord to test it"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "are they STILL too cute to kill? 🤔",
            "author": "Petricoregames",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Stepintothefuture",
                    "text": "Yes",
                    "replies": [
                        {
                            "author": "Petricoregames",
                            "text": "No rest for the wicked 😔"
                        }
                    ]
                },
                {
                    "author": "Nijgan",
                    "text": "Why do you want to kill poros"
                },
                {
                    "author": "tripleof",
                    "text": "Go look the debate on killing lootbags on deep rock galactic. I'd kill for the right reward"
                },
                {
                    "author": "millionwordsofcrap",
                    "text": "That's just two of them!! You just doubled the cute!!!"
                },
                {
                    "author": "TeaStainedGames",
                    "text": "Yes also now you have to kill their friend too 😭. It's the blue innocent eyes for me + fluff 😍"
                },
                {
                    "author": "Neh_0z",
                    "text": "There is an error on your animation. Clearly the body of the bottom wolly monster is moving up and down, yet the one on top is stabilized, floating in place. It makes it feel like it isn't trully standing on top of it."
                },
                {
                    "author": "PlentyExpensive8241",
                    "text": "That face has seen some Evil, no remorse from me."
                },
                {
                    "author": "sylkie_gamer",
                    "text": "That's so freaking cute, I love the art style."
                },
                {
                    "author": "Mansal_skots",
                    "text": "Just make them good guys"
                },
                {
                    "author": "KobaltDoesBlep",
                    "text": "I want marketable plushies of them now, good job"
                }
            ]
        },
        {
            "title": "I added more objects to the town 🤠",
            "author": "TeamConcode",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "f01k3n",
                    "text": "Ahah, this is amazing! I can only imagine how long this must have taken.totally worth it though!",
                    "replies": [
                        {
                            "author": "TeamConcode",
                            "text": "Thanks! It took quite a while. 😢"
                        }
                    ]
                },
                {
                    "author": "ChaucerBoi",
                    "text": "Is this 3D or 2D with a lot of clever tricks? This is truly awesome - really pushing the pixel art aesthetic into something new!",
                    "replies": [
                        {
                            "author": "TeamConcode",
                            "text": "Thanks! I’m mixing 2D and 3D. Basically, the terrain and objects are in a 3D structure, while the characters are in a 2D structure.",
                            "replies": [
                                {
                                    "author": "ChaucerBoi",
                                    "text": "That's so awesome! It feels like a more refined HD-2D and looks absolutely seamless. You've done incredible work!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Low-Polygeist",
                    "text": "This looks incredibly fun."
                },
                {
                    "author": "TeamConcode",
                    "text": "Full video here: [Full Video](https://www.youtube.com/watch?v=XWVKMylejCQ)\n\nAnd thank you for the wishlist: [Steam](https://store.steampowered.com/app/2888960/Graytail/)"
                },
                {
                    "author": "Friendly-Musician316",
                    "text": "I really like your style. What do you use for object design?"
                },
                {
                    "author": "Sufficient-Main-3266",
                    "text": "You are very talented! What's the games name?"
                },
                {
                    "author": "MegaCatStudios",
                    "text": "Looks like a lot of fun! So much freedom in how to move around!"
                },
                {
                    "author": "DriftWare_",
                    "text": "Is this 3d?!"
                }
            ]
        },
        {
            "title": "Perks of being an indie dev: spending hours adding vertical monitor support just to make 0.01% of players smile!",
            "author": "TheWulo",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "SpacerDev",
                    "text": "Amateur. Make vertical support native and add horizontal support and now your efforts will have made 99.99% of players smile.",
                    "replies": [
                        {
                            "author": "TheWulo",
                            "text": "😮"
                        }
                    ]
                },
                {
                    "author": "mana_hoarder",
                    "text": "Is this a mobile game? Then awesome. IMO mobile games play way better in that native vertical orientation.",
                    "replies": [
                        {
                            "author": "TheWulo",
                            "text": "I plan to release it on mobile one day, similar to Downwell. At the beginning I plan to release it on Steam for PC. The whole game is about climbing vertical dungeons so vertical monitors support seemed like a nice cherry on top for those crazy enough to have such a setup (as I do with my second monitor)."
                        }
                    ]
                },
                {
                    "author": "Low-Polygeist",
                    "text": "This looks impressively smooth and tight on the controls.",
                    "replies": [
                        {
                            "author": "TheWulo",
                            "text": "Thanks! You cannot imagine the amount of sleepless nights I invested to make it control like this. And I still have tons of things I would like to improve. Neverending story.",
                            "replies": [
                                {
                                    "author": "Low-Polygeist",
                                    "text": "Remember you're gonna be the harshest feedback as the creator!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SilentPoet7",
                    "text": "Yooo the sounds are satisfying af! Do you make them on your own or source them?",
                    "replies": [
                        {
                            "author": "TheWulo",
                            "text": "Thanks! Hell no I don't make them myself, you wouldn't want to hear that. I purchased some SFX packs from humble bundle some time ago and I kept using them since."
                        }
                    ]
                },
                {
                    "author": "TheWulo",
                    "text": "If someone of you has a vertical monitor as well (I use it for coding, really useful) and would like to try a PC game playable on it, I plan to release a free demo in about a month from now on Steam. If you want to check it out you can find it here: [https://store.steampowered.com/app/2426280/Dwarf\\_Legacy/?utm\\_source=reddit](https://store.steampowered.com/app/2426280/Dwarf_Legacy/?utm_source=reddit)"
                }
            ]
        },
        {
            "title": "What do you think of the trailer for my game? A roguelite where the character is a dinosaur that can be hybridized to increase stats and change appearance.",
            "author": "Chaos_Power_",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "M_RicardoDev",
                    "text": "I think it looks really cool, my only suggestion is to make the menu background feel animated instead of a static background image. You could add some parallax, movement or effect overlay.",
                    "replies": [
                        {
                            "author": "Chaos_Power_",
                            "text": "Thank you so much for the feedback! I will definitely try something, and in fact your ideas are very close to what I was thinking.",
                            "replies": [
                                {
                                    "author": "M_RicardoDev",
                                    "text": "You could separate the hand and the lady into 2 different layer images, and the lady goes up and down like breathing."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ImCodeveloper",
                    "text": "If you can emphasize what is happening during the trailer with text, your video will be more descriptive, other than that, it is a very descriptive trailer, well done 👏🏻🔥",
                    "replies": [
                        {
                            "author": "ImCodeveloper",
                            "text": "It looks like a very enjoyable game in the game, I would like to try it😇",
                            "replies": [
                                {
                                    "author": "Chaos_Power_",
                                    "text": "Thank you so much!!! You are very kind :)!!! I am working on preparing a demo on steam."
                                }
                            ]
                        },
                        {
                            "author": "Chaos_Power_",
                            "text": "Thank you very much for the feedback! Great suggestion, I will work on it to improve it even more."
                        }
                    ]
                },
                {
                    "author": "Bonkcade",
                    "text": "Very cool twist on the Survivors genre!",
                    "replies": [
                        {
                            "author": "Chaos_Power_",
                            "text": "Thank you very much for the compliment :)!!!"
                        }
                    ]
                },
                {
                    "author": "Chaos_Power_",
                    "text": "DinoSwarm is the game I'm working on. You can hybridize your Dinosaur using DNA from various body parts collected during battle. Corrupt your Dinosaur's DNA with various Elements or merge the Powers with the Elements, and you can fuse the various Powers together by changing their physics and stats."
                },
                {
                    "author": "Citysaurus_ART",
                    "text": "take my mONEY, day 1 buy for me if/when you launch it. Great work!"
                }
            ]
        },
        {
            "title": "Our roguelite FPS, Holy Shoot, just got a huge update! Improved game feel, revamped UI, and brand-new levels. Check out the latest gameplay preview and let us know what you think—feedback is always welcome!",
            "author": "HolyShootMod",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "HolyShootMod",
                    "text": "If you'd like to try our demo, check out our Steam page: [https://store.steampowered.com/app/2881660/Holy\\_Shoot/](https://store.steampowered.com/app/2881660/Holy_Shoot/)"
                },
                {
                    "author": "ImCodeveloper",
                    "text": "Bro what the hell is this, this is complete insane, what did you do, the shader you used and the feel looks perfect, I would definitely like to try this game 🤩🫵🏻🔥👏🏻",
                    "replies": [
                        {
                            "author": "HolyShootMod",
                            "text": "![gif](giphy|8Iv5lqKwKsZ2g)\n\nthis is how your comment feels like"
                        }
                    ]
                },
                {
                    "author": "Meister351",
                    "text": "Love the stylization, reminds me of Roboquest. Wishlisted!",
                    "replies": [
                        {
                            "author": "HolyShootMod",
                            "text": "Thanks for your support!"
                        }
                    ]
                },
                {
                    "author": "Killerisnc",
                    "text": "looks cool and fun and somehow reminds me of roboquest",
                    "replies": [
                        {
                            "author": "HolyShootMod",
                            "text": "Thanks!"
                        }
                    ]
                },
                {
                    "author": "PlasmaBeamGames",
                    "text": "Gotta say this looks really neat, like a cross between Borderlands and Doom Eternal or something.",
                    "replies": [
                        {
                            "author": "HolyShootMod",
                            "text": "![gif](giphy|3oEjI789af0AVurF60)"
                        }
                    ]
                },
                {
                    "author": "redtigerpro",
                    "text": "This is a good looking game. Would you be interested in adding your game to our indie game bundle for GDC? Good way to get in front of investors and publisher without actually having to go.",
                    "replies": [
                        {
                            "author": "HolyShootMod",
                            "text": "Thanks for the offer, but we will be there. Hope to see you in person!"
                        }
                    ]
                }
            ]
        },
        {
            "title": "I Made My First $2 With My Mobile Game!",
            "author": "Bojack92160",
            "text": "I’m beyond thrilled : my free mobile game on Android and iOS has officially earned its first $2 through ads! It’s not a life-changing amount, but it feels like a huge milestone after all the hard work I put into it. 😄\n\nFor fellow mobile game devs who are curious (or confused) about how ads work, I wanted to share the lessons I’ve learned during my journey (yes, I’m now totally an **ad expert** 🧐).\n\n**The Main Players**\n\n* **The User**: The gamer who plays (and hopefully loves) your game.\n\n* **The App**: Your masterpiece that shows some ads (not too much 😠).\n\n* **The Ad Networks**: The platforms providing ads, like Unity Ads, Google AdMob, ironSource, and AppLovin.\n\n* **Ad Mediation**: The middleman platform that decides which network’s ads to show to maximize your revenue, like LevelPlay/IronSource or AdMob mediation.\n\n**How Ads Work in Mobile Games**\n\nThere are three main types of ads you can use:\n\n1. **Rewarded Ads** (Most $$$ 💰): These are optional ads that players choose to watch (e.g., to get extra coins or revive a character).\n\n1. **Interstitial Ads** (Mid-range $$): These show up at natural breaks (e.g., between levels). They’re unavoidable but brief.\n\n1. **Banner Ads** (Barely $): Static ads that sit at the top or bottom of the screen.\n\nWhen your app needs to show an ad, it requests one from an ad network. Once the ad is displayed to the user, the network pays you.\n\nBut… *how much do you earn per ad?*\n\n**Understanding eCPM (Effective Cost Per Mille)**\n\n**eCPM** tells you how much revenue you make for every 1,000 ad impressions:  \n**Formula:** (Total Ad Revenue ÷ Total Ad Impressions) × 1000.\n\nYou want this number as high as possible. Here are the four main factors that impact it:\n\n1. **Ad Type**: Rewarded ads pay the most, followed by interstitials, and banners.\n\n1. **User Location**: The U.S. has the highest rates, while regions like Latin America or some parts of Asia pay less. Europe and Asia are generally in the middle.\n\n1. **Ads Per User/Day**: The sweet spot is \\~10–15 ads daily per user. I don’t know how players could watch this much ads in a single day, so this still confuse me.\n\n1. **Ad Network**: Different networks have different rates. That’s where **ad mediation** comes into play.\n\n**What Is Ad Mediation?**\n\nAd mediation platforms connect multiple ad networks to your app and optimize which ads get shown, based on payouts, user location, and other factors.\n\nUsing mediation boosted my eCPM significantly. Here’s my experience so far:\n\n* Without mediation (just Unity Ads): \\~$11 eCPM.\n\n* With LevelPlay (ironSource mediation, connected on Unity Ads, Google AdMob and IronSource): \\~$22 eCPM!\n\n**Some Insight (examples of eCPM)**\n\nHere’s a snapshot of what I’ve seen for rewarded ads:\n\n**For a rewarded ads the USA, it's around 13$,** while it is around 3$ in europe and 2.5$ in asia.\n\nFor banner: USA is at 0.6$, Europe at 0.2$, Asia at 0.15$ and (just for fun) Latin america at a splendide 0.04$ per impression.\n\nI won't discuss here on how to use it and where, since it is already a long thread, but of course, ads will impact the user experience (plz do not use banner ads at all, and use very limited interstitial).🙃  \nThere is a lots of resource on how to implement ads in your app online, so I will let you do your works. Good Luck for the solo devs willing to use LevelPlay Mediation, it’s a pain in the ass to set up, documentation is NOT CLEAR at all.\n\n**Support My Game ❤️**\n\nIf you want to check out my game and give some feedback about anything (I’m *starving* for it) :\n\nIOS: [https://apps.apple.com/fr/app/zroad-survival/id6584530506?l=en-GB](https://apps.apple.com/fr/app/zroad-survival/id6584530506?l=en-GB) \n\nANDROID: [https://play.google.com/store/apps/details?id=com.SkyJackInteractive.ZRoad](https://play.google.com/store/apps/details?id=com.SkyJackInteractive.ZRoad)",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "kidneyshake",
                    "text": "Haha, thats awesome! I havent made a game yet (on my own) but I have made third party merch before, and its just super exciting to see money trickling in!  \nCongrats and I hope your game does well!"
                }
            ]
        },
        {
            "title": "Then vs Now",
            "author": "Svitak77",
            "text": "https://reddit.com/link/1i8si95/video/i3vusfo36xee1/player\n\n",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "cipriantk",
                    "text": "Congrats on the improvement 😁 it look awesome",
                    "replies": [
                        {
                            "author": "Svitak77",
                            "text": "thanks ;)"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Why use a gun when you can throw the bullet anyway? [Bullet Syndrome]",
            "author": "AdOne304",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Ok-Assistance7692",
                    "text": "Is this basicly a 2D Game in 3D space? I like the look",
                    "replies": [
                        {
                            "author": "AdOne304",
                            "text": "Yeah basically a pve fps game with bosses and loads of weapons   \nAre you interested in playtesting? I'm thinking £100 prize to whoever beats my demo first",
                            "replies": [
                                {
                                    "author": "Ok-Assistance7692",
                                    "text": "Yes sure i would give it a try tonight :)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Practical-Command859",
                    "text": "I like the nine lives of a cat.",
                    "replies": [
                        {
                            "author": "AdOne304",
                            "text": "For some reason no one ever notices that, 🐱  \nAre you interested in playtesting this btw, potential £100 prize",
                            "replies": [
                                {
                                    "author": "Practical-Command859",
                                    "text": "Sure, I’d be happy to playtest your game."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cubedude01",
                    "text": "Reminds me a little bit of Heavy Bullets"
                },
                {
                    "author": "E_cel",
                    "text": "Art style and sfx are on point!",
                    "replies": [
                        {
                            "author": "AdOne304",
                            "text": "Thanks, I made most of the sounds with my mouth and just put a bunch of filters on it  \nWould you be interested in playtesting by the way?"
                        }
                    ]
                },
                {
                    "author": "the_brilliant_circle",
                    "text": "Why throw a bullet if you don’t need the gunpowder?",
                    "replies": [
                        {
                            "author": "AdOne304",
                            "text": "Dont think too hard about it"
                        }
                    ]
                }
            ]
        },
        {
            "title": "my game has NPCs who are in their feelings",
            "author": "eyebreakfast",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": []
        },
        {
            "title": "Tame Animals in Wildaria with Bubble Lassos",
            "author": "TheSpaceFudge",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "TheSpaceFudge",
                    "text": "When you latch a mana infused lasso on animals you must counter the pets movement, encircling them - Matching the Lasso/Green bar with the animals spirit in the bubble to tame them. It's more challenging depending on the animals health, rarity, and level."
                },
                {
                    "author": "Puntley",
                    "text": "That's super charming, I really like it!",
                    "replies": [
                        {
                            "author": "TheSpaceFudge",
                            "text": "Yay :)"
                        }
                    ]
                },
                {
                    "author": "flumpytripod",
                    "text": "Looks interesting. Cool idea",
                    "replies": [
                        {
                            "author": "TheSpaceFudge",
                            "text": "Thanks 🙏🏼"
                        }
                    ]
                },
                {
                    "author": "DPrince25",
                    "text": "It loooks like a pokeball. \n\nNintendo used Sue.\n\nIt was super effective \n\n/s"
                }
            ]
        },
        {
            "title": "We are working on dragon wing variants for our upcoming game.",
            "author": "BreakerBenc",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "AndroidJones",
                    "text": "Oh Jesus, here we go…"
                }
            ]
        },
        {
            "title": "Remote Bomb in my Retro FPS, please share your feedback",
            "author": "Redas17",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Practical-Command859",
                    "text": "It’s cool, but I’m not sure if the wall color should change from green to monochrome.",
                    "replies": [
                        {
                            "author": "Redas17",
                            "text": "Thanks!"
                        }
                    ]
                },
                {
                    "author": "ImCodeveloper",
                    "text": "It would be very enjoyable if Bomb can push us back a little bit when the bomb explodes, if there is no wall between the bomb and the player, other than that, your game looks very good, well done 🔥👏🏻",
                    "replies": [
                        {
                            "author": "Redas17",
                            "text": "Thank you, it's actually a damage player, if you stay nearby)"
                        }
                    ]
                },
                {
                    "author": "Redas17",
                    "text": "Is it looks fun to you? What game it reminds you? I post not for promotion (I don't have Steam page yet anyway) but for your feedback, because when you working long on your project, your eyes become blurry, thanks in advance!"
                }
            ]
        },
        {
            "title": "Weapons from my roguelike game Vaulted. A kind of mix of bloodborne and hunt showdown styles",
            "author": "Astrobionics",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Leaf282Box",
                    "text": "Fuck thats goooood, wishlisted immediately"
                }
            ]
        },
        {
            "title": "View from Enemy drone with AI, not player, is quite interesting. What do you think?",
            "author": "yeopstudio",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": []
        },
        {
            "title": "Six months ago, we prototyped this NeverLight location for the first time",
            "author": "ActioNik",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "ActioNik",
                    "text": "Thanks for watching!\n\nWe'd love to hear your feedback about NeverLight! 🤗\n\nPlease Wishlist if you liked it: [https://store.steampowered.com/app/3444260/NeverLight/](https://store.steampowered.com/app/3444260/NeverLight/)\n\nJoin our Twitter (X) and Discord for more frequent updates & to join our Beta-Test this Summer! You can find the links in my profile.\n\nYour support means the world to us! 🩷\n\nThanks and have a great day!"
                },
                {
                    "author": "vitiock",
                    "text": "Is it bad if I like the unfished older one better? It just feels cleaner with less clutter getting in the way of the camera, the new one looks like a hoarder lives there and looks over packed with details and clutter.",
                    "replies": [
                        {
                            "author": "ActioNik",
                            "text": "No problem at all, your feedback is very valuable! We're just in early alpha and there are many things to refine and reconsider! \n🙏 Thanks!"
                        }
                    ]
                },
                {
                    "author": "MegaCatStudios",
                    "text": "Looks interesting! Love seeing the differences of then vs now!"
                },
                {
                    "author": "mantik0Ra",
                    "text": "Looks great"
                }
            ]
        },
        {
            "title": "I just added night time to my open-world game, what do you think?",
            "author": "The-Flying-Baguette",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "The-Flying-Baguette",
                    "text": "If you are interested, you can check my new devlog here : [https://youtu.be/2OSmGxCw-tA](https://youtu.be/2OSmGxCw-tA)"
                },
                {
                    "author": "Alanbork",
                    "text": "depending on how much of a \"horror\" game this is, you might give a little more ambient light at night, rather than just showing the lit windows."
                }
            ]
        },
        {
            "title": "We've started working on our second level, rooftops still missing! What do you think?",
            "author": "DandelionDevelopers",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "ImCodeveloper",
                    "text": "It just needs a nice lighting and post-processing process, other than that it looks great, well done bro👏🏻",
                    "replies": [
                        {
                            "author": "DandelionDevelopers",
                            "text": "Thanks! Yeah this is still very early footage of our second level, there are no roofs and the lamps have no lights at all haha. But thank you very much :)"
                        }
                    ]
                },
                {
                    "author": "Due_Bobcat9778",
                    "text": "Poor roofs. What's the game about?",
                    "replies": [
                        {
                            "author": "DandelionDevelopers",
                            "text": "Yeah, we haven't added roofs yet\\^\\^ Still working on adding main buildings and some ground assets. \n\nIt's about a orphaned girl that goes on an adventure to find her parents together with her best friend that is a rat. It got some puzzles where you play as the girl and rat and some stealth parts\\^\\^"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Aseprite X Unreal",
            "author": "jt7770",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": []
        },
        {
            "title": "Intro sequence I made for our upcoming game, Cursed Blood. What do you think? :)",
            "author": "TheZilk",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "ChickenFriedAnorak",
                    "text": "Wow, awesome work!",
                    "replies": [
                        {
                            "author": "TheZilk",
                            "text": "Thank you :)",
                            "replies": [
                                {
                                    "author": "ChickenFriedAnorak",
                                    "text": "This is a bit random but I'm kind of blown away by the quality of your work. I work as a video editor for a UK studio and would love to make trailers for indie projects. I'd love to make a trailer for this, would you be interested in working together? "
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RetireBeforeDeath",
                    "text": "Reminds me of F.I.S.T., and I loved the atmosphere (and gameplay, and story) in that. A co-op roguelite with this aesthetic sounds awesome.",
                    "replies": [
                        {
                            "author": "TheZilk",
                            "text": "Awesome, glad you like it. Throw in a wishlist :)",
                            "replies": [
                                {
                                    "author": "RetireBeforeDeath",
                                    "text": "As soon as I get on the bus to get home. Roughly 5:40 pm pacific time, your steam wishlist count should go up by 1."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheZilk",
                    "text": "Took a while to finish this but finally :)\n\n[https://store.steampowered.com/app/3382290/Cursed\\_Blood/](https://store.steampowered.com/app/3382290/Cursed_Blood/)"
                },
                {
                    "author": "Low-Polygeist",
                    "text": "PLEASE tell me more! I'd love to test something like this.",
                    "replies": [
                        {
                            "author": "TheZilk",
                            "text": "It’s a 1-4 player co-op roguelite set in an alternate 1930s chicago called Cursed Blood.\n\nCheck out the steam page :)\nhttps://store.steampowered.com/app/3382290/Cursed_Blood/",
                            "replies": [
                                {
                                    "author": "Low-Polygeist",
                                    "text": "I'm excited!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hamasanabi69",
                    "text": "Bro this looks great. Not my type of game, but added it to my wishlist.  Good luck."
                },
                {
                    "author": "Unlucky_Plate_9841",
                    "text": "Ratchet and clank robot space pirate vibes"
                }
            ]
        },
        {
            "title": "Plunge into the Depths: Mythical Whalers Teaser Trailer—Wishlist on Steam!",
            "author": "nubmaster62",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "nubmaster62",
                    "text": "Ahoy, fellow adventurers! We’ve just dropped the official teaser trailer for Mythical Whalers, our upcoming nautical fantasy roguelike.\n\nIf you’re into seafaring quests, monster hunts, and forging alliances (or rivalries) with unique factions, you’ll want to set sail with us. Each run is procedurally generated—no two voyages are ever the same. Recruit a crew from legendary races, tackle fearsome sea beasts, and make choices that echo throughout your journey.\n\nWe’ve poured our hearts into crafting an ever-shifting world full of wonder and danger. If you like what you see in the trailer, please consider wishlisting Mythical Whalers on Steam—it truly helps us get discovered and means the world to our small dev team.\n\nCheck it out here:\n\n[https://store.steampowered.com/app/2787860/Mythical\\_Whalers/](https://store.steampowered.com/app/2787860/Mythical_Whalers/)\n\n\n\n[https://www.youtube.com/@mythicalwhalers](https://www.youtube.com/@mythicalwhalers)\n\n[https://discord.gg/FkttR6gWVp](https://discord.gg/FkttR6gWVp)\n\n[https://bsky.app/profile/mythicalwhalers.bsky.social](https://bsky.app/profile/mythicalwhalers.bsky.social)\n\nThank you for your support, and happy sailing! Don’t forget to let us know what you think—we’re excited to hear your feedback. Safe travels on the high seas!"
                }
            ]
        },
        {
            "title": "Ever wonder what Fia's melee attacks look like?? Here is a quick Devs close-up for it.🔥",
            "author": "PlayMortalRite",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": []
        },
        {
            "title": "The Arcane Library contains all knowledge a high elf mage needs.",
            "author": "KasperDev",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": []
        },
        {
            "title": "Title Screen of my game today and 3 years ago.",
            "author": "ichbinhamma",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Gaverion",
                    "text": "That's a pretty big tonal shift! The buttons are certainly better and the new one looks a lot more bleak.",
                    "replies": [
                        {
                            "author": "Wec25",
                            "text": "I think the bleak one is the old one",
                            "replies": [
                                {
                                    "author": "Gaverion",
                                    "text": "That's interesting to me, what makes you say that? \n\n\nTo me I see bright colors in the original along the tree which signals hope in a desolate landscape. There are also a lot of clear lines giving the impression everything is out in the open.\n\n\nThe second image has a lot of cooler colors and no living flora or fauna. The building is also quite foreboding with tall spires and fog shrouding it in secrecy. \n\n\nI think the biggest factor though is the simple lettering change. The original gave 80s action movie vibes whereas the second gives bow before your industrial overlords. "
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "could someone point me towards a indie publisher focusing on small budget games on steam",
            "author": "PrinceoMars",
            "text": "I have spent the last 2 years making a fps game which i was planning on selling for a small amount on steam I was in a talk with dosman games but due to disagreement I am no longer with them so any other publisher anyone could recommend would be great. ",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "PlunkOak",
                    "text": "Came across this post with a google sheets that has a bunch of publishers on it. https://www.reddit.com/r/gamedev/comments/1fmwhzy/most_detailed_publisher_list/ Can’t recommend any in particular but could be a good starting point.\n\nActually, this was the original post I found https://www.reddit.com/r/gamedev/s/yINMzRs8uQ looks like they were two separate spreadsheets"
                }
            ]
        },
        {
            "title": "Looking for indie game developers for interviews (research)",
            "author": "dereqke",
            "text": " \n\n👋 Hi, I’m a product design student! \nI’m looking to interview indie game developers for my research. If you have already published a game or are planning to do so, please leave a comment, and I’ll reach out to you. \n⏱️The interview won’t take much of your time. \nA like, share, or repost would really help boost your karma! ✨ \n\nhttps://www.linkedin.com/in/purpledozer",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Practical-Command859",
                    "text": "You’re welcome to interview me."
                }
            ]
        },
        {
            "title": "Wishlist then Early Access? What’s the proper timing?",
            "author": "Warriorduels",
            "text": "I’m getting very close to having my game ready for beta testing and looking for some best practices on how to approach setting up my Steam page.\n\nDo most folks create their page and set up a wishlist and let that try and grow for a while and then go into early access?  Do you do it simultaneously?\n\nLooking for some guidance from experience. ",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Arkenhammer",
                    "text": "Early Access is your launch. Generally recommended is to collect at least 7000 wish lists before you launch. Build your wish lists with a demo an play tests first. Only go into EA when you’ve got significant traction.",
                    "replies": [
                        {
                            "author": "CultivatorX",
                            "text": "Is 7000 a typo? I generally agree with this tho. Demos and playtests are fine. IME, the first full public release is where you'll probably see the most traction. So don't waste something like early access on a version of the game that won't hook people or offer the value in exchange for the price of game.",
                            "replies": [
                                {
                                    "author": "Arkenhammer",
                                    "text": "Somewhere around 7-10K wishlists is the typical threshold to be included in Steam's Popular Upcoming widget in the week before you launch. Making Popular Upcoming is a core part of any serious attempt at commercial success on Steam. It's not that you can't succeed without it but, if you are planning a launch strategy, you should definitely take it into account because it is one of the primary drivers of early sales."
                                },
                                {
                                    "author": "BrandonFranklin--",
                                    "text": "7000 is the minimum convention just because it seems to correlate with the minimum conversion for early purchases to trigger Steam to consider your game for featuring. It's not a hard number but generally this or better is when you start to have a genuinely commercially viable launch."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Warriorduels",
                    "text": "Thanks for all the help!"
                }
            ]
        },
        {
            "title": "Still have some things to smooth out, but any thoughts on my blocking mechanic?",
            "author": "MCShellMusic",
            "text": "[External Link]",
            "subreddit": "IndieDev",
            "comments": [
                {
                    "author": "Shortlinec",
                    "text": "If I understand correctly, I like the idea of having your evasion/block stat give you more frames to block. In 1v1 it might not be as useful but in group fights when multiple enemies are attacking you; would be much more helpful.",
                    "replies": [
                        {
                            "author": "MCShellMusic",
                            "text": "For sure! Yep, you’ve got the right idea. \n\nYeah, it can break up some pretty nasty combos. It won’t happen all the time, because it’s pretty precise, but when you hit a block it’s a pretty good feeling."
                        }
                    ]
                },
                {
                    "author": "MCShellMusic",
                    "text": "If you (or the computer) press the same button as a successful attack before the attacker presses it (within a timeframe determined by your Physical Evasion stat), you'll block! \n\nI also only have it set to be allowable if there's more than one button available, as each successful hit takes a button away until it resets after 4.  I removed that setting to make it easier to get the video, since there's some randomness on the enemy side of when they hit the button."
                }
            ]
        }
    ]
}