{
    "items": [
        {
            "title": "Simply having your phone in sight can significantly undermine your focus—even if you aren’t using it",
            "author": "Phukovsky",
            "text": "I experience this firsthand and just read a study proving it. Do NOT work with your phone next to you. The best thing you can do is put it in another room.\n\nI like to take it a step further and turn my phone off. I feel if it's on, I can still feel some kind of pull from it.",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "Ok-Worldliness-6096",
                    "text": "I feel like everyone should go back to using basic cell phones lol",
                    "replies": [
                        {
                            "author": "DangPDN",
                            "text": "I need my Apple Maps!!"
                        },
                        {
                            "author": "tobeast23",
                            "text": "I’ve been considering this. Just have a basic phone to send a few texts and make a call every now and then. \n\nThe only issue is that smartphones are fantastic for traveling. Maps, GPS, Uber, Apple Pay, digital boarding passes and hotel keys, etc."
                        }
                    ]
                },
                {
                    "author": "Bruhntly",
                    "text": "You know, I totally agree, but 2- factor authentication has completely ruined my ability to use this tip.",
                    "replies": [
                        {
                            "author": "Legal_lapis",
                            "text": "The \"leave the phone in another room\" was vital and I can't use it because of 2-factor authentication too, pisses me off!!"
                        },
                        {
                            "author": "tqnx84",
                            "text": "Yes. This sucks because I would need it every other hour to re-login my work network."
                        }
                    ]
                },
                {
                    "author": "perkornah",
                    "text": "What I do sometimes is put it behind my laptop. That way it’s out of sight but can still grab it if needed "
                },
                {
                    "author": "kingfisher-monkey-87",
                    "text": "Link to the study?",
                    "replies": [
                        {
                            "author": "Phukovsky",
                            "text": "Sub isn’t letting me post a link.",
                            "replies": [
                                {
                                    "author": "Phukovsky",
                                    "text": "Or maybe it is? Lol I dunno. I got a message saying my comment was deleted."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "penji-official",
                    "text": "Decent advice, although I think it depends on your phone habits. Speaking from personal experience, if you haven't developed the habit of wasting time on your phone, it's usually best to keep it around and on in case of emergency.",
                    "replies": [
                        {
                            "author": "sagevan",
                            "text": "Not to be a dick but this post probably isn't directed at people who \"haven't developed the habit of wasting time on their phone\" lol"
                        }
                    ]
                },
                {
                    "author": "bwiddup1",
                    "text": "I look forward to AI in glasses that will see what I'm doing and when I reach for my phone and a pattern interrupt alert pops up or speaks to me saying something like \"are you sure\" \"What's your intention to achieve by picking up your device\" or counting the times etc and guiding better digital discipline."
                },
                {
                    "author": "kingfisher-monkey-87",
                    "text": "And here I am on Reddit ... time to go out my phone out of sight! 🤣"
                },
                {
                    "author": "Expert-Grab-4518",
                    "text": "I tried going to the toilet without my phone. Felt like I escaped the matrix for 5 minutes"
                }
            ]
        },
        {
            "title": "What are your tips on waking up early?",
            "author": "Mountain-Insect-2153",
            "text": "I’ve been trying to get into better morning habits and wake up feeling energized. Coffee isn’t my thing, so I’ve started drinking Akina Royal Kenya Tea in the mornings, and it’s been a game-changer! The flavor is bold and smooth, and it gives just the right boost of caffeine to help me feel awake without overdoing it.\n\nMy mornings also include my dogs, my little alarm clocks! The moment I stir, they jump on my bed and make sure I’m up, even if it’s earlier than I planned (like 3 or 4 a.m. sometimes!). They’ve become part of my routine, and honestly, their excitement to start the day rubs off on me.\n\nI’m still working on making mornings less rushed. I aim for 7 a.m., but most days, I end up snoozing till 8 and just barely making it out the door on time. I’d love to be able to wake up earlier, maybe squeeze in some exercise, and have a calm breakfast instead of rushing out with just a cup of tea.\n\nDo you have any tips for morning routines or favorite teas to help with an energized start? Let me know what works for you!",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "National-Ad8416",
                    "text": "Have a kid whose school begins at 7:30am and for which the school bus arrives 10 minutes from where you live at 6:30am. You won't have any problems waking up early ever again.",
                    "replies": [
                        {
                            "author": "SunBringsLight",
                            "text": "I second that. They get you warmed up first by teaching you to immediately roll out of bed all throughout the night for a few years."
                        },
                        {
                            "author": "Legal_lapis",
                            "text": "Just reading this brings back childhood trauma. The side effec: after graduating I caught up on years of missed sleep lol"
                        }
                    ]
                },
                {
                    "author": "_JackLucas_",
                    "text": "Try sleeping in early. Alarm clocks really work for me but I also know that my body has its natural alarm clock for 8 hours. So whenever I sleep, I usually wake up 8 hours after that even without alarms to wake me up. But If I need to sleep less (like most days), alarms but it doesn’t work for everybody",
                    "replies": [
                        {
                            "author": "Millmd11",
                            "text": "Also, if you don't have this regular sleep schedule, try moving it toward your goals gradually rather than going from 9 to 6 am immediately.",
                            "replies": [
                                {
                                    "author": "AdExcellent5555",
                                    "text": "I don’t sleep more than 5 hrs a night morning is coffee exercise flying down the highway "
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FeralXenomorph",
                    "text": "Those sunrise alarm clocks are awesome. Mine takes 30 min to get to full brightness then the alarm goes off. I am always awake before the alarm goes off.",
                    "replies": [
                        {
                            "author": "Broad_Animal_8591",
                            "text": "do you mean the hatch alarm clock? i’ve been looking into getting one, do you think it’s helped to make it easier for you to wake up?",
                            "replies": [
                                {
                                    "author": "digitaldiaryxo",
                                    "text": "i love my hatch it really does help so much. it’s important to have a *reason* to get up early rather than just a want so you have a cue to get up (alarm) and then a why (your reason)"
                                },
                                {
                                    "author": "cocoaLemonade22",
                                    "text": "This is my concern as well. I assume it would be way more popular if it were truly game changing as the product ads make it out to be."
                                }
                            ]
                        },
                        {
                            "author": "goochmusic",
                            "text": "Which one do you have? There’s the Philips one that’s like $130 dollars that’s always recommended, and Amazon has one that’s like $35 that seems to do pretty much the same thing (although a little less bright) that I’ve been wondering about. $130 seems too expensive for something that seems like it would be pretty simple to achieve.",
                            "replies": [
                                {
                                    "author": "hainic0",
                                    "text": "I have a cheap one from Amazon (I think the brand is JALL) and it absolutely gets the job done. The only feature it doesn't have that I think some of the other cheap ones do is being able to set a different alarm for weekdays and weekends simultaneously. I read somewhere that the biggest difference between these cheap ones and the nicer ones like the Hatch is that the audio on the Hatch is much clearer (i.e. it sounds like actual birds are waking you up rather than a recording of birds), but I don't care much about that. My recorded birds still sound nice and peaceful in the morning and the sunrise light aspect works great. Would recommend!"
                                },
                                {
                                    "author": "DeliriumTrigger",
                                    "text": "I'll give another perspective. I haven't tried other brands, but I've tried three of the four Philips models, and I have both the most expensive and the mid-range versions in my house currently. IMO, the mid-range one currently listed at $108 is the best deal out of them. The app for the most expensive models is not great, and the colors on the $60 version didn't feel as natural and lacked the same brightness. I found myself feeling better waking up on the mid-range one than I did the cheaper model, though the cheaper model was certainly usable, and I imagine most sub-$50 alternatives could do the same job."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AggyResult",
                    "text": "Sounds simple but my morning routine rests entirely on my evening routine. If I can get to bed and asleep by 11, I can start my day at 7.",
                    "replies": [
                        {
                            "author": "mandabit",
                            "text": "I second this. I REALLY want to wake up early but have never been successful since my day functions fine if I wake up between 9-10am. But I personally don’t like starting that late in the day. I even have a one year old and I have unintentionally trained her to go to bed a little later so she wakes up later therefore I get to sleep in lol. But if I can just go to bed early (like before 11:30), I automatically wake up earlier since my body got enough sleep. Doesn’t matter if I don’t have a good motivation or not- If I went to bed early enough I don’t need to go back to sleep!"
                        }
                    ]
                },
                {
                    "author": "SirisGoldenhart",
                    "text": "Hey Mountain insect,\n\nMy top tip for waking up early is going to bed early. \n\nSeveral years ago, when I had my first daughter, I started waking up at 4am so I could go to the gym at 5am and be back by 7 when it was time for work.\n\nInvariably, this waking at 4am routine led to me passing out around 8:30-9pm. This was disconcerting for someone who used to consider themself a night owl. I tried to burn the candle at both ends for awhile, staying up late and waking up early, but it wasn't sustainable. Late nights began to lead to snoozed alarms, and I decided I preferred the gym to watching tv or playing video games.\n\nAfter two years of waking up and immediately slamming preworkout to go to the gym I will add this: do not use caffeine to wake up.\n\nIf you enjoy the effects of caffeine, don't take any until 30-45 minutes after waking. There are a number of reasons why you should do this, but the most notable is that it messes with your cortisol levels and makes you crash in the mid-morning. \n\n1. Go to bed early \n2. Make your alarm a pleasant song that begins quiet and builds to a level that wakes you up\n3. Don't drink caffeine until 30 mins - 1 hr after waking\n4. Make sure you have something enjoyable to look forward to upon waking. For me this was the gym but you have to find something that will, essentially, get you out of bed.\n\n\nI hope this helps! Welcome to the early risers club!"
                },
                {
                    "author": "Lantadyme",
                    "text": "put your alarm away from your bed"
                },
                {
                    "author": "GreedySnapshot86",
                    "text": "Oooooh I have one!! It's an app called nuj!\n\nIt makes you get up and scan a barcode or pay a penalty that goes to charity. I set a time limit of 10 minutes. 5 minutes to accept the misery of being alive in this world and 5 mins to scan the barcode 🥲\n\nI put the barcode in my basement so I have to walk down 2 flights of stairs to scan it. It also means if I want to go back to bed, I have to walk back up 2 flights.",
                    "replies": [
                        {
                            "author": "OkYellow1102",
                            "text": "Respect 🫡"
                        }
                    ]
                },
                {
                    "author": "Original-Macaron-639",
                    "text": "An early morning routine actually starts the night before. It’s all about what time you go to bed and setting yourself up for success in the morning. Make sure you have little things to look forward to when you get up - maybe you love your morning coffee - so put out your fav mug and get out some breakfast stuff. \n\nFor the longest time I couldn’t get up early but once I focused on the whole bedtime side of it, I can get up at 5am much more easily and I love it"
                },
                {
                    "author": "Forsaken-Traffic-838",
                    "text": "Honestly, to wake up early you've to sleep early. If you can sleep everyday on that 10-11pm mark, you can wake up by 7am energized. From my experience take a self help book to your bed to read, you'd definitely fall asleep early. \n\nP.S Absolutely don't take a fiction book to bed, you'll be awake till 7am to finish that book 😂 (trust me, been there)",
                    "replies": [
                        {
                            "author": "SweatyFetty",
                            "text": "Non fiction reading in bed is the way to go for me to get sleepy!"
                        }
                    ]
                },
                {
                    "author": "Future_Usual_8698",
                    "text": "Bright light- it triggers the brain to flood with 'wake up' chemistry \n\nMy choice early on was to put a very bright daylight bulb in a lamp and plug the lamp into a timer socket.\n\nBoth available at Home Depot\n\nCombine with an alarm.\n\nAnd get to bed 7-8hrs before."
                },
                {
                    "author": "kickyourfeetup10",
                    "text": "This is a two fold problem. There’s those that *want* to wake up earlier to squeeze in exercise, reading, journaling, etc. and then there’s those that *need* to wake up earlier just to avoid being rushed and late. Start with the latter. Get out of bed by 7:30 to have more calm in your mornings. Once that’s your new norm, you can start trying to wake up earlier (if you want) to maybe take the dogs on a nice walk to start the day."
                },
                {
                    "author": "snicker-snackk",
                    "text": "Rehearsing the habit is what worked for me. I would recite \"Eyes are open, feet on the floor\" over and over, and I would spend time pretty much rehearsing how I would wake up. I would set my phone's alarm to go off while I was in my bed, and actually go through the steps of eyes open, feet on the floor, lights on, go out to the kitchen and get a drink of water, then step outside for sunlight. Then I would go back to my bed and set the alarm to go off and rehearse it again. I did this a handful of times a day until it just became a habit and it's what I do automatically right when my alarm goes off now"
                },
                {
                    "author": "Enjoy_the_pr0cess",
                    "text": "sleeping early"
                },
                {
                    "author": "Serious_Doughnut9505",
                    "text": "Sleeping early makes you wake up early"
                },
                {
                    "author": "RepulsiveDog6478",
                    "text": "Not even joking, have a kid."
                },
                {
                    "author": "Novel-Position-4694",
                    "text": "as soon as i wake.. i do 3 rounds of Wim Hof breathing then into a 3 minute cold plunge.. .EVERY morning... this feels like an instant shot of coffee on steroids"
                },
                {
                    "author": "Tega89",
                    "text": "Yes, I always pick out my cloths before I go to bed. I set early meetings so I’m forced to be up early."
                },
                {
                    "author": "_serene_sophie",
                    "text": "A change in diet and intermittent fasting worked for me. \n\nNow I don't even need an alarm. I wake up super early full of energy."
                },
                {
                    "author": "Magnolia256",
                    "text": "Sleep with the windows open every night in a room facing the rising sun. You will start waking up earlier and you don’t have to try",
                    "replies": [
                        {
                            "author": "ilikehorsess",
                            "text": "But the sun doesn't reach my house until 8 am in the winter :(",
                            "replies": [
                                {
                                    "author": "Magnolia256",
                                    "text": "In India they say to sleep with your head towards the east, northeast or north. Someone told me northeast is best. That also helps tune you in to the natural rhythms of earth. I feel like shit when I don’t."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Vegetable_Test517",
                    "text": "The dog’s excitement makes it so you lounge in bed for four hours after waking up?? I’m so confused."
                },
                {
                    "author": "JensenGamaba",
                    "text": "Sleep early"
                },
                {
                    "author": "Civil_Inattention",
                    "text": "Alarm clock across the house on max volume. You’re forced to get up, walk over, and turn it off."
                },
                {
                    "author": "the0dosius",
                    "text": "Go to bed early\n\nSleep hygiene\n\nLess caffeinated drinks"
                },
                {
                    "author": "s_ndowN",
                    "text": "No snoozes is the biggest key for me. I know it sounds scary, but ONE alarm only. If you wake up to your alarm, your mind will know it’s a risk if you don’t get up."
                },
                {
                    "author": "Significant_Bit_2789",
                    "text": "IMO, the key to wake up early is to go to bed early. You should  plan for 8hrs of sleep, get to bed accordingly."
                },
                {
                    "author": "pinndu",
                    "text": "Tea sounds good!   Gotta check it out"
                },
                {
                    "author": "ProfessionalFun681",
                    "text": "A sleep tracker. Before I got my oura ring I was someone who hit snooze until the last minute.  But now I see it as kind of a game to get the highest sleep scores I can get,  I often wake up 30 minutes to an hour before my alarm goes off and I'm wide awake."
                },
                {
                    "author": "slowraccooncatcher",
                    "text": "i use nfc tags to automate some smart home devices so i can scan my phone and things start up and i don’t have to bother thinking about waking up and doing all that. ive considered getting automatic blinds to wake me up with bright sunlight but it seems indulgent of me to spend my money on it rather than just trying to wake up. i do make sure my room is dark and in ideal condition for me to fall asleep like using the humidifier and closing the blinds so i get good sleep so im not as groggy in the am. \n\neveryone’s bodies are different but supplements with inositol and methylsulfonylmethane have helped so much with brain function. i lost my dad 1.5 years ago and have been coping with grief & added stress with figuring out stuff for my family. felt like i was not really in my body and could feel my grey matter in my brain making it tough for me to stay alert during the day. but since taking this and NAD+ i definitely feel a difference. who knows if it’s placebo but ill take it. makes my day much easier."
                },
                {
                    "author": "walkerlucas",
                    "text": "Go to bed early."
                },
                {
                    "author": "Jesse_berger",
                    "text": "A roomba on a 5am schedule. \n\nI live in a studio so it kind of works for me but there's no worst way to wake up then the sound of a vacuum clearing itself. \n\nI also used Freedom app to block the iRobot app at 5am so if I must, I have to get up and turn that thing off. It sucks, I hate it."
                },
                {
                    "author": "Due-Focus-814",
                    "text": "turn on multiple alarm clocks and place them in different places away from the bed 🤝"
                },
                {
                    "author": "Silent_Ad3625",
                    "text": "Don’t snooze your alarm. \n\nSeriously, set it up without a snooze option and count back from 5, then get out of bed. Don’t hesitate. Don’t linger in bed more than the 5 seconds needed to get out. Don’t overthink it, don’t grab your phone - just get up and out of bed. \n\nI am someone who loves slow mornings and could stay in bed forever. I still get my slow mornings but I’m no longer lethargic now.\n\nOh and like others have mentioned, big glass of water upon waking and delayed caffeine."
                },
                {
                    "author": "Few-University3735",
                    "text": "Try to go to bed and wake up at the same time every day, even on weekends. This helps regulate your body’s internal clock."
                },
                {
                    "author": "gekstarjumper",
                    "text": "You just need to get up. You can feel like garbage and all. Just relax, move slow but get up. That extra snoozing will do you zero favours, and will just make you groggier. Also trying to train your digestive system to function on the same schedule, you’ll naturally want to wake up lol."
                },
                {
                    "author": "seliro",
                    "text": "I Just fixed my sleep routines by fasting.\nI tried everything mr.huberman says but it didn't work for fixing just for maintainance of a good schedule.\n\nFast for 16 hours by the time you wanna wake up, 12 should work too. I'm Right in between since I stop eating at 16:00 pm and then get a rich breakfast.\n\nPeople use this technique to defeat jet-lag too. \nAll the best mate"
                },
                {
                    "author": "bucknast",
                    "text": "I got a vibrating wrist band alarm watch thingy and it was my game changer. No more waking up to loud alarm sounds. Just a little nudge on the wrist to wake up to now. My partner sleeps right through it and I can start my day.  I was a habitual night owl, regularly up to 2-3am or later. Even when I tried to go to bed early I couldn't. I had to start waking up early regularly to make the shift. After a few weeks it started to feel more normal and now I usually wake up just before my alarm goes off anyways.",
                    "replies": [
                        {
                            "author": "AvocadoGhost17",
                            "text": "Link please? I’m intrigued"
                        }
                    ]
                },
                {
                    "author": "grungy-rattata",
                    "text": "Sleep early"
                },
                {
                    "author": "CrypticApe12",
                    "text": "Go to sleep earlier"
                },
                {
                    "author": "[deleted]",
                    "text": "[removed]",
                    "replies": [
                        {
                            "author": "PhaidraBR",
                            "text": "Hi GPT. No, you can't have Karma :)"
                        }
                    ]
                }
            ]
        },
        {
            "title": "I don’t like any job, what do I do?",
            "author": "2N2ptune",
            "text": "I’m 22 and this last two and a half years I’ve been studying multiple online courses from universities around the world from home. I’m learning a lot but tbh I don’t really like any of it.\nIm currently studying machine learning (AI) bc I think it’s the future but when I think about getting job and having to work multiple hours a day for the rest 40-50 years of my life I just get all depressed.\n\nI used to like aerospace engineering but being honest I just don’t think I’m smart enough for that.\n\nIk that if I try to go against this normalized system of having to live to work I’m just gonna get called a bum but I just really don’t wanna do it. Call me childish but I honestly just wanna have fun lol\n\nWhat should I do?",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "Reasonable_Sea8497",
                    "text": "Most people don't like their jobs. If you don't like any job just pick anything that will make a lot of money, try to retire early.",
                    "replies": [
                        {
                            "author": "Honest-Yam-271",
                            "text": "And what would tht be I still want a degree",
                            "replies": [
                                {
                                    "author": "Reasonable_Sea8497",
                                    "text": "Depends on what you like or what you dont hate. For example, if you are good at math, you should go for an engineering degree they make decent money. Medical or Law school but that will take a lot work and time."
                                },
                                {
                                    "author": "TheMexican_skynet",
                                    "text": "Computing engineer is at a low, but makes the big bucks. Geologists, Petroleum engineers also make big money, but the job market is cyclical and you have to play your cards right.\n\nChemical or electrical engineers bank good money as well, but the degree is the hardest. Job market is very stable (depending on your field of course). Lastly, mechanical engineering makes good money, is stable, and it is one step down in difficulty from the previous two. It still is hard though, so don't expect a walk in the park. \n\nI graduated as a mechanical engineer in 2018, and by 2020 I was already making 100k."
                                }
                            ]
                        },
                        {
                            "author": "TwoOhFourSix",
                            "text": "But why is everyone living like this? Why spend your entire life doing something that makes you unhappy? With such limited time on this planet this entire way of doing things doesn’t make any sense.\n\nEdit : Once there was a world no one thought could exist beyond feudalism.",
                            "replies": [
                                {
                                    "author": "SparkyGrass13",
                                    "text": "See my comment below, I’ve been successful and have not lived this way. People resign themselves to one thing it doesn’t have to be that way"
                                },
                                {
                                    "author": "Reasonable_Sea8497",
                                    "text": "Why live like this? Because not everyone has the luxury to dedicate their life to something that makes them both happy and money. Some people have families to support and responsibilities to manage. But if you have the time and means to pursue your dream job or what truly makes you happy, go for it."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "namecheckssoutt",
                    "text": "This person is asking for advice, be kind."
                },
                {
                    "author": "Claudio23071993",
                    "text": "It's okay to feel overwhelmed at 22 when thinking about work—it’s a big step. However, working is more than just a necessity; it’s a chance to learn, grow, and build your independence. Earning your own money for the first time, buying things for yourself, and saving for your future feels incredibly rewarding. Sure, the thought of committing to a job can be intimidating, especially when you're unsure of what lies ahead. But often, the experience is more fulfilling than you expect. You meet people who make the day-to-day enjoyable, and they can inspire and support you along the way.\n\nInstead of focusing solely on passion, consider what skills or opportunities provide the most economic benefit and financial stability. Once you gain that foundation, you'll have the freedom to explore hobbies or passions more freely. Starting small can lead to unexpected paths, and those first steps might just surprise you.",
                    "replies": [
                        {
                            "author": "2N2ptune",
                            "text": "That’s actually pretty good advice, thank you :)"
                        }
                    ]
                },
                {
                    "author": "MagnanimousMJ",
                    "text": "If you can travel go get some of that out of the way now, if you have no money for that, get a job to afford the travel. Work part time, do school full time- really helps you appreciate what you do have. Also helps your people skills if you’re just doing online learning, we’re social creatures and need to socialize."
                },
                {
                    "author": "Bust3r14",
                    "text": "Mood."
                },
                {
                    "author": "Failed_Alarm",
                    "text": "Adjust your expectations. One does not work 'for fun' usually, but to gain income.  If you don't like any job, choose work you hate the least.  \nIt's perfectly possible to have a lot of fun outside of work hours. Having stable income enables you to do more fun things."
                },
                {
                    "author": "piqueseven",
                    "text": "a boring job can be fun with the right people and a supposedly exciting job can turn into a shitshow with the wrong people. its not always about what you do. \nthere are so many possibilities that you never heard of. the only way to find out whats best for you is to go out and try many different things. look for inspiration. the first thing that needs change is the narative."
                },
                {
                    "author": "mylittlelovesmom",
                    "text": "Start a business get to a point you can retire early work harder for yourself in the beginning to have a more comfortable life down the road"
                },
                {
                    "author": "devoteean",
                    "text": "I recommend Scott Adam’s book on how to Fail at everything. It’s written for someone in your position.",
                    "replies": [
                        {
                            "author": "eternus",
                            "text": "I mean, screw scott adams, but I imagine there are some useful bits in there."
                        }
                    ]
                },
                {
                    "author": "ChildhoodOld9798",
                    "text": "Work for a nonprofit provinding direct aid. It feels fun and novel so I don’t have to motivate myself to start tasks and struggle with feeling lazy like I do with everything else",
                    "replies": [
                        {
                            "author": "yellowstriped",
                            "text": "How did you start your career with your nonprofit? And if it’s not a privacy concern, what’s your job title? I’m trying to broaden my job search and Ive been thinking about nonprofits lately"
                        },
                        {
                            "author": "Legal-Ad-1090",
                            "text": "I’m intrigued as well"
                        }
                    ]
                },
                {
                    "author": "calltostack",
                    "text": "22 is still super young. Save up some money and go travel!\n\nThe 20s are for exploration, the 30s are for building, and the 40s are for leaving a legacy.\n\nMost of us never even go through that exploration phase, and that's what leads to midlife crises in the 40s.",
                    "replies": [
                        {
                            "author": "2N2ptune",
                            "text": "I’ve been thinking about doing a working holiday visa to Japan this last couple of years, only thing holding me back is that I have a really good relationship with my family and I don’t wanna leave them for a year.\n\nShould I just go for it or should I wait a little longer?",
                            "replies": [
                                {
                                    "author": "calltostack",
                                    "text": "If it's family that's holding you back, it's better to do it while you're younger.\n\nI went traveling full-time when I was 26 and I only wish I started sooner because my parents are now getting old and I wish I spent more time with them.\n\nAnyway, I now live abroad full-time and my relationship with my parents and family is better than ever because I only have gratitude for them now and savor every moment I do spend with them (6 weeks out of the year)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mcbranch",
                    "text": "Depends on what standard of living you want.  I worked as a whitewater river guide over summers in college and worked with quite a few that guided in the summer and worked at the ski area in the winter.  \nThey lived in their vans, and there was no way of improving that in the jobs they had, but they had fun and seemed happy enough.  \nI also had a buddy that got scuba certified and traveled around and led scuba trips.  \nIf you don’t care about being broke and living with a bunch of mates or in a van/tent, go out and do something fun!  \nIf after a few years you want some more stability, maybe you will have a more focused path to go on."
                },
                {
                    "author": "kyuuei",
                    "text": "1. Not all jobs Feel like jobs--but the ones who pay typically do.. So, finding a balance between that \"is fun\" and \"pays well\" ratio is important. Work is good for the mind, the body, and the soul, especially when there are fulfilling components. You're at an age where reality hits hard, and this is a Very normal feeling... but don't come at it like work all sucks. It really doesn't. There are days I go complain about work.. and there are days I go home, feeling like I Actually helped someone with their life. From helping make someone's life easier to making them laugh, there are jobs of All kinds out there that are NOT the typical 9-5 slog. Some people do seasonal work, some people do work where they travel often, some people work from home... there are All shapes of jobs out there. \n\n2. You are never Stuck in a job. If you plan your life properly, and have contingency plans, you won't be Trapped in a gig. And that's important. Knowing you are Choosing to stay at a job helps tremendously. That means some important wise things--not taking on massive debts, having savings and back up plans, not spending beyond your means, etc. Still.. The idea that if my boss did some great injustice to me I could walk away Today is important. You may decide to live with roommates to make rent cheaper, to not get tons of take out to eat up the money you were working hard to spend, etc. \n\n3. Some people find their calling.. Some people Don't. If you are like me and never found a job that was your True One Career Love and angels didn't blow trumpets the moment you were hired somewhere.. sometimes you find jobs you Like enough and fit into your lifestyle well. This is what I did. I like having autonomy, I like high pay, I like Not being management, I like having co-workers in the moment and leaving work at work. I work part time, so the high pay balances out to what someone working a 9-5 would make full time. My job didn't require tons of college debt. This affords me the ability to travel often, have fun on most days of the week, and not feel burned out spending my whole life at work. It is possible."
                },
                {
                    "author": "-FrankenBerry-",
                    "text": "I like my job, but the only reason I do it is for the money.  You work to live and the best you can typically hope for is that you don’t hate it."
                },
                {
                    "author": "vampwerewlfluvchild",
                    "text": "Same dude but I can’t afford to not work 🥲 I feel like as you get older you start to realize a job is just a job and you’re there to earn a check towards the things you actually like or want to do. If you find something you can at least tolerate doing everyday it’s not so bad. And you can always change careers, don’t feel like you have to stay anywhere. Maybe you could start your own business?"
                },
                {
                    "author": "blisterdesibilla",
                    "text": "Society is built to produce, even if you worked on what you like, there would come a time when, due to the obligation to do so, it would end up being something tedious.\n\nUnfortunately, in general terms it is unlikely to work on what you like, the most viable thing is to work to be able to do what you like. \n\nOurs is a sad reality."
                },
                {
                    "author": "SparkyGrass13",
                    "text": "I’ve thoroughly enjoyed all of my jobs. I messed around with uni etc but it didn’t suit me so  I started as a fitter and turner (engineering trade), I moved into leadership because I wanted to try that, I tried maintenance reliability because I wanted to try that and now I am studying math and computer science at uni while working developing systems to help a company manage their maintenance processes.\n\nAnyway all I am trying to say is don’t stress about what is the future of work, experiment with a variety of things that you actually have an interest in, life is short but also long enough that you can change as you grow and grow bored or apathetic towards what you are doing. \n\nThe only thing I see different in myself and my peers that hate their jobs is they believe they are stuck with the choice they made when they were younger.",
                    "replies": [
                        {
                            "author": "broadwaylamb13",
                            "text": "How old are you and how did you go back to school? Masters ?",
                            "replies": [
                                {
                                    "author": "SparkyGrass13",
                                    "text": "40 and nope back doing bachelors. I’ve just followed my interests and due to actually being interested in what I do and having a passion for it as I have been doing it I have earnt a lot of money, hit 6 figures mid 20s doing my trade and just grew from there. My annual earnings would grow, I’d feel bored or stagnate so I’d change and yes my income would drop a bit but it stayed above baseline due to the unique experiences I’ve been able to bring to roles and it would grow again from there\n\nEdit, my current role lets me set my own hours, finding someone with trade and leadership background who is also able to solve networking issues, communication issues and program tailored solutions to needs they see in you’re systems is admittedly very rare, as I said most people just pick a job end up hating it but do nothing to change, it’s insane."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lostXmoon",
                    "text": "Going by what you said about wanting to have fun, my suggestion would be to find a job at the most fun place in your area, such as a theme park, amusement park, aquarium, zoo, concert venue, museum, etc. These jobs typically will have multiple types of positions that work behind the scenes to keep the operation running, such as marketing, accounting, HR, inventory, etc. You could start at the bottom and learn the ropes to work your way up into a better paying position. I too want a job that doesn't \"feel\" like a job, and placing myself in a vibrant and lively place with happy energy seems like the best fit for me. I also don't need tons of money to survive, living in a low cost of living area, so this idea may not be helpful for you, but maybe it'll spark some ideas."
                },
                {
                    "author": "bagelbites29",
                    "text": "It’s amazing how people just don’t understand this concept. I’m a little older than you and, while it has been easier lately, the concept of being subservient to a corporation’s and manager’s goals for 8 hours a day every single day is still absolutely soul shattering. Not only that but if you work normal hours, you can never get anything done when you get off because all the important places are closed early and not open on weekends. 8 hours of work is just enough to kill your motivation to do anything for yourself outside of work too.\n\nIn my opinion, the work system is a scam built to ensure the working class never challenge the higher class.\n\nHowever, opinion aside, what I know is all of us are different and some of us are predisposed to want to be independent while others feel more comfortable being subservient. That’s okay. You have to play on your characteristics as a person. Don’t try to shove yourself in a box that you don’t belong. Trust me, it will not work out great for you.\n\nBeing a “bum” is a construct of society. What it really boils down to today I think is being chronically unproductive or without dreams or goals of any sort at all. Or in the literal sense maybe you are out on the street. You are none of those. You’re just a little confused and lost and that’s okay.\n\nSo how do you fix? Well, there is no easy answer, but it seems like you are already on that path. Explore different areas of learning to see what sticks out to you and just keep increasing your overall knowledge. Spend mindful time with yourself and don’t be hard on yourself as this will help you discover aspects of yourself that may not have been obvious before. Play to your strengths, not your weaknesses. Forcing yourself to work a full time job is a big ask when it’s not meant for you. Maybe you’d be better suited working that full time position at a company where you are your own boss and make more decisions for yourself. Or, start working on a project that you love that you think could make money eventually. Don’t pressure yourself to do this or you’ll burn out on your dreams. Eventually that passion project might make some money and then you do another and another and eventually you may even be completely self sufficient if you play your cards right.\n\nLastly, depression is actually a good thing and it took me a long time to understand this. It is telling you something is wrong. Something you are doing doesn’t line up with you or your values. Explore that feeling, don’t distract yourself from it. You may come to a very profound conclusion about what you want in your life that only you could ever know and not a bunch of strangers online.\n\nGood luck",
                    "replies": [
                        {
                            "author": "2N2ptune",
                            "text": "Thank you man this helps a lot"
                        }
                    ]
                },
                {
                    "author": "eternus",
                    "text": "Just to call out the elephant in the room... you're starting with some limited mindsets. For whatever reason, you have it in your head to give up before you begin. You're not alone.\n\n**\"not smart enough for aerospace engineering\"** \\- There are tons of geniuses that can't hold a job because they rely only on being smart. There are even more 'average' intelligence people who just commit to something and follow it through to success. It's not your intelligence that limits you here, its your commitment.\n\n**\"go against the normalized system\"** \\- there's more than one way to skin a cat, and there isn't just one 'right way'. The normalized system, especially today, is literally becoming a slave. Once you're locked into a career at a corporation, you get locked in and dependent on their salary/benefit package and at the mercy of their bottom line.  \n  \n**\"get called a bum\"** \\- do you need to own a house in the suburbs and have 2.5 kids? do you need a 40 hr a week job at one company for the next 40 years? While I'm not advocating for you to couch surf til you retire, I'm suggesting that peak performance, or peak productivity are just a byproduct of trying to keep up with the Joneses. You don't NEED to produce, productivity (even this subreddit) is toxic. You're young enough to be picky, especially if you have the luxury of free rent with your parents still. \n\nScrew the people that call you a bum... find something that you get excited about and chase that. If you think machine learning is interesting, learn it to learn it, at least you'll be able to respond to the changing culture as we move forward.\n\nIf you're lucky, you have a brain that can let you commit and stay focused, so all you need to do is pick the direction. \n\nUnfortunately, from your description suggests you either have ADHD, or have fallen into the attention black hole that can come with being always online. That'll take some extra effort on your part to overcome, but it's also doable.\n\nLiterally, the best thing you can do is learn to get mindful about yourself, your life, your wants and needs, and to find a way to look for opportunities and to be optimistic.",
                    "replies": [
                        {
                            "author": "2N2ptune",
                            "text": "That’s some really good advice, thank you man\n\nBtw I do have adhd it’s crazy how you managed to catch that lol"
                        }
                    ]
                },
                {
                    "author": "Seibitsu",
                    "text": "Piece of advice: you wont really know if you like a job until you have been a couple of months working on that. I studied to be a Vet and recently started working on an hospital; I expected to fully LOVE the job but on the end is not as ideal as I expected so pick whatever vibes with you the most, life changes constantly and It is okay to not pick the perfect carreer."
                },
                {
                    "author": "uniformsquirel",
                    "text": "I think you should try to learn about stuff your actually interested in that and try to have some fun. Go for a hike or just relax at home whatever is fun to you."
                },
                {
                    "author": "Richsiropcoaching",
                    "text": "You’re so young and you don’t have anyone counting on you to support them. Think of any job, hobby, class you have taken. Begin to make a list of the things about that job you liked. Then search jobs that involve those activities. Do you like to be at a computer or on your feet? With people or not? Are you numbers driven?"
                },
                {
                    "author": "dariuslloyd",
                    "text": "Go to nursing school. Not joking. You can figure everything else out later.",
                    "replies": [
                        {
                            "author": "lollypolly5455",
                            "text": "facts"
                        }
                    ]
                },
                {
                    "author": "AdventurousYak2468",
                    "text": "Welcome to the real world where you have to work and earn. Everyone hates their job at some point in the week, month or year. Give it time and once you get settled into your job, you’ll be fine. Earning a degree is one thing and applying it in a job is a whole another. Give it time."
                },
                {
                    "author": "Ornery-Worldliness96",
                    "text": "So if you don't get a job then how do you plan on getting money? It's okay to change your mind about what field of work you'll do, but you still have to do something. Since you're still very young maybe look into the FIRE movement. The idea is you earn as much as you can and invest as much money possible so you can retire early. ",
                    "replies": [
                        {
                            "author": "2N2ptune",
                            "text": "I’m applying to multiple jobs everyday, I know getting a job is important and the second I get an interview I’m gonna go for it, but my problem is that I don’t wanna live my next 40-50 years doing the same thing almost everyday."
                        }
                    ]
                },
                {
                    "author": "Prudent-Fruit-1776",
                    "text": "I think that's why you should have a life outside work, or something you enjoy doing in your free time, working can't be your source of happiness, rarely is, maybe only the ones whose jobs save lives or are fun like biology, etc. but most fields are boring and unfulfilling"
                },
                {
                    "author": "Expert-Ship-7480",
                    "text": "It’s completely normal to feel this way. But, learning something in school and applying it in real life give different sensations. Normally, I find project management boring in theory when you are getting courses, but in real life, it’s totally different. You need to engage with people, understand emotions, problems and etc. \nApplying machine learning in your home machine is a limited experience. To implement it in a company environment with complex dependencies which solves real problems of users can give a totally different sensations. So, you will never really know if you like it or not in real life, without trying."
                },
                {
                    "author": "Makismalone",
                    "text": "I’m currently finishing up my degree in computer science and got into it for reasons similar to yours. Initially, I thought it would just teach me how to code better and land an in demand job. I couldn’t have been more wrong.\n\nWhat I’ve discovered is that it’s about so much more than just writing better code. I’ve learned things I never expected about computer science itself, but also about people. Once I understood the structure of programs (albeit likely much simpler than the ones industry professionals work on), I began to see people differently. In a way, we’re like programs, each of us is a package containing classes that define who we are and objects that shape our unique abilities and challenges.\n\nTo someone unfamiliar with programming, a crashing program might seem like a failure. But to a programmer, it’s just a bug waiting to be identified and fixed. I’ve started applying this mindset when talking to friends who are working through personal struggles. Often, when we trace back the “bugs” in our lives (patterns or issues we face repeatedly) they stem from something rooted in our early experiences.\n\nIt might sound oversimplified, but I believe the simplicity is what makes this perspective powerful. For instance, I recently had a four hour conversation with someone I’m very close to. At the time, they were spiraling emotionally without understanding why. Over the course of the conversation, they let down their guard and became vulnerable. They shared that they constantly felt the need to achieve more and couldn’t relax, but they didn’t know where that feeling came from.\n\nWe started tracing the pattern back through their life and pinpointed its roots in their childhood, right after their parents divorced. Around that time, they moved into their parent’s new partner’s house and had to share a room with a sibling, while the partner’s children had their own rooms. They always felt a divide in how they were treated, which planted a belief that they weren’t good enough. Once they connected those dots and viewed it from their adult perspective, they were finally able to let go of the pain they’d carried for years.\n\nThat conversation happened four months ago, and they’re now a completely different person in the best way. They still face challenges, but they’ve developed tools to regulate their emotions and navigate life more effectively.\n\nThis might not directly answer your question, but I hope it offers a different perspective. Sometimes, the understanding we gain from our field of study can unexpectedly help someone else work through a deeply rooted issue. A single conversation can shift someone’s trajectory in life, offering rewards for both parties that go far beyond what we typically expect from our day to day work."
                },
                {
                    "author": "Real_Ad1528",
                    "text": "It sounds like you might be feeling a bit lost or overwhelmed. It's okay to not have it all figured out right now. What you're going through is something a lot of people experience, especially at a young age"
                },
                {
                    "author": "Gootchboii",
                    "text": "If you don’t like anything just pick what makes you the most money for the same hours. Might as well get compensated"
                },
                {
                    "author": "altafteraltafter",
                    "text": "find something you love and try to build a business w tgat shit honestly, i feel you 100%"
                },
                {
                    "author": "Available_Serve7240",
                    "text": "Find something you're good at and pick that job. Truly. People are usually only good at a handful of skills while mediocre or even bad at a thousand others. In this very common dilemma, the wise thing is not to compensate for your weaknesses, but to improve your strengths. A job like that will come easier to you, you will have more time/energy to focus on things outside of work, you will enjoy your workdays more as well, meet similar people who you'll like spending time with, always grow professionally, see a clear path forward with goals and achievements waiting for you."
                },
                {
                    "author": "2N2ptune",
                    "text": "I forgot to say that I’m currently applying for jobs almost everyday. I know I need to get a job and I’m gonna get one asap, my problem is that I don’t feel excited or happy about it at all, even tho I’ve studies a lot I don’t feel motivated to apply that knowledge I’ve acquired anywhere"
                },
                {
                    "author": "crazybutthole",
                    "text": "You could find a wealthy benefactor and become their sex toy. \n\nYou could join a convent or monastery and become a monk or a nun \n\nYou could join the military - it's more than a job it's an adventure. \n\nYou could become a prostitute if you move to a state where it is legal. \n\nIf you have an insane amount of luck you could become a gambler or trade stocks.\n\nIf you enjoy driving - you could be an Uber driver - it's kind of like work but it's not that bad if you don't mind driving for a long time. \n\nI think that's about it. Most other legal ways to make money include getting a job."
                },
                {
                    "author": "BIM2017",
                    "text": "Amphetamine and modafinil my fren"
                },
                {
                    "author": "HerezahTip",
                    "text": "Welcome to being an adult. No one really *likes* their job, unless the are their own boss."
                },
                {
                    "author": "TheProdigalSon26",
                    "text": "It is normal (maybe) but I was like you, didn’t know what to do. So for one year I started reading books, learned to write and code, and run. As it became my habit I found that in the next decade I was well-learned, earned and made five figure money (dollars) through writing, coding, teaching, and investing. And I am in good shape compared to my peers and friends in their early thirties. Not jacked up but fit. \n\nMy advice is to give yourself time to know what you like and pursue it irrespective of what may come. There will be days and maybe years that will be extremely hard and you may lack good things. But it will be momentarily. \n\nBut as devote yourself in learning that time to make good friends who will be with you and hold you when you fall. They needn’t understand your path but they should trust you and your abilities. And for that you must be skilled in at least one thing (maybe teaching). Your talk and actions should speak on your behalf even when you don’t have anything. That is character. \n\nCharacter will take you further and open doors for you. \n\nLearn and build character."
                },
                {
                    "author": "Due-Focus-814",
                    "text": "But you can creat some amazing app with ai or something like that and live with passive income, or choice some adult industry like me 😁"
                },
                {
                    "author": "Glass_Bat2332",
                    "text": "If you can’t find something that absolutely excites you I would recommend finding a career in something you’re relatively good at or can build skills upon to increase opportunity. The labor system is dumb I don’t know many people who enjoy working 40 hrs a week. I wish it was different but you’ll figure it out we have enough time to try out some things to see what we enjoy or at least put up with. Good luck!!"
                },
                {
                    "author": "DeanaMarieLive",
                    "text": "Start your own business"
                },
                {
                    "author": "Comfortable-Pace-318",
                    "text": "Ask yourself what is your passion? What is something you are good at doing? Can it be a job? Think of things you like doing until you find one that can be payed and you can turn into a job. For me it’s always been English. And science, and dancing haha. Now I’m studying to become a professional translator, cause life brought me there i’d say. Hope this helps"
                },
                {
                    "author": "Fragrant_Mud_8696",
                    "text": "Take your ass to Gaza. You will then appreciate everything around you.",
                    "replies": [
                        {
                            "author": "Few-Metal8010",
                            "text": "He should fill his pockets with jelly jam and needle jacks and do the Hokey Pokey to realize that all along he had it real good before he starting boohogging all over the place"
                        }
                    ]
                },
                {
                    "author": "mayer51",
                    "text": "Grow up"
                },
                {
                    "author": "I_7assan",
                    "text": "don't fall for the trap of \"you must love what you do\". No one does.\n\n  \nfind something you're good at and do it, before you get older and regret not just working anything.\n\n  \nmost jobs are just sitting around and talking with coworkers.",
                    "replies": [
                        {
                            "author": "Motion_FX",
                            "text": "This is incredibly demotivating for OP - “no one does”? I absolutely adore what I do. However, I think it’s important to understand that whilst you can be incredibly passionate about your work, it’s not all swings and roundabouts. I find that the parts of my work that stress me out the most are usually the ones I love the most. Loving work is hard, hating work is torture.",
                            "replies": [
                                {
                                    "author": "Informal_Republic_13",
                                    "text": "Yeah I also love my work - basically same for decades but it has slowly changed so now the routine tasks I do all day I get satisfaction from - I know what I am doing helps people and the quicker and higher quality it is, the better it helps them. I went into something that was very demanding and not well paid but clung on and now am approaching retirement age but still in demand due to my experience.  Now advising my own offspring and I can see that something like doing banking which I would have dismissed as just exploiting customers, can actually be helpful for them- I know I have needed help with personal finances which are a mystery to me."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shadowglint",
                    "text": "Not liking your job isn't a personality. Nobody likes their job. Get over it."
                },
                {
                    "author": "That_fallGuy",
                    "text": "Yeah but that's not how the world works. Edible food doesn't simply arrive on your plate by itself, it's the result of the effort of other people combined with the effort of your money.  Two people working together, at the very least.\n\nId say it depends on what you are looking for in life. if you are looking for anything, then no other way except working to get it. If you dont like working, that sounds like you are on your way to drugs/substance addiction. \n\nPeople who drown themselves on those are the perfect example of a coward who does nothing all day but dreaming."
                },
                {
                    "author": "hickdog896",
                    "text": "You should so being entitled and lazy and expect things to be handed to you and get a job or stop complaining"
                },
                {
                    "author": "Calm_Run93",
                    "text": "\\> What should I do?\n\nGrow up. I know that's harsh to say, but at 22 it's time."
                },
                {
                    "author": "everybodyspapa",
                    "text": "Nobody has a passion for their job, nor do they always even like it. Even the people who make their own careers as entrepreneurs don't have a passion for their work.\n\nPassion comes from within you, and you bring your passion to opportunity. If you attempt to find something outside of yourself to be passionate about, you'll never find it.\n\nInstead, focus on opportunity."
                }
            ]
        },
        {
            "title": "Any cool apps you'd recommend?",
            "author": "Suspicious_Rope_2390",
            "text": "Hey there! I'd like to get some app recommendations, which ones are you using to achieve your goals? I'm not sure what I am looking for, probably something where I could track completion of my tasks, but I'm open for anything that helped you, as I have never used such apps before. Please make some noise!",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "_serene_sophie",
                    "text": "I love my A5 spiral notebook and the OBTF (One Big Text File) method the best.\n\nBut to answer your question with actual apps you could try for task management that I have used so extensively that even though I dont use most of them much anymore, I still advise people on strategies on how to use them:\n\n* **Habitica** (cross platform)- gamified habit tracker and task manager. Free and open source.\n* **TickTick** (cross platform) - fully featured task manager, calendar, habit tracker, pomodoro tracker, markdown note taker\n* **Olauncher** (Android) - minimalist text-only launcher. Free and open source. I still use this one several years later.\n* **Markor** (Android) -  free and open source text editor for local .txt files, .md files etc. Includes todo.txt format / highlighting.\n* **QuickEdit Pro** (Android) - the text editor I actually use for my single plain .txt file on Android. On the laptop I just use the default text editor that came with the operating system.\n* **SyncThing** (most platforms) - syncs my files between devices in a P2P connection.\n* **Unhook** (browser extension) - I only use Youtube for university lectures, so I block everything else with this extension.\n* **SocialFocus** (browser extension) - I only have Reddit as social media and I use this to block addictive elements of it and to set a timer to block Reddit altogether after a specific time.\n* **uBlock** (browser extension) - blocks ads, cookie notices, pop ups, and other annoyances that websites come with these days.\n* **Workflowy** (cross platform) - probably the best infinite outliner I've ever tried. Great for project management and multiple levels of tasks and subtasks.",
                    "replies": [
                        {
                            "author": "PostHocErgo306",
                            "text": "Can you say more about your one big text file? I assume it’s just one document with new entries each day. I do something similar so curious.",
                            "replies": [
                                {
                                    "author": "_serene_sophie",
                                    "text": "Yes, it's just one long plain .txt file. It has everything:\n\n* typed entries of my analog notebook's daily logs, in reverse chronological order (most recent on top, so that I can plan and see Today always at the top of the file)\n* ToDo section\n* Calendar section\n* Work section\n* Study Notes section\n* School section (for outlining modules, courses, supplemental resources etc)\n* Routines section\n* Checklists section\n* Travel list\n* Reading list\n* Notes depository (also includes scripts, terminal commands, code, web links etc)\n* Projects and Goals section\n* Shopping Lists\n* Family section\n* Dopamenu / Rewards section\n* and an Index to list all these sections, lest I forget they exist lol.\n\nWhen I need something, I just hit Ctrl + F, type the first 3 letters of what I'm looking for and I'm there. No scrolling, no further categorizing/tagging. Just search."
                                }
                            ]
                        },
                        {
                            "author": "TheStLouisBluths",
                            "text": "I though they banned TickTick. \n\n/s",
                            "replies": [
                                {
                                    "author": "ArmchairDeity",
                                    "text": "LMAO - honestly I had to do a double-take when I saw the name for exactly that reason. Maybe we should bring this up in r/Branding… 🤣🤣😅"
                                }
                            ]
                        },
                        {
                            "author": "jgreaves8",
                            "text": "+1 for Workflowy. Amazing for braindumps"
                        }
                    ]
                },
                {
                    "author": "Grey_Mamba_371",
                    "text": "1. Notion - changed my life. If you master Notion, you can forget about 90% of other apps.\n2. HabitKit - I like it. But my life is in Notion, so I’m building an integration for Notion that looks like HabitKit\n3. I like coding, so Scriptable for iPhone. Instead of scrolling, I just code lol\n4. I also like PrettyProgress for widgets. It helps to know how many days left in this cycle/semester",
                    "replies": [
                        {
                            "author": "anastasiaa3",
                            "text": "How would you recommend to speed up the learning curve for notion. I have it but I can never stick with it as there’s so much stuff going. It feels like I’m spending more time organising, then actually working… thanks :)"
                        },
                        {
                            "author": "DontTread76",
                            "text": "Why do you like Notion so much? How are you using it?"
                        },
                        {
                            "author": "Z00CE",
                            "text": "Notion is great but I found obsidian to be better for my focus. Notion takes customization to another level, and my ADD ass just ends up tweaking everything."
                        }
                    ]
                },
                {
                    "author": "Confident-Pay-4991",
                    "text": "Hey! If you're exploring apps to help track and complete tasks effectively,  here are three great options to consider based on what you're looking for. The best one for me is Todoist. It is great for managing your tasks and setting priorities and deadlines, and its monthly subscription is pretty affordable. Another recommendation is TickTick, which provides a visual calendar for planning, a Pomodoro timer for focus, and habit-tracking. Plus, they offer a free plan available. Maybe you can try them and see which works best for you."
                },
                {
                    "author": "AccomplishedBid495",
                    "text": "Finch",
                    "replies": [
                        {
                            "author": "why__meee",
                            "text": "I just got finch 8 days ago! A cute way to get me to drink water and take a walk"
                        },
                        {
                            "author": "99TLM",
                            "text": "I'm obsessed with Finch!"
                        },
                        {
                            "author": "dandelions4nina",
                            "text": "Came here to say finch."
                        }
                    ]
                },
                {
                    "author": "stawwp",
                    "text": "I’ve found barriers to distractions that are hard to turn off to be the most helpful.\n\nI currently use “brick”, which requires a one time purchase of a physical device. I like it a lot and it’s been my #1 productivity hack but it’s glitchy and doesn’t work for my laptop. I combine it with a physical timed lockbox when I’m at home.\n\nI’m going to experiment with “freedom” soon. It requires a subscription plan to actually prevent you from turning it off which I hate, but I’m hoping it will be easier to use and that it’ll solve my problems with getting distracted on my computer.\n\nIf anyone has any better screen time apps I’d appreciate suggestions.",
                    "replies": [
                        {
                            "author": "Suspicious_Rope_2390",
                            "text": "These ones sound very interesting!"
                        }
                    ]
                },
                {
                    "author": "HerPathForward",
                    "text": "Could be a goal tracker- but Trello helps with planning and tracking goals."
                },
                {
                    "author": "Goldio_Inc",
                    "text": "If you want to achieve your goals then I would definitely recommend the Achieve! Earn Your Screen Time app on iOS.\n\nYou set your goals for the day then as you complete them you earn screen time. This is great because it not only helps you track completion of goals but also blocks you from getting distracted and procrastinating before you finish them."
                },
                {
                    "author": "savvyleigh97",
                    "text": "I started using Roots lately to help with my screentime and social media habit (addiction?). It has been great as someone who has tried multiple different screentime apps. You can get discounts as a student or for financial reasons, but they will also extend your week-long free trial for a month if you cancel and want more time to test it out. They have one metric called \"dopamine hits\" which I found helpful because it illustrates the impact of specific apps (social or games) compared to more standard apps like safari or mail. Highly recommend it to anyone who struggles with their device use impacting productivity.",
                    "replies": [
                        {
                            "author": "TurbulentAmphibian96",
                            "text": "I had roots and then went back to Opal, I found it was less glitchy. Opal has been good for me.",
                            "replies": [
                                {
                                    "author": "savvyleigh97",
                                    "text": "Oh yeah, that seems like a great option too. More pricey than Roots from what I can see, but Roots definitely is glitchy at times which I could see being frustrating over time"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Z00CE",
                    "text": "Ok so I have been around the block with apps, and for me less is more.\n\nFantastical - Calendar that hooks into my outlook for work and personal so I can look at all my calendars\n\nOffice 365 - no need to explain, for 5.99 a month you get a TON of tools. Seriously, if you want bang for buck do this.\n\nObsidian - learning curve for sure, but its UI is simple and easy for me to concentrate.\n\nNextUp - this is one that is a super customizable timer, I use it with my Apple Watch to have a recurring vibration every 30 minutes to remind me to be present. \n\nYouTube for learning and other videos \n\nCoursera, LinkedIn Learning, or another learning platform for upskilling (some are better for certain subjects etc)"
                },
                {
                    "author": "Luanara_101",
                    "text": "Someone here suggested focumon (from pokemon). Playful way to get things done. I use it for 2ish weeks now and since it has the Playful thing, I stuck with it. I am at Level 11 now. 😄"
                },
                {
                    "author": "SweetProduct2512",
                    "text": "Brite!"
                },
                {
                    "author": "thattallgirlx",
                    "text": "I love Toggl track for tracking my work and apple reminders for my todos & shopping. Nothing worked for me when it comes to task management before and the simplest solution is the best for me. I have one list with several categories and I love it"
                },
                {
                    "author": "Broad_Animal_8591",
                    "text": "todoist is the best app ever for keeping track of tasks, i have the free version, and it helps keep me super on track, i recommend it to everyone i know, and they've all loved it"
                },
                {
                    "author": "kyabhasadhai",
                    "text": "The gratitude app!"
                },
                {
                    "author": "Accomplished-Wind302",
                    "text": "ScreenZen!!! SAVED me",
                    "replies": [
                        {
                            "author": "TurbulentAmphibian96",
                            "text": "I liked this one, still have it actually in case I switch back. Ended up using Opal long term."
                        }
                    ]
                },
                {
                    "author": "gendr_bendr",
                    "text": "I like Habit. You set habits and track them. Everything is very customizable in terms of frequency and duration. The app will also show your average compliance across all your goals. \n\nIt is free for a limited number of habits (I can’t remember how many). There is also a premium membership that is only $4 for lifetime access. Then you can have unlimited habits."
                },
                {
                    "author": "atticus_roark",
                    "text": "Things, bear and Google calendar as a pwa. Done"
                },
                {
                    "author": "GoomiBare",
                    "text": "Blitzit - task management and ADHD wrangler \n\nTwos - brain dump and on the go notes and family collab\n\nFabric - digital file cabinet\n\nMe.Bot - all of the above and a friend/therapist that knows you\n\nTana - Suped up note taking, meeting agent, AI enabled productivity tool. Better than Notion and Obsidian IMO.\n\nLimitless - agentless meeting agent (also see Krisp)\n\nText Cortex - AI RAG type tool. Create different personas and knowledge basis to enhance the AI\n\nFlowSavvy - AI auto scheduler (see also Reclaim)\n\nArc Browser - better Internet browser (for now) \n\nBiscuit browser - used as a second screen web tool manager \n\nShortwave - AI native email manager that blows Superhuman out of the water, and is half the price \n\nBricks - AI Excel. Basically tell it to do everything for you and it works\n\nToggl - time tracker. See also Rize and Work Status \n\n\nCurrently testing: \n\nLiftOS - workspace manager and project management software\n\nHuly - open source project management software \n\nHighlight - AI tool that can read your screen \n\nMake.Today - productivity page that you can put a bunch of widgets on\n\nRoomo - saw this on Reddit the other day and I like it so far. Similar to Make Today with fewer features, but a lot cleaner.\n\nFindr - kind of like Fabric but with more integrations and focused on AI and search. Less effective than Fabric at the things Fabric has though.\n\nWill update more if I can remember later."
                },
                {
                    "author": "Academic-Spread8477",
                    "text": "awesomehabits"
                },
                {
                    "author": "Honeysicle",
                    "text": "Youversion bible app is great. It doesn't help me achieve goals. It helps me see areas in which I can be more humble. It helps me see where I can trust God more.\n\nThen God changes me. He causes me to achieve goals.",
                    "replies": [
                        {
                            "author": "Brobothecowboy",
                            "text": "We don’t need god We need AI jesus to tell us which apps help us for increasing productivity",
                            "replies": [
                                {
                                    "author": "Honeysicle",
                                    "text": "Al isn't Jesus, he's just Tim the Tool Man's trusty sidekick 😏"
                                }
                            ]
                        },
                        {
                            "author": "destoret_",
                            "text": "Bruh",
                            "replies": [
                                {
                                    "author": "Honeysicle",
                                    "text": "Dude"
                                }
                            ]
                        },
                        {
                            "author": "VolumeMobile7410",
                            "text": "Give yourself credit. You achieve your goals. No god is up there helping you.",
                            "replies": [
                                {
                                    "author": "Honeysicle",
                                    "text": "Do you believe truth is subjective? As in it's my truth for me and your truth for you. As in you decide what is best for yourself"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hot_Rush6416",
                    "text": "1) ByDesign app changed me life. It's sort of like Notion and Google Calendar combined.  \n2) Obsidian for note-taking.   \n3) Chat GPT of course :)"
                }
            ]
        },
        {
            "title": "Summarizing books are not a productivity hack",
            "author": "livenoworelse",
            "text": "Summarizing a book is not the same as reading a book. Know that these productivity hacks circumvent the actual work that makes this activity valuable and is not a productivity hack unless all you care about is very surface level \"knowledge\". Reading a real book takes time and is a challenge. If you purely want to get the information or the top 10 lessons then by all means. Long form text like a book is not meant to be shortened. If it's a real book you get sensory information such as touch (the cover, the pages), visual information when seeing the actual words on paper or illustrations, you have to struggle to focus (with practice you will), you have to have better recall to remember what was said several chapters before. You get to reflect and hypothesize with the author. You embed the knowledge over time. You are forced to discipline yourself to actually finish the book.",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "penji-official",
                    "text": "Completely agree. It's like saying you watch 20 movies a day by reading the Wikipedia pages.",
                    "replies": [
                        {
                            "author": "livenoworelse",
                            "text": "Actually Wikipedia has been a great hack to get me out of a Netflix series. Watch the first season, wikipedia the next six seasons, watch the last few episodes. Done.",
                            "replies": [
                                {
                                    "author": "sparrowbadger",
                                    "text": "I feel like your own criticicisms apply to this strategy..."
                                },
                                {
                                    "author": "X-Worbad",
                                    "text": "not hating but it's a lil bit weird to hold both of those opinions at the same time. not investing time in a book is bad but doing the same to a show is good?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Running_up_that_hill",
                    "text": "I mostly agree besides touching. Ebooks are still books, right?",
                    "replies": [
                        {
                            "author": "livenoworelse",
                            "text": "They are but the touch aspect is still significant. The more senses involved the greater the recall but agree that this may be the least significant.",
                            "replies": [
                                {
                                    "author": "yakisobaboyy",
                                    "text": "E-ink with no backlight is functionally the same as reading a book in terms of retention, as someone who cannot read for shit on screens. Audiobooks are also books if you actually pay attention and don’t zone out, otherwise are we suggesting that blind people are who use screen readers or audiobooks to not…read books?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AggyResult",
                    "text": "A lot of concepts in business books can be distilled down into a handful of points. \n\nOr at least I feel like after reading a 300 page business book that there were one or two key takeaways for me. \n\nThis is what led me to a Blink subscription recently. \n\nWhilst I don’t think I’ve learned much from the Blinks, I have saved myself a lot of wasted time avoiding books that turned out to be lacking in depth."
                },
                {
                    "author": "Dear_Lie_7350",
                    "text": "Hot take but I completely disagree. I only read summaries and listen to verbal recap on books but I only ever listen to/read self improvement, productivity and business books. In the same time it takes you to read one book, I’ll have gotten the main takeaways from 10 different books with multiple different perspectives and each summary having their own unique perspective or addition. \n\nI don’t need to know every detail nor will I remember every example whether I read a book fully or not. My time is valuable to me so sometimes good enough is good enough",
                    "replies": [
                        {
                            "author": "SyntheticMoJo",
                            "text": "Full agreement. 80% of self help/improvement literature is just self glorification and endless anecdotes. And yes even the good ones. Only very few of those books I've read weren't well summerize by blinkist. \n\n\nFor fiction I agree to OP, that's like reading the wiki page of a movie and saying you watched it. Fiction gets its value from the details, the character development and the writing style of the author. For self improvement books barely anything of that matters."
                        }
                    ]
                },
                {
                    "author": "kenbou",
                    "text": "Do you mean, like, reading summaries of books instead of actually reading the books aren’t a productivity hack? If so, I agree. \n\nBut, actually summarizing books by using what you read and organizing it into your own words, is actually a very beneficial skill. Brain productivity hack, even."
                },
                {
                    "author": "freylaverse",
                    "text": "It depends entirely on why you're reading the book in the first place. If you have no interest in the topic and just need some information for reference, a summary is perfectly fine."
                }
            ]
        },
        {
            "title": "How to get off your phone when your life relies on your phone?",
            "author": "Head-luckyangelgirl",
            "text": "I need to get my screen time down I’m at like 15+ hours/DAY but everything I do feels like it requires my phone. . I always find myself constantly scrolling and getting sidetracked when I do the required things on my phone.\n\n\nI can’t delete social media because I am a social media manager. I work remote so I have to use WhatsApp throughout the day therefore I could never fully turn my phone off which I find does help me get off it. However, a lot of the time, I don’t have any work tasks therefore I can’t shut my phone off, but I’m also not working and inevitably scrolling. I get really anxious in the silence and I do EVERYTHING with background noise whether it be music, a podcast, a show, or random videos. Additionally my homework is all online and I do a lot of it on my phone as well. But I always get sidetracked and scroll whenever I pick up my phone. It’s gotten so out of hand, I’ll stay up til 3AM every night with a headache from the screen, not even wanting to be on pointless apps but having nothing better to do. \n\nHow can I get off my phone more when the majority of my day surrounds being on it? I feel like I’m kind of giving you a trick question but I feel so obsessed and I get so sidetracked even when I’m just doing something for work.\n\n\n",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "blogarpit",
                    "text": "Switch to desktop. Most of the work can be done on desktop / laptop. This should switch your tasks from mobile to desktop. I use 'minimalist phone' app. This helps to reduce unnecessary notifications 'noises'."
                },
                {
                    "author": "Dependent_Champion83",
                    "text": "It’s definitely challenging when so much of life revolves around your phone, but small intentional changes can make a difference. Start by setting boundaries—like scheduling specific phone-free times, such as during meals or an hour before bed. You can also try apps that help limit screen time or block distracting apps when you need focus.\n\nFor tasks like work or communication, consider using a laptop or other tools instead of your phone whenever possible. And for social connections, plan in-person meetups or calls instead of constant messaging.\n\nIt’s about balancing necessity with intentionality—finding ways to use your phone as a tool, not a constant companion. Have you tried anything like this before? Would love to hear what works for you!",
                    "replies": [
                        {
                            "author": "Head-luckyangelgirl",
                            "text": "Thank you! I’m going to give those a try especially the laptop one!"
                        }
                    ]
                },
                {
                    "author": "BadJanetVibes",
                    "text": "ScreenZen",
                    "replies": [
                        {
                            "author": "Conscious_Fact_5856",
                            "text": "I just installed this, it's pretty cool so far. I'm blocking reddit usage after a certain time."
                        }
                    ]
                },
                {
                    "author": "itsliami",
                    "text": "Just think to yourself what you could be doing with those 15 hours of lost time? A hobbie, speaking with friends, family, cooking… that could probably give you motivation to change your ways. \n\nA few things to try:\n\n1. Have a work phone and personal phone/ dumb your personal phone down, less apps. \n\n2. Charge your phone in another room over night, use a standalone alarm. \n\n3. Use a timer, I’m only going on Instagram for X time. Could work. \n\n4. Create a habit in the morning/ evenings where you phone is put down and not used for a period of time. \n\nWe are all guilty of spending too much on devices. The most important thing is self awareness, what are your triggers?",
                    "replies": [
                        {
                            "author": "Head-luckyangelgirl",
                            "text": "I really like the work phone idea thank you!"
                        }
                    ]
                },
                {
                    "author": "ILive4Banans",
                    "text": "Download WhatsApp web instead then lock your phone away"
                },
                {
                    "author": "kartiksharma1",
                    "text": "I totally get your struggle, it’s tough when your work and life revolve around your phone. One helpful approach could be using screen time management tools to block distracting apps during specific hours while still keeping access to the ones you need for work. You can also set focused work intervals and schedule phone-free breaks to help reset. For background noise, consider options that keep you engaged but don’t tempt you to scroll. Small changes like these can really help!"
                },
                {
                    "author": "RickNBacker4003",
                    "text": "Use the Pomodoro method and really stick to it. When you’re on your phone it’s business when you’re at work. And that’s it."
                },
                {
                    "author": "Lumpy-Lawfulness369",
                    "text": "went homeless without a phone for 8 months"
                }
            ]
        },
        {
            "title": "how to stay focused for 10+ hrs",
            "author": "tttuop",
            "text": "I have a problem focusing since I was a child I always struggled to focus on my studies or on what people said and that was before I knew the internet existed,we didn't have any phones or computers in our home so maybe I might have ADHD, but I really wanna know how do people study for 10+ I just can focus for 2 hrs max and the rest of the day I keep struggling even if I take a rest or a nap or watch something to motivate myself I always have this problem, and also when I try to read or understand something my focus will quickly go somewhere else or daydreaming for a whole 20 min and not realizing that, also I tried Pomodoro for 25 and also for 50 min it didn't work for me\n\nyou might be wondering why I'm asking this question because I literally need to study for about 10hrs to 12 hrs cause I have exams this semester in one month 😞\n\nI really feel like this is who I am and I will never change cause I'm really tired of myself 😢",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "Proud_Fisherman_7049",
                    "text": "I studied 12-16h a day for three years including weekends while learning software engineering and robotics. What helped me was a study friend who had the same goal and schedule and a ton of will to actually learn and understand (to land a good job).",
                    "replies": [
                        {
                            "author": "boxofrayne1",
                            "text": "yep, people are often the best motivators"
                        }
                    ]
                },
                {
                    "author": "kickyourfeetup10",
                    "text": "First of all, no one stays focused for 10 hours. \n\nSecond of all, set yourself up for success so you only need to study 2 hours a day and don’t feel the need for mega cram sessions. \n\nIf you *really* need a longer study day to work on an assignment, it’s important that your “break” isn’t completely shifting gears (e.g. watching tv etc) because no one in their right mind is going to want to shift back to study. It just needs to be a brain break. Take a shower, fold laundry, eat a snack, take your dog out etc. Quick and easy and then back to it."
                },
                {
                    "author": "loopywolf",
                    "text": "Oh, I thought you said YEARS..  I'll be going"
                },
                {
                    "author": "mahimaaa6",
                    "text": "I wanna study with someone."
                },
                {
                    "author": "EfficientHamster758",
                    "text": "Hey, you can find out when you get your peak energy and study during that time. For me, I am at my peak, from 8pm to 6am in the morning. My days go by in a blur so I enjoy them watching tv, reading novels, creating art. \nStating the obvious but cultivating an interest in your academia is very important, make sure you enjoy every bit of it. \nAnd please devote time to hobbies. The days I get too hyper and cut down relaxation time, my study sessions are not that great. \nAlso head out on the weekends too. Get some sun, fresh air, friends and have a blast. That's very important too. \nGood luck, OP."
                },
                {
                    "author": "Separate_Soul_8496",
                    "text": "I'd kill to be able to focus for 2/3 h"
                },
                {
                    "author": "TonySherbert",
                    "text": "People don't study for 10+ hours a day. They are lying or wildly exaggerating\n\nYou can only have high quality focus for about 2 or 3 hours a day\n\nYou can increase the amount of benefit you get from studying by studying with a calm mind. It's easiest to have a calm mind in the morning or after a nap, so try to study then.\n\nMeditation can also produce a calm mind.\n\nAnecdote: Addiction psychiatrist Alok Kanojia (Dr K) went to med school where he learned that a calm mind is best for studying. So he studied 2 hours a day in the morning. The rest of his friends \"studied\" for 8 hours a day later in the day.\n\nDr K's way of studying was so effective that he actually received an award for it in the form of an academic excellence award. That's how good his grades were.\n\nCheck out his YouTube channel healthygamerGG where he helps people with problems similar to yours, especially people with ADHD"
                },
                {
                    "author": "Emarceen",
                    "text": "If you daydream a lot and can't control it, you may wanna try the **focusability** app. It can help you reduce your daydreaming while studying, by a lot."
                },
                {
                    "author": "Bobelle",
                    "text": "Things that can help you:\n\nStudy buddy\n\nAccept that this is who you are. Immediately you notice yourself getting distracted - force yourself to snap out of it. Dont just continue being distracted. This is a physically painful process but you have no choice.\n\nContinue to use pomodoro"
                }
            ]
        },
        {
            "title": "Been sleeping for longer than I should",
            "author": "Sorry_Ad7837",
            "text": "I sleep from 12-8 am and then again 3-5 in the afternoon, I don't know why waking up is so tiring it''s not like I am sleeping for 3 hrs (like I do during exams) I am wasting a lot of my time sleeping, but even after waking up I don't get much work done. I need to chase away the drowsiness what do you think i should do?",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "laxluxus",
                    "text": "Maybe I missed it, but why don’t you go to sleep at 10pm? Sleep 10-8 and skip the afternoon sleep (it’s not even a nap anymore). \n\nAnd did you get your blood checked? Could be iron or vitamin deficit.",
                    "replies": [
                        {
                            "author": "Sorry_Ad7837",
                            "text": "Idk if it's my vitamins or my will actually. I have no motivation left in and my ocd kicks in every morning and I get distracted fast and for longer hours, it's embarrassing to say that as 21 year old. I will try to sleep earlier though, because anyways there's nothing I work on in the two hrs anyways ."
                        }
                    ]
                },
                {
                    "author": "bigguyfyi",
                    "text": "Bro enjoy the time that you have to sleep this much i wish i could get this much time to sleep",
                    "replies": [
                        {
                            "author": "Sorry_Ad7837",
                            "text": "I totally get where you are coming from but I should not be sleeping that much everyday for a whole month, i dont think it's healthy. I have to prepare for my interviews and maximize my productivity. Sure if I had been in grade 7-8 I would not have felt as guilty because there was nothing to do then no job to look no upskilling etc etc.",
                            "replies": [
                                {
                                    "author": "bigguyfyi",
                                    "text": "Bro relax, a little sleep didn't hurt nobody. Once you pass the interviews and you have a job you'll miss this life. Manage your schedule and make a todo list when you wakeup. And if you're waking up at 8am it's perfectly normal to take an afternoon nap."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "magimorgiana",
                    "text": "If you’re sleeping for 3h and then sleeping this much I think it’s normal. I was sleeping 13h a day in college. Depending on how old you are coffee or black tea might keep you awake past that nap time so you’re only sleeping those 10h."
                }
            ]
        },
        {
            "title": "How do I find time when there are too many things that matter?",
            "author": "askacc61",
            "text": "I want to start by saying, I want to get over the victim mentality. I know there's enough time and that I don't use it optimally. \n\nRecently I have had really bad headaches due to sleeping only 4 hours. But I don't know how do I do the things I want to be good at, which is really important to me along with things that are mandatory like college and work.\n\nThis is my schedule, please help me better optimise it.\n\n7 hours sleep \\\n1 hour gym \\\n6 hours college \\\n4 hours Part time \\\n3 hours studying college stuff \\\n3 hours studying stuff I wanna be good at \\\n2 hours studying for competitive exam \\\nAtleast 1 hour for personal projects\n\nThere's even more stuff but these are the primary. \n\nI know this can't be fit into a day but I don't know how else I can give enough time for each.\n\nWeekends are wasted over family time and social gatherings, which I heavily cut but still family forces me to come back home to meet and live with them wasting my time.\n\nI just don't know how to find time. There's so much to do that I often don't do anything but worriedly flip pages.",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "Ornery-Worldliness96",
                    "text": "Instead of doing everything every day, try having specific days for certain things. Like have Monday be only for college related time and don't use time for things you personally want to be good at. "
                },
                {
                    "author": "Claudio23071993",
                    "text": "First of all, take a deep breath. It’s okay to feel overwhelmed when you’re trying to juggle so much. The key is not cramming everything into one day but prioritizing and pacing yourself. You don’t need to do *everything* every single day. Focus on the essentials: sleep (7 hours is non-negotiable), work, college, and one or two things you truly care about. Rotate the rest across the week. For example, alternate days for personal projects, competitive exam prep, and hobbies.\n\nInstead of aiming for perfection in all areas, aim for consistency. Even 30 focused minutes on something daily can compound over time. Weekends don’t have to feel wasted—use family time to recharge and sneak in some light reading or brainstorming for your projects. Let go of the guilt; life isn’t just about efficiency. It’s also about finding joy and balance. You’ve got time, but it’s about using it intentionally. Focus on fewer things daily and celebrate small wins. You’re doing more than you think."
                },
                {
                    "author": "Fine_Plastic6853",
                    "text": "11 hours of learning a day for college seems like way too much (6 hours in class + 3 hours studying + 2 hours exams). You might want to look at changing your major into something that comes a bit more easily to you"
                }
            ]
        },
        {
            "title": "What’s Your Go-To Method for Beating Overwhelm and Staying Organized?",
            "author": "Disastrous_Ferret160",
            "text": "Feeling overwhelmed is something we all deal with from time to time. When deadlines pile up, tasks keep growing, and it feels like you’re running in circles. It’s frustrating and can leave you stuck for hours (or even days).\n\nI’ve found that having a clear system really helps me regain focus. For me, visualizing everything in one place works wonders, but I know some people prefer lists, calendars, or even journaling.\n\nSo, what’s your go-to method when life gets overwhelming? Do you rely on digital tools, old-school notebooks, or something else entirely?",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "continue-climbing",
                    "text": "I don't think anyone can stay organised 100% of the time.  But when I do feel overwhelmed I get a pen and paper and literally do a brain dump of everything I need to do to beat the overwhelm.\n\nWorks like a charm"
                },
                {
                    "author": "kingfisher-monkey-87",
                    "text": "I've been going through some coaching to manage my ADHD and stop the (mental) bleeding. The thing my coach said was the first thing to do is stop and do a brain dump and then go through and review my projects and clarify things. Same for when I have bad days with my sleep apnea and can't get anything done in terms of my brain firing right. \n\nFrom there, then you can look for low hanging fruit to get started, and what you get done on a bad day is what you get done. Renegotiate everything else."
                },
                {
                    "author": "WonderAndWanders",
                    "text": "I use an old-school paper planner and it helps me a ton.  It has my schedule in it, but also my daily task list. I have ADD, so every time something pops into my head that needs to get done but not immediately, I add it to a task list. It gives me peace knowing that the thing will get done and not forgotten, but I don't need to abandon what I'm doing in the moment to take care of the new thing. \n\nI also designed my own planner (and disc-bound planner that things can be moved around in) so that I can keep all my notes for various projects in one place, but in their own areas and move them around as needed."
                }
            ]
        },
        {
            "title": "UI \"upgrade\" fatigue. I want off this roller coaster.",
            "author": "wing03",
            "text": "I've been in IT support and sysadmin since the mid 1990s and contend with a lot of UI changes, admin panel options being moved around and the like over the last decade.   Fortunately I have colleagues and we all take turns chipping away at the new UI puzzle that gets thrown our way once or twice per year so it's not all on one person's back to google search and read through answers.\n\nFor my own work/personal and family organization, I use a Google Calendar and google chat.   (All the IMs that different people use and I need to install is a rant for another time.)  One Note as well.\n\nThe last I'm relatively happy and the one complaint is a number of years back when I changed computers and the OneNote UI changed on the new install.\n\nMy wife and I share calendars and she had been bothering me for not putting things in a calendar.    It turns out I was tapping on \"done\" up on the upper right rather than \"save\" which needed to be scrolled down to in order to save.  (My wife works to make technology accessible and increased my font sizes)\n\nI've since went back to a paper daytimer and taking a 10-20 minutes at the beginning or end of my day to synchronize what's on paper and what's digital.\n\nContinuing with calendar entry difficulties, having a default appointment length seems to be mandatory.  Mine is set to 1 hour.   That's okay except that the 1 hour length is a bit elastic.   If I change the end time, the beginning time adjusts and gets pulled or pushed to reflect 1 hour.   I seem to have to do multiple taps to get appointment times to stick if it's more or less than an hour.\n\nGoogle chat and it seems recently that threads became a thing for my family chat.   Respond to something and it creates a thread and nobody gets notified.  Tap on the back arrow button while I'm in the thread and I get taken back to the list of chats I have rather than the root of the specific chat.  I'm trapped in that thread and can't message the group.\n\nI am yearning for the days of my Casio BOSS and Palm Pilot.   \n\nLow resolution screens with efficient design instead of abundant options on a high res full colour screen.  Set buttons to get me exactly where I wanted were nice with the BOSS.  Those things got stuff done and organized nicely but not so easy with sync and jumping through hoops for interoperability.\n\nIs there anything off the shelf for mobile that has a stable UI to do calendaring and communications?   I use an Android Pixel with NovaLauncher and a iPad with a cellular modem.",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "penji-official",
                    "text": "I feel the same way! There are so many simple little things that are impossible to find with schedulers these days. Curious if anyone has found a good lo-fi solution."
                }
            ]
        },
        {
            "title": "Realistic goals a 34 year old can focus on? (No passions)",
            "author": "Ok-Objective9944",
            "text": "34 and single, I'm really not passionate about many things in life. My biggest dream is buying and working on my own home but outside of that, I don't have much interests. I currently work from home full time and I have $33,000 in savings while paying rent and student loans.\n\nI can't think of anything I want to do because I don't like people and don't really like where I live at all (New York) that much. But staying where I'm at makes viable sense.",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "Basic_Tutor_9646",
                    "text": "If you are lucky enough to work from home, maybe you could buy a empty parcel or older house where would you like to live and work on it in your free time."
                },
                {
                    "author": "ReformedBlackPerson",
                    "text": "You have no interests? Nothing makes you excited to learn more about it? Drawing, painting, puzzles, knitting, computers, rockets, music, dance, ceramics, crafts, exercise, health, sports, etc? Nothing?",
                    "replies": [
                        {
                            "author": "Ok-Objective9944",
                            "text": "I can't think of any subjects I legitimately enjoy like that. I like PC gaming and MMA sports, but I brought a new gaming PC and I only watch MMA fights. And I really don't want to interact with people as I get older.",
                            "replies": [
                                {
                                    "author": "Brushworkin",
                                    "text": "You could join an mma or bjj gym and/or take an interest in game dev and try making a small game. Both can be extremely rewarding from experience."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "crazybutthole",
                    "text": "Maybe consider moving to a new town?"
                },
                {
                    "author": "Brund4wg",
                    "text": "Maybe you can tell more about yourself. Even if you say you are not passionate about many things (and actually many people are in the same situation), i am sure there are still things or moments you get excited about. When was the last time you felt happy or proud of yourself?",
                    "replies": [
                        {
                            "author": "Ok-Objective9944",
                            "text": "I can't think of much. I haven't achieved alot because I just work dead end jobs with no upward mobility and I was always talked down to like an idiot. I'm really under the belief I'm just mentally slow."
                        }
                    ]
                },
                {
                    "author": "AnionKay",
                    "text": "I have a similar thing where I don’t really feel like I have passions or hobbies I’m interested in. Most of my time is spent working and I also work from home and life gets kind of mundane. So you’re not alone in this feeling. \n\nIf you are seeking a hobby or passion, you may not know if you actually like something until you try it. Maybe every weekend you can give a new activity an attempt. Some examples can be something active (learning a new sport, practicing calisthenics, etc), doing something educational (taking a cooking class or learning a new skill, learning a new language, learning how to play guitar), trying out new coffee shops and restaurants, exploring more of New York or traveling to new places, volunteering at an animal shelter or for another cause, working towards a more long term goal such as marathon training, etc. \n\nIf you’d rather focus more on saving for your future house, you can consider taking on side gigs, like DoorDash, Instacart, Amazon Flex, or something like Fiverr or Taskrabbit if you have a skill you can monetize. This may put you in a state of constantly working though which may not be what you’re seeking. \n\nOverall, something that you enjoy and that benefits you physically, mentally, emotionally would be great. I don’t think everything has to become a passion, just finding ways to grow."
                },
                {
                    "author": "PearSad7517",
                    "text": "Maybe you should move somewhere? Hating where you live isn’t good. It would be good to get shaken up and get a fresh start"
                },
                {
                    "author": "desi-wifey",
                    "text": "It’s hard at this age to get passionate. You can get motivated. So keep saving up money and invest in some safe stocks for your future. And take care of health. Otherwise all saved money will be gone for treatments and medications. Apart from that you might feel same way even at 44. I’m just like you but have kids so have more motivation to secure kids future."
                },
                {
                    "author": "LauraAnderson18",
                    "text": "Focusing on buying your own home is a solid goal, especially with your savings. With the right strategy, you can grow that nest egg, pay off your loans, and eventually find a place that feels more like \"home,\" even if it's outside New York."
                },
                {
                    "author": "tempebusuk",
                    "text": "Do you like living on a tropical island? Move to my country. Low living costs will allow you to save more and pay off your student loans faster."
                },
                {
                    "author": "SvrT_3108",
                    "text": "Become a lawn mower"
                }
            ]
        },
        {
            "title": "An alternative to Google Keep with multi-level checklists",
            "author": "TurbulentBoxes",
            "text": "Heyo!\n\nI love Google Keep as a versatile, simple note-taking app. But the *single* feature I'm missing, and *really* need, is the ability to do multi-level checklists!\n\nI've looked at Notion, todoist and Bundled. In general the feature's either unsupported, or the app does support it, but comes with a lot of UI bloat and features that just make it too complicated. It's e.g. possible to do it in todoist, but it becomes a big mess when you have more than a few tasks, and I lose overview fast. It's more of a task management app than a simple to-do list/note app - but all I want is just Keep, but with multilevel lists...\n\n  \nThanks for any suggestions :)",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "AyneHancer",
                    "text": "I haven't found the best application for it either... So I've choose todoist, even if I have the same problem with the UX that you've already mentioned 😞  \n  \nBut since google will invest much more energy into Keep, there is a tiny chance that it could have multi-level tasks and even notes. Who knows..."
                },
                {
                    "author": "Bobelle",
                    "text": "What do you mean by multi-level? Like lists of lists?"
                },
                {
                    "author": "throway3451",
                    "text": "How many levels are you looking for?"
                },
                {
                    "author": "Hot_Rush6416",
                    "text": "Hey! Might be worth checking out bydesign app?  I think it has what you're looking for in terms multi-level check lists. I've found the app to be super flexible. Good luck!"
                },
                {
                    "author": "Electronic_Pickle427",
                    "text": "Maybe TickTick is something for you"
                },
                {
                    "author": "This-Bicycle4836",
                    "text": "One of the most underrated productivity apps I have started to use is Microsoft Loop. And I can't go back. This app is amazing. Do you mean multi level list as nested list? If yes, then that app is for you."
                },
                {
                    "author": "dissaver",
                    "text": "If you don't use checkboxes with Google keep you can instead use dashes to have multi level lists."
                },
                {
                    "author": "Maittanee",
                    "text": "Google Task has one level of under tasks."
                }
            ]
        },
        {
            "title": "Browser Extensions for Managing Screen Time",
            "author": "Duke-doon",
            "text": "I have an app called ScreenZen on my phone and it's done wonders for my screen time. What it does brilliantly is that it restricts you right when you open an app/website, before your brain goes on a dopamine rampage. You have to sit there staring at a counter for 20 seconds or so until you can unlock the app/site for a few minutes, and most of the time I end up going \"meh, actually I don't need this right now\" and put the phone away. This also allows for the few times you actually need to use the app/site.\n\nNow, I was wondering if something like that existed for Safari/Chrome/Firefox? I have now noticed that I still waste a lot of time when at a computer and that's when you actually want to do things, so it's quite consequential too.",
            "subreddit": "productivity",
            "comments": []
        },
        {
            "title": "Shower Thought About Productivity",
            "author": "mybitsareonfire",
            "text": "Shower Thought 🚿 💡\n\nI think the whole “doer” culture can be a bit toxic. It’s all “just do it” and “you’re procrastinating,” which sometimes gets in the way of actually reaching your goals. I’m not saying you shouldn’t work hard; I just think it’s important to make sure you’re aiming for the right target before putting in thousands of hours. If your aim is off, it really doesn’t matter how much effort you put in—you won’t see real progress.\n\nFor me, that’s where productivity really comes in. Productivity isn’t just about doing more; it’s about doing what matters most. To figure out what truly matters, you have to make solid decisions about how you spend your time and energy. That’s why I feel there’s a science that doesn’t get enough attention: the science of decisions.\n\nEvery situation you find yourself in, especially as a professional, comes from a series of decisions, whether they were made consciously or unconsciously. Decisions can make or break your dreams, and your end result is only as strong as the best decisions you make.\n\nD = {d1, d2, d3, … , dn}\n\nAt any given moment, there are multiple decisions you could make, even though they’re not all equal. This means there is an ultimate series of decisions that lead to a specific goal, which is pretty fascinating. You probably won’t make every decision perfectly, but you can definitely improve your odds of making good ones along the way—and that’s what real productivity is all about. It’s not just working harder; it’s working smarter.\n\nIf you want to learn more, I recommend checking out decision theory or reading the book Smart Choices.",
            "subreddit": "productivity",
            "comments": [
                {
                    "author": "Just_Natural_9027",
                    "text": "The problem with this is sometimes “just doing it” is far more productive than waiting for the perfect decision or right target.\n\nTake the best heuristic or satisficing is probably the most important concepts I have learned in life.\n\nI wasted a lot of time focusing on smart choices.",
                    "replies": [
                        {
                            "author": "mybitsareonfire",
                            "text": "Well I guess it’s a balance and there is context as well. For me as an indie developer I have spent too much time doing and too little time planning. I still think actual work should be done 95 percent of the time, but a good decision could exponentially increase the effect of what you are trying to achieve.\n\nFor example, I once spent months on a new marketing campaign without testing the message or checking if my target audience actually cared. When I finally launched it, I realized it completely missed the mark. If I had taken a bit more time to validate my ideas, I could have focused that energy on something people truly wanted.\n\nSame goes for optimization, I was spend to many hours doing manual work collecting data. However when I took some time thinking about it, I realized I could spend a couple of hours coding a script doing it. Spend a couple of hours, but saved a couple of weeks.\n\nBut! There has to be a limit to how much you can optimize, law of diminishing returns sets in pretty quickly. Sometimes the ROI for optimizing is too low."
                        }
                    ]
                }
            ]
        }
    ]
}