{
    "items": [
        {
            "title": "How i make $100,000/month with my SaaS.",
            "author": "BLUE-1-SEE",
            "text": "I dont. This is whats wrong with this subreddit. If anyone posts crazy numbers like this \n\nand then says\n\n“check it out here➡️ fake url”\n\nthey are lying… plain and simple. If you see someone claiming large numbers like this, they are phishing for more clicks/purchases.\n\nYou can tell based on their profile but 99% are fake, especially when if you were actually making that much, you wouldnt be searching for validation on reddit.\n\nI hope this makes sense, but like youve been told before…\n\nDO NOT BELIEVE WHAT YOU SEE ON THE INTERNET\n\nGood luck building your SaaS and I wish all of you the best of luck.",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "rand0mm0nster",
                    "text": "I swear there's as many posts complaining about them as there are of those posts",
                    "replies": [
                        {
                            "author": "OftenAmiable",
                            "text": "More, I daresay. \n\nOP said, \"if you were actually making that much, you wouldnt be searching for validation on reddit.\"\n\nAs opposed to what this post is about, which is seeking validation for NOT achieving that kind of success...."
                        },
                        {
                            "author": "fredbuilding",
                            "text": "Yep it’s annoying af, just another way for ppl to market"
                        },
                        {
                            "author": "joshbedo",
                            "text": "Literally all this thread is"
                        },
                        {
                            "author": "BLUE-1-SEE",
                            "text": "very true haha, i think its funny and ive seen less and less of the actual “i make this much per month” recently.\n\nit was bad to end 2024, but you are right, but also these posts help dissuade people from making these posts in the first place",
                            "replies": [
                                {
                                    "author": "OftenAmiable",
                                    "text": "\"My spam is good because it reduces other spam.\""
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SDM_design",
                    "text": "Reading the title: *\"Yeah right, $100k a month... sure, buddy.\"*\n\nScroll down.\n\nScroll back up just to double-check.\n\nRead the post: *\"Oh...\"*"
                },
                {
                    "author": "rreoton",
                    "text": "Pfft I make $100k per day. You gotta step up your game.",
                    "replies": [
                        {
                            "author": "Kindly_Manager7556",
                            "text": "lol i made 100k in hte last few seconds cmon",
                            "replies": [
                                {
                                    "author": "Smooth-Case1562",
                                    "text": "Imagine you are making 100k per month and still have time to spamming on reddit hahahah"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "eduardez_",
                    "text": "I tell you something, the next billion dollar SaaS is something that filters out those and this kind of posts.",
                    "replies": [
                        {
                            "author": "Careless_Heat907",
                            "text": "The ultimate irony: a billion-dollar SaaS to filter out posts about billion-dollar SaaS ideas. VCs would fund it in a heartbeat, then spam *it* with pitches for the next spam-filtering AI. The circle of (tech) life. "
                        }
                    ]
                },
                {
                    "author": "TinyGrade8590",
                    "text": "Some people build in public but your right",
                    "replies": [
                        {
                            "author": "hu-beau",
                            "text": "Building in public doesn’t mean they can fabricate revenue numbers to attract users. Just be transparent about what they're doing and show us the real benefits.",
                            "replies": [
                                {
                                    "author": "TinyGrade8590",
                                    "text": "People just trying to hack growth"
                                }
                            ]
                        },
                        {
                            "author": "BLUE-1-SEE",
                            "text": "yeah i agree, but if someone is at 25-30k/month, why would you be on reddit trying to validate/get more users based on the jones effect.\n\nI agree with the build in public part, but still if i was making that much, i wouldnt be making micro posts on reddit to get a few new users",
                            "replies": [
                                {
                                    "author": "saasgrowthhax",
                                    "text": "Because $25-30k/month is not that much?\n\nIf you post on Reddit and add another $5-15k in MRR, why not."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "claritiai",
                    "text": "That’s because you’re not an ex-Tinder engineer\n\nEdit: obligatory /s (just in case 🤷‍♂️)"
                },
                {
                    "author": "Good_Advertising6653",
                    "text": "Anyone posting these numbers is lying and projecting MRR or ARR without churn"
                },
                {
                    "author": "Agreeable_Service407",
                    "text": "Some people do make 100k/month but you're right, they don't post here."
                },
                {
                    "author": "EmersynMarry",
                    "text": "Here’s a solid, natural response you can post:\n\nDamn, respect for hitting $100K/month—that’s no small feat. Appreciate you sharing some insights on what worked for you. - Sike! Just kidding.\n\nOne thing that really stood out to me is your focus on direct sales and outreach. I used to rely too much on paid ads, and while they work, they can also be a money pit if you’re not careful. Once I started automating outreach and getting more direct conversations going, things started to click.\n\nCurious—what’s your take on scaling outbound at this stage? Are you still heavily involved in the process, or have you built a team around it? Would love to hear how you’re handling growth beyond the initial traction phase.",
                    "replies": [
                        {
                            "author": "BLUE-1-SEE",
                            "text": "this is one of the funniest responses ive ever seen"
                        }
                    ]
                },
                {
                    "author": "Swimming_Driver4974",
                    "text": "No but I actually do...\n\n  \n...in my dreams"
                },
                {
                    "author": "duh-one",
                    "text": "I hate these AI clickbait posts. Please ban all of them",
                    "replies": [
                        {
                            "author": "Neither_Sir5514",
                            "text": "It's crazy this subreddit isn't gone yet for lack of moderation"
                        }
                    ]
                },
                {
                    "author": "BusyBusinessPromos",
                    "text": "I feel your frustration."
                },
                {
                    "author": "rainnz",
                    "text": "Blockchain is the answer"
                },
                {
                    "author": "zalex_baller",
                    "text": "For anyone who wants to sell to this community: Just don’t, 99% of people here are solo devs with no money (trying to sell to you)"
                },
                {
                    "author": "zalex_baller",
                    "text": "![gif](giphy|z3HFoEzXCMykr4L0TB|downsized)"
                },
                {
                    "author": "Genoss01",
                    "text": "I make $100,000/mo with my SaaS"
                },
                {
                    "author": "_pdp_",
                    "text": "It will stop once everyone exercise their power to downvote it to oblivion. It is as simple as that."
                },
                {
                    "author": "FragrantAstronaut513",
                    "text": "It works because it's what people want to see, no one wants to read a story about someone who is trying to make money and don't. But there no more post saying they are rich than yours"
                },
                {
                    "author": "Loose-Nerve3880",
                    "text": "Absolutely agreed with this post. People shouldn't believe everything they see or hear on social media!!"
                },
                {
                    "author": "Careless_Heat907",
                    "text": "Yeah, if I was making **$100k/month**, the last thing I'd be doing is posting about it on Reddit. I'd be on a **beach somewhere.**"
                },
                {
                    "author": "Adventurous-Half-661",
                    "text": "Spot on! Posts with exaggerated claims and sketchy links are often red flags. Real success stories don't rely on clickbait or validation here. Stay critical, focus on building value, and best of luck to everyone working on their SaaS journey!"
                },
                {
                    "author": "heinbruno",
                    "text": "98% of the posts on this sub are manipulative and do not reflect reality. I'm not a dev and I didn't know anything about SaaS and I don't understand almost anything here... it's quite dangerous, I think."
                },
                {
                    "author": "Upset_Manufacturer15",
                    "text": "Thank you for your WARNING. We will not believe everything 🙏"
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Let me share some of the most unique and underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are cutting-edge and rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!"
                },
                {
                    "author": "HouseOfYards",
                    "text": "Have you sold any? You have an e-commerce site or it's on Amazon?"
                },
                {
                    "author": "FeistySchedule3693",
                    "text": "I understand where you're coming from, and skepticism is valid, especially on the internet. But labeling everyone with success stories as liars might discourage genuine creators. Some people actually are earning six figures and sharing their journey to inspire others—not just to \"phish\" for clicks or purchases.\n\nIt’s important to discern between authentic posts and scams, but dismissing all claims outright isn’t fair. After all, success varies, and some genuinely want to motivate or share insights with the community.\n\nAt the end of the day, it’s up to each person to evaluate the services or claims they come across. Let’s focus on building each other up, staying vigilant, and supporting those who are genuinely trying to make a positive impact.\n\nWishing you success with your SaaS!"
                },
                {
                    "author": "marvincartier6",
                    "text": "I made over 2 million in a few hours"
                },
                {
                    "author": "xtreampb",
                    "text": "Reddit isn’t where my customer profile is. Can’t really advertise niche manufacturing software here. Not even a subreddit for the target industry.",
                    "replies": [
                        {
                            "author": "jonnogibbo",
                            "text": "I’m in the same boat"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Will you pay me for getting sales for your saas ??",
            "author": "HorrorEastern7045",
            "text": "As the title say, i m willing to get sales for your saas, if you will provide me with some good percentage of the revenue you get from that particular user.\n\nFor eg, if i bring you a person who susbscribes to your product for $30/month you can pay me $10/month until the user churns.",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "erick-hariharan",
                    "text": "> you can pay me $10/month until her churns.\n\nFor 1 year",
                    "replies": [
                        {
                            "author": "One_Elephant_4628",
                            "text": "I would argue the commission should actually go UP after some time period to incentivize finding better users.\n\nSales people are masters of finding every loophole and optimization to maximize income for a given incentive structure, so if you try to cut corners to shave off their commission, the results will almost certainly not be what you want."
                        },
                        {
                            "author": "PaulShellDev",
                            "text": "Seems more often than not, there's a timeline limit.\nPeople don't seem to have any shortage of new sales from such programs either."
                        },
                        {
                            "author": "Independent-Way-1091",
                            "text": "Limits like that; are why you won't have strong sales people working for you.",
                            "replies": [
                                {
                                    "author": "dollarassfucker",
                                    "text": "Unlimited commissions are insanely rare and a stupid idea as it cuts directly into your company valuation.\n\nYou dont need \"outstanding\" sales people. Normally experienced cold callers can easily do the trick if your saas isnt complicated to market. Just spread the word and they will buy by themselves"
                                }
                            ]
                        },
                        {
                            "author": "pystar",
                            "text": "AG1 does forever"
                        }
                    ]
                },
                {
                    "author": "Kimeur",
                    "text": "That’s called affiliation",
                    "replies": [
                        {
                            "author": "HorrorEastern7045",
                            "text": "Yea exactly but not all saas has it built in. At least in the early stages.",
                            "replies": [
                                {
                                    "author": "Kimeur",
                                    "text": "Just i’m curious, how will you bring customers to my SaaS ? [MockFlick.com](https://mockflick.com)"
                                },
                                {
                                    "author": "dfgonzalez",
                                    "text": "All SaaS should have an affiliate program, [numok.com](http://numok.com) is an open source rewardful, so it's almost free to do it now."
                                },
                                {
                                    "author": "OmarFromBK",
                                    "text": "I'm a partner of one SaaS startup that does offer affiliate commissions. We use rewardful and have affiliates. We also have a lot of marketing material for our affiliates to use. (Also, we offer more than what you're asking)\n\nHere's the site you would be marketing, if you want to take a look. \n\nhttps://magicbookifier.ai \n\nDM me if you're interested, or if you have any questions."
                                },
                                {
                                    "author": "Mackos",
                                    "text": "I’m building saas that solves this"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dtdtdt111",
                    "text": "Go on Upwork if you want to do this, there are millions of companies that will pay you nothing to work for them on commission. If you’re good at what you do and this isn’t a scheme you should only work for a salary + commission.\n\nI’ve been in sales a long time and there are countless ways companies will screw you over instead of paying what you’re worth or what they owe."
                },
                {
                    "author": "AmsterDumber",
                    "text": "100%. but needs a time limit and not till churned"
                },
                {
                    "author": "Rule72Consulting",
                    "text": "I like this arrangement, it’s in line with our business direction. DM me!"
                },
                {
                    "author": "tripledoublequad",
                    "text": "Yea i would do that dm me."
                },
                {
                    "author": "xpatmatt",
                    "text": "Yes, DM me"
                },
                {
                    "author": "FinishWise2645",
                    "text": "yes i would pay for that user for lifetime."
                },
                {
                    "author": "Sad_Selection_8008",
                    "text": "Please DM!"
                },
                {
                    "author": "sgizm",
                    "text": "Interested as well"
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an exclusive community funnel. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into micro-moments marketing. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram\n—this builds instant trust. Third, leverage hidden lookalike audiences. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, l’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!",
                    "replies": [
                        {
                            "author": "Agreeable-Hand5779",
                            "text": "We definitely can agree on fair terms if you're interested that is.",
                            "replies": [
                                {
                                    "author": "MoulayCherifinvest",
                                    "text": "Dm me."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "chrllo1",
                    "text": "yes. c2coi dot com has 30% residual sales commissions"
                },
                {
                    "author": "Jazzlike-Echidna-670",
                    "text": "I have some micro saas that need affiliations, Dm me 👍🏻"
                },
                {
                    "author": "rollrodrig",
                    "text": "I have a MVP project and for sure I can pay to you for each customer. Lets talk."
                },
                {
                    "author": "No-Second8493",
                    "text": "Yes, you can DM!"
                },
                {
                    "author": "imadjourney",
                    "text": "I didn’t set up affiliation yet but interested to try with you, I’ll give you 50% of sales revenue, DM"
                },
                {
                    "author": "jasfi",
                    "text": "I don't need something like that just yet, but will in the near future. Please dm!"
                },
                {
                    "author": "rolin_cobinson",
                    "text": "Let's talk. I can provide a substantial revenue return rate"
                },
                {
                    "author": "tipo94",
                    "text": "I already have an affiliate system that does exactly this, dm me"
                },
                {
                    "author": "JoePatowski",
                    "text": "It's a little higher than average, which is 30%. But yes, I would be interested in this."
                },
                {
                    "author": "CryptographerAny6745",
                    "text": "Dm and see what you can do for us"
                },
                {
                    "author": "Iltomix",
                    "text": "I Am interested, Dm me"
                },
                {
                    "author": "theonlyvasudev",
                    "text": "It's pure affiliate"
                },
                {
                    "author": "Parmg100",
                    "text": "Dm me I’m interested"
                },
                {
                    "author": "herberz",
                    "text": "send me a DM"
                },
                {
                    "author": "meshhaa",
                    "text": "I’d love to know more about your process, how do you typically generate leads and convert them into paying customers? Do you have a specific setup or strategy for this? Let’s discuss if we can align on something mutually beneficial"
                },
                {
                    "author": "columns_ai",
                    "text": "Yes. 20% recurring forever - https://app.fina.money/doc/EcRd2DR9k55r2l",
                    "replies": [
                        {
                            "author": "columns_ai",
                            "text": "If you perform well, I can give you extra 10% bonus at each payout for the first year."
                        }
                    ]
                },
                {
                    "author": "InsureaBit",
                    "text": "I just started a program for my micro saas its quite nitch but I am willing to share 30% of over all income works close to 40% after expenses. You could Dm me or respond here idk."
                },
                {
                    "author": "Dal-Chawal",
                    "text": "Hey , dm me please ."
                },
                {
                    "author": "sweetchiicka",
                    "text": "Certainly"
                },
                {
                    "author": "Kitchen-Cat8662",
                    "text": "Dm me"
                },
                {
                    "author": "Latter_Jellyfish5389",
                    "text": "Sure! Let's connect"
                },
                {
                    "author": "ccoolsat",
                    "text": "Definitely"
                },
                {
                    "author": "moonboots",
                    "text": "Hey we would be open to discussing. I just posted in r/forhire looking for qualified lead gen and demo booking."
                },
                {
                    "author": "Future_Court_9169",
                    "text": "Yup. Why not"
                },
                {
                    "author": "Future_Court_9169",
                    "text": "Yup, why not but should be time bound."
                },
                {
                    "author": "grvs42",
                    "text": "Yeah I would pay for this, dm me. This is the product - https://fillmarketing.com"
                },
                {
                    "author": "KF_Lawless",
                    "text": "Honestly it's really smart to commission sales from people in adjacent fields like this.\n\nIf I don't work in the field of your SaaS, then I have no motivation to compete with you, and people are more likely to listen to stuff I recommend since it isn't obvious that I directly benefit - so it seems more sincere"
                },
                {
                    "author": "Any-Blacksmith-2054",
                    "text": "Deal! I will pay you 50% of all revenue from all subscriptions if the user came from your utm link(which I provide). Forever. My saases: \nhttps://allchat.online/\nhttps://autocode.work/\nhttps://genious.name/\n\nAnyone else wanna try? You are all welcome!",
                    "replies": [
                        {
                            "author": "Particular-Sea2005",
                            "text": "interesting",
                            "replies": [
                                {
                                    "author": "Any-Blacksmith-2054",
                                    "text": "Then lets arrange it! I will add you to GA so you can track all conversions. I will also save your utm cookie for 1 month on user device, just in case"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HouseOfYards",
                    "text": "Our saas changed from paid to free. If you have user to sign up, we can pay per sign up."
                },
                {
                    "author": "mayobot_com",
                    "text": "we call it affiliation :D"
                },
                {
                    "author": "Competitive-Ad-863",
                    "text": "i think if you can find a way to make saas affiliate a compelling offer that compensates you enough for the time you have to spend on successfully selling software, saas sales leaders will hear you out. the problem with saas is that its extremely crowded in almost every category. so affiliate gets washed out and people try to use more effective scaling solutions."
                },
                {
                    "author": "kiamori",
                    "text": "I can pay you $500 for every sale + 20% of all add on servcies. Our average sale is $4600.",
                    "replies": [
                        {
                            "author": "Quick-Link-7458",
                            "text": "Hello. Can you check DM"
                        }
                    ]
                },
                {
                    "author": "Icy_Alternative_5873",
                    "text": "I’d pay that amount! As I’m new to all of this."
                },
                {
                    "author": "Mackos",
                    "text": "I would take that deal, just question about percentage share. \nI have saas in early development but you can reach me out"
                },
                {
                    "author": "MehulFanawala",
                    "text": "I'm open to discussing this."
                },
                {
                    "author": "boxxa",
                    "text": "There is a whole market of companies that offer referral business if you want to cold call and start small with the signup, get a percent of the monthly, move on.\n\nIf you prove yourself, you can get into remote deal closing on larger ticket items. There is plenty of opportunities to find growing products and brands and sell higher price plans and packages if you have the motivation to work with customers and represent a brand vs just trying to close a signup and move on. \n\nAt one point I was able to generate 25%+ of the contract in commissions for 5 and 6 figure deals."
                },
                {
                    "author": "samiikay",
                    "text": "Im actually looking for people who would do this for our startup. I don’t have the affiliate program formalized and built into the platform because we are still in development stage and just launched the MVP version. But we can have a discussion to get started.\n\n\nDo checkout our website for details about the product: www.ailabapp.com\nICP: Non-tech entrepreneur interested in getting into AI."
                },
                {
                    "author": "Business_Ebb_8271",
                    "text": "affiliation?"
                },
                {
                    "author": "Potential-Ad-3126",
                    "text": "Go for it if you're interested in selling my product I'll give you 33% revenue. Legails.com"
                },
                {
                    "author": "Local-Spot-585",
                    "text": "I'll pay $20/user"
                },
                {
                    "author": "allcodecomsf",
                    "text": "I have a SaaS product here, https://cloudcontactai.com. The pricing is $25 - $150 per month, but this can get lucrative when the paying user sends a ton of SMS or setups an AI agent to respond. Reach out if you're interested in an affiliate model."
                },
                {
                    "author": "dougthedevshow",
                    "text": "I’d do that. [Tackleboot](https://tackleboot.app) and [Genfit](https://genfit.fit) productivity app and fitness app. DM (anyone) if you’re interested."
                },
                {
                    "author": "pp227",
                    "text": "I am open to pay 20-30% commission on each sale, definitely thats more than $10 because our pricing is high ticket b2b. DM me to chat."
                },
                {
                    "author": "Belliax",
                    "text": "Real question, are you just selling or are you generating the sales? Marketing, cold calling, reaching out to clients and turning leads into sales on your own? \n\nWhat extent are you going for your side hustle?"
                },
                {
                    "author": "Historical-Boat-4101",
                    "text": "interested! send me a dm"
                },
                {
                    "author": "Fun-Relative-72",
                    "text": "80% for an year. \n\nWhat we are looking for is product market fit and our goal is customer feedback to scale up the product itself which will eventually lead to product led growth."
                },
                {
                    "author": "Salt-Bluejay-4907",
                    "text": "Yes we would pay you 50% of the mrp for each digital product sold. Dm us with your details if interested."
                },
                {
                    "author": "AgencySaas",
                    "text": "As others have mentioned, you're describing an affiliate program.   \n  \nWe'll be doing one for our next product ($80/mo. platform) & paying out 25% of revenue generated for each customer, up to 18 months.\n\nWhat's your background?"
                },
                {
                    "author": "milkyral",
                    "text": "sure, we’d do this. we offer 20% of sales for the first year. our smallest plans are $300/month."
                },
                {
                    "author": "BlockFreakingChain",
                    "text": "30%....maybe."
                },
                {
                    "author": "BowlerMission8425",
                    "text": "What about people that want to build saas an need an agency or a team, do you think you can get this type of clients ?"
                },
                {
                    "author": "jxdos",
                    "text": "Yes, DM me. SaaS: https://jobfly.co"
                },
                {
                    "author": "bbqgorilla",
                    "text": "Interested. DM please"
                },
                {
                    "author": "parkerproject",
                    "text": "Sounds like a good deal to me. DM me"
                },
                {
                    "author": "Such_Fox7736",
                    "text": "Depends on the structure. I would gladly give 20% per month of any paying user you bring in for the lifetime of that user if that's all I am paying but if I am hiring you, paying all the related expenses, taking all the risk, and then paying a lifetime commission on the cuatomer on top then no."
                },
                {
                    "author": "F1erceK",
                    "text": "Yup I'd pay you that. I run an agency. DM me if you want to discuss"
                },
                {
                    "author": "mattiarighetti",
                    "text": "30% recurring revenue on people you bring, if you're up for it"
                },
                {
                    "author": "Robhow",
                    "text": "Let’s go…\n\n[DailyStory.com](https://dailystory.com) 30% commission. Customers ranging rom $10-$10k/MRR."
                },
                {
                    "author": "YardAffectionate935",
                    "text": "yes 100%, I'm trying to get a startup off the ground and looking for a partnership like this. Message me."
                },
                {
                    "author": "imsinghaniya",
                    "text": "We at Formester have such an initiative. Let me know if you’re interested."
                },
                {
                    "author": "Rodirem",
                    "text": "Check out these two options and DM if you find it interesting and think you can bring paying users (you or anyone else who wants to work together, just DM me):\n\n[https://mypersonalva.com](https://mypersonalva.com)\n\n[https://sub.cx](https://sub.cx)"
                },
                {
                    "author": "Novel-Actuary6467",
                    "text": "I would be interested in this. DM me and we can discuss more."
                },
                {
                    "author": "pystar",
                    "text": "Isnt this how affiliates work?\n\nIf anyone is interested in this sort of arrangement,\nI have these SaaS products:\n\n\nhttps://refundguard.hunchbank.com\n\nhttps://hunchbank.com\n\nhttps://camaramagic.com\n\n.\nIf you can get customers for any of them, then send a DM."
                },
                {
                    "author": "NoDoze-",
                    "text": "Can I get a translation of the end there? $10/mo for $30/mo, huh? And what does \"her churms\" mean? I'm not sure they'll understand the saas product with that language handicap.",
                    "replies": [
                        {
                            "author": "HorrorEastern7045",
                            "text": "I was giving an example. Sorry for the spelling, i edited it now. \n\nI was proposing to get a commision per sale kind of arrangement for getting users for your saas.",
                            "replies": [
                                {
                                    "author": "NoDoze-",
                                    "text": "So if my saas is $100, I can pay you $10?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "yuzbashev",
                    "text": "Why wouldn’t I ? It’s a win-win situation, if I earn, you earn"
                },
                {
                    "author": "AggravatingMud7819",
                    "text": "Up to $1k, DM me."
                },
                {
                    "author": "kervanaslan",
                    "text": "I could pay you %40 lifetime."
                }
            ]
        },
        {
            "title": "What AI apps are you building?",
            "author": "raph_appaca",
            "text": "Hey there, I'm working on a No Code tool to let people and businesses create AI web apps. Examples are chatbots and forms that generate content or images, but the tool can create complex products as well.  \n  \nIt'd be super helpful to know what everyone is building, and if it would be relevant for you to have access to such a tool, and what main features you'd be looking for.\n\nCurrently you can design your own the interface, create your AI model with GPT, Gemini, Claude or Flux for images, store data, and create automation, without needing to code.\n\nIt's called Appaca.ai, if you have any feedback it'd be amazing!  \nCheers",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "phil9l",
                    "text": "🌶️ https://spicee.me – made a small app with my GF to spice up the intimate life: track time, locations, added a couple of challenges. It really changed the relationships, so we gave it to a few friends, who are happy users now too. Made a landing page to see if I should keep it for us or scale.\nUsers: anyone who wants to add more fun to their relationships.\n\nI use AI to summarize your emotions, needs, problems, and communicate it to your partner in a not annoying way, so they can react, and improve your relationships.",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Wow thats great man"
                        }
                    ]
                },
                {
                    "author": "TitleAdditional8221",
                    "text": "LLAMATOR - [https://github.com/RomiconEZ/llamator](https://github.com/RomiconEZ/llamator)\n\nFramework for testing your LLM systems, chatbots, agents for vulnerabilities related to generative text content.\n\nAttacks: extracting the system prompt, generating malicious content, checking LLM response consistency, testing for LLM hallucination.\n\nAny client that you can configure via Python can be used as an LLM system.\n\nI would appreciate your star on GitHub.",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Absolute man!"
                        }
                    ]
                },
                {
                    "author": "Swimming_Driver4974",
                    "text": "Your app is pretty cool. I did a small test run and published, looks clean. How long did it take you to make it? How many users do you have?\n\nI'm building [https://www.gitfolio.ai/](https://www.gitfolio.ai/), it's an AI resume builder. Still in very early stages.",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Thats fire mann!"
                        }
                    ]
                },
                {
                    "author": "Both-Blueberry2510",
                    "text": "Working on [**Octo**](https://chromewebstore.google.com/detail/octo/obloifdoiohdfcnimbahlphceecmjoci).  \nPowerful chrome extension for data analysis and alerts.  \n\\- Chat with data for insights  \n\\- Create charts  \n\\- Automate analyses/ insights to be derived on a schedule  \n\\- Create conditional notifications/ alerts for changes in google sheets"
                },
                {
                    "author": "sergiogonai",
                    "text": "I have to say that you app looks good. \n\nIt seems it's a mix of Zapier with Bubble. \n\nI'm building [Tribbai ](http://tribbai.com)which allows users to create AI roles and chat with them individually or in a team chat. You can have a meeting with your AI Financial Advisor, AI Marketing Guru, AI Startup Coach, etc.\n\nStill developing but the landing page with signup waiting list is up."
                },
                {
                    "author": "[deleted]",
                    "text": "[deleted]",
                    "replies": [
                        {
                            "author": "Ireallydonedidit",
                            "text": "Bonus points if the name has -ly as a suffix"
                        },
                        {
                            "author": "asksherwood",
                            "text": "Wrappers are, like, the whole economy. \n\nI see 420 in your name - lots of people buy wrappers for that."
                        }
                    ]
                },
                {
                    "author": "Awkward_Ad_9605",
                    "text": "[QuickLaunch](https://quicklaunch.in/) is a tool for Solopreneurs, Indie Hackers or anyone with an idea and wants to convert it into a full fledged product by validation from market data and user feedbacks  \n\n\n**Details**  \nI have been working on this idea, creating an application which would provide AI driven assistance to convert an idea into product  \n\\- through generating realtime questions/answers with user based on Idea to dive deep into specification to convert it into a product  \n\\- Perform a comprehensive analysis for the product including product analysis, market analysis, PMF, Competitor analysis, Business Viability Checks etc, through publicly available data to give an idea a Confidence Score of moving ahead  \n\\- Reddit Post sentiment analysis to understand targetted customer views on the idea  \nand many more steps",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "This great mann!"
                        }
                    ]
                },
                {
                    "author": "[deleted]",
                    "text": "[removed]",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Thats cool mann!"
                        }
                    ]
                },
                {
                    "author": "Independent-Idea6009",
                    "text": "This sounds like an exciting project!"
                },
                {
                    "author": "aiotu",
                    "text": "MyTimeo (https://timeo.me) - ios app for taking daily notes by voice (text is also possible)\nreminders, todo",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Thanks man its helpfull!"
                        }
                    ]
                },
                {
                    "author": "SepticDNB",
                    "text": "I’ve been working with [llongterm](https://www.llongterm.com/) \\- a self evolving memory layer for LLMs/AI apps\n\nYou can try it for free - please feel free to send me a message - we are actively looking for developers to try the product and encourage them to share pain points and feature requests!",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Pretty good man!",
                            "replies": [
                                {
                                    "author": "SepticDNB",
                                    "text": "Did you try it out? Please DM if you’re willing to have a quick chat!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Careless_Heat907",
                    "text": "I'm working on this **AI tool** that takes your photos and turns them into awesome social media posts by coming up with captions and suggesting layouts that match your writing style. The idea is to make it a lot easier for people to create engaging content without stressing out. I'm about halfway through building it, but I'm kind of unsure if there's a real demand for this. Do you think people would actually use it?"
                },
                {
                    "author": "ijorb",
                    "text": "I'm working on \"My voice\", text to speech application to give people who can not speak a nice sounding voice."
                },
                {
                    "author": "niklay",
                    "text": "Working on Triplix, an all-in-one travel planner with an AI Assistant. It can give you suggestion for any question you ask regarding your trip, be it a place to stay, restaurants, tours, etc. we also offer a packing list feature that also works with AI. Just tell where you're going and then AI tells you what to pack. Check it out here: [https://apple.co/3CbkiTi](https://apple.co/3CbkiTi)"
                },
                {
                    "author": "This_Tax162",
                    "text": "Gitpage.site complete website in 2 minutes",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Wow thats great!",
                            "replies": [
                                {
                                    "author": "This_Tax162",
                                    "text": "Thanks. If you want to try it use code ‘gitpage’ 50% discount."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PhilosophyFluffy4500",
                    "text": "Hey, we are about to launch a calculator on our offshoring and outsourcing based websites.\n\nThis tool is designed to help users estimate the cost of offshoring or outsourcing the specific services they need.",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Cool stuff mann!"
                        }
                    ]
                },
                {
                    "author": "Ken_McLoud",
                    "text": "We're building a tool to empower your customer support team rather than replacing them\n\nThe human punches in a ticket number of a text description of the problem and the AI searches through the database to find useful historical tickets.\n\nWe find most thorny technical problems have been solved at least once before, so it has been a real help."
                },
                {
                    "author": "FunFerret2113",
                    "text": "An AI app and chrome extension to capture customer feedback and ideas from all channels and turn it into a Public roadmap."
                },
                {
                    "author": "iojasok",
                    "text": "I built https://thebalanced.news/download-app",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Great"
                        }
                    ]
                },
                {
                    "author": "Elijah_Az",
                    "text": "[growsy.ai](http://growsy.ai) \n\nAI LinkedIn Ghostwriter - so you can write posts you'd write but with AI. \n\n1/ Feed Growsy with your website + other materials \n\n2/ Say growsy which LinkedIn influencers/profiles you like (so it learns how to write posts in that style) \n\n3/ start writing OR share the link to Youtube/Article... to let growsy write a post based on it. \n\n  \nWould love to get your feedback!",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Thats comprehensive man!"
                        },
                        {
                            "author": "Mean_Row721",
                            "text": "Thats comprehensive man!",
                            "replies": [
                                {
                                    "author": "Elijah_Az",
                                    "text": "Thanks!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vikas_19",
                    "text": "[bolmitra.live](http://bolmitra.live) \\- improve public speaking by getting intelligent feedback by AI",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Absolutely great mann!",
                            "replies": [
                                {
                                    "author": "vikas_19",
                                    "text": "Thanks 🙏"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Academic-Voice-6526",
                    "text": "You have done great job, I am sure there is lot more to come.\n\nI am building actionagents (dot) co, the world's #1 platform to hire AI Agents. Love to know your feedbacks.",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Thatss greatt mann! keep working on it.",
                            "replies": [
                                {
                                    "author": "Academic-Voice-6526",
                                    "text": "Thanks for supporting. Really need it 😁. Try checking out and incase you need free credits to explore DM me and I would be happy to provide."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Cherry2477",
                    "text": "I made a Japanese [language learning app](https://fluencytool.my-senpai.com/) for Android .",
                    "replies": [
                        {
                            "author": "Mean_Row721",
                            "text": "Good work mannn! thats pretty cool."
                        }
                    ]
                },
                {
                    "author": "alexrada",
                    "text": "[actordo.com](http://actordo.com) \\> AI Assistant for busy professionals.  \nJust launched a new feature to organize email with custom rules, based on user prompts."
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!"
                },
                {
                    "author": "richexplorer_",
                    "text": "building [PLG OS](http://plgos.com), an all in one customer engagement platform for all your SaaS UX needs, find everything to get started under 1 roof!"
                },
                {
                    "author": "asksherwood",
                    "text": "I built an marketing AI app, along the lines of Jasper, at [asksherwood.com](http://asksherwood.com) . Here's are the low code tools I used, and why:\n\nMemberstack, because it had good subscription management, and had a track record of a few years, with good reviews. These are huge considerations - if I spend a few hundred hours building an MVP, I want to be able to trust the platform I depend on.\n\nWebflow, because Memberstack runs on it. Make for API connections, again because Memberstack depends on it.\n\nSo Memberstack was the big unlock - it felt both powerful and easy. Yes, there were a few head-scratching moments, but I found I could figure things out as I went."
                }
            ]
        },
        {
            "title": "Why Are People So Annoyed by ChatGPT Wrappers? Let’s Talk About It.",
            "author": "sergiogonai",
            "text": "Everywhere you look these days, there’s a new “ChatGPT-powered” app or tool popping up. Some folks can’t stop complaining about how it’s “just another wrapper,” while others are busy building their own. So, what’s the deal? Is it really that bad to have tools that simplify or repurpose ChatGPT for specific needs?\n\nHere’s my take: It’s *fine*. In fact, it’s necessary.\n\nThink about Coca-Cola and Pepsi. They’re both carbonated sugar water, but people still argue over which one is better. Why? Because they *market* differently, taste slightly different, and cater to different preferences. The same goes for ChatGPT wrappers. Not everyone wants to dive into OpenAI’s web app and figure out prompts or advanced features. Some people just need a *tool that solves one problem*.\n\nFor example:\n\n* **DoNotPay** uses GPT to help with legal disputes.\n* **Replika** focuses on emotional connections and companionship.\n* **Jasper AI** is a writing tool specifically for marketing copy.\n\nEach of these apps takes the same core tech and packages it differently. And guess what? People *pay for that*.\n\nNow, let’s talk about the *real clones*. Have you been to the app store lately? It’s flooded with ChatGPT-like apps that *literally* just slap a different UI over the API. Are they shady? Some of them, yeah. But they also sell. People download them because they offer something OpenAI doesn’t: accessibility. Simple interfaces. No overthinking.\n\nHere’s the truth: Not everyone *wants* all the fancy features of ChatGPT. Not everyone has time to figure out how to jailbreak it, create complex prompts, or integrate it into their workflows. A tool that does *one thing well* will always find an audience.\n\nPeople *need simple tools*. ChatGPT is great, but for the average person, it can feel like a Swiss Army knife with too many attachments.\n\nSo, why all the hate? Is it jealousy from developers who didn’t think of the idea first? Is it annoyance from power users who think everyone should just use ChatGPT directly? Or is it just people being people—always finding something to criticise?\n\nWe can disagree and it's ok! \n\nLet’s discuss. Are ChatGPT wrappers overrated, or are they filling a gap that OpenAI itself doesn’t cover? ",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "OptimismNeeded",
                    "text": "I think it’s a target audience thing. \n\nPeople in this sub are part of a Ponzi scheme where most make SaaS products for SaaS makers.\n\nAnd most SaaS makers know they can do with ChatGPT what most wrappers do, so they feel cheated.\n\nOutside of this bubble, most people get shit results from ChatGPT, because they are not savvy users, don’t know promoting, or just unimaginative.\n\nA good wrappper can solve a serious specific problem for a big target audience and fill the gap between specific features OpenAI won’t developed (because the target audience is small for their scale), and needs of specific target audience that are very lucrative for a soloprenuer.",
                    "replies": [
                        {
                            "author": "loganfordd",
                            "text": "'sub are part of a Ponzi scheme where most make SaaS products for SaaS makers'\n\nThis is such a brilliant way to put it. If your product is not something 'revolutionary' people in this sub will attack.",
                            "replies": [
                                {
                                    "author": "StevenJang_",
                                    "text": "'Most make SaaS products for SaaS makers', that was what I felt as a junior back then.\n\nDoesn't changed much it seems."
                                }
                            ]
                        },
                        {
                            "author": "Passenger_Available",
                            "text": "Know what else they called a wrapper? Uber.\n\n“It’s a google maps wrapper”\n\nThey think users care what you are wrapping up?\n\nMan I’m wrapping up so many abstractions here where the guy still coding in assembly will tell me that I’m just building a wrapper around machine code.",
                            "replies": [
                                {
                                    "author": "OptimismNeeded",
                                    "text": "Good point"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Adventurous-Lab9357",
                    "text": "If you look at things that way you could say that all Saas businesses are basically a database wrapper"
                },
                {
                    "author": "Gargunok",
                    "text": "I think its easy to conflate a wrapper around CHatGPT or another LLM that provides a tangibly different service as component in something that solves a particular business need; to a lazy wrapper that exposes a subset of ChatGPT  basically reselling those services.\n\nReselling is basically what we have been doing for years white labeling existing services.  Its not particularly a product to be proud of, as its someone else's work and as a business venture a risk, change, cost, low barrier to competition. Probably short term, can make money with limited investment.\n\nUsing AI to drive additional value can be a long term value proposition especially if the LLM itself can be swapped out rather than the core componet - mitigates all sorts of risk. Solving an actual business problem has more value imo.\n\nI'm actually also surprised more SaaS operators aren't training their own bespoke LLM using the open source ones as a basis.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "Well said. White labeling exists for a long time. Now we call it wrappers. ehehehe"
                        }
                    ]
                },
                {
                    "author": "Yamitz",
                    "text": "Selling ChatGPT wrappers is like selling Facebook clients - there might be a small market, but you’re not really doing anything groundbreaking. Meanwhile everyone here thinks they’re the same as Zuckerberg for doing it.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "Does it need to be groundbreaking? That is exactly the point. \n\nThere are few Elons and Zucks. For the majority to build something and make an income is enough.",
                            "replies": [
                                {
                                    "author": "Yamitz",
                                    "text": "I think people overestimate the market for AI wrappers though, especially if the SaaS is only adding keywords to the users prompts."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hamontlive",
                    "text": "It’s also about a critique of the longevity of the product itself.  Ai is moving so fast that it’s likely your “accounting” wizard will just be available right inside google sheets.  The ai faucet is flowing out so so fast that just feels premature to be capturing it and reselling it when you’d think most people would want direct access to the raw electricity coming out. The gpt wrappers are often not future proof and are frozen in a snapshot of where the ai was at that time."
                },
                {
                    "author": "BraeznLLC",
                    "text": "OpenAI developed a Tool that we all can consider a basemodel, and what everyone else `wrappers` it with are just extensions.\n\nBecause lets be real. AI energy requirements are Way beyond that of what a normal group or person can provide.\n\nSo it is probably safe to say unique AI products that are just `vessels` are scarce."
                },
                {
                    "author": "nifal_adam",
                    "text": "Stop calling it chatgpt wrapper. Call it AI pipeline.   \nYou can make a burger at home but you still go to McD cuz they built a nice assembly line.  \nIm very serious btw",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "That actually makes a lot of sense."
                        }
                    ]
                },
                {
                    "author": "anonuemus",
                    "text": "It's a clear sign that everyone that says this has no clue about software/technology."
                },
                {
                    "author": "TinyGrade8590",
                    "text": "This is a great post thanks for that",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "Appreciate your support! \n\nIt's not only here. I see the same happening in X, that why I needed to make such a post.   \nAnd enjoying a lot of replies."
                        }
                    ]
                },
                {
                    "author": "Lost_Significance_89",
                    "text": "Chatgpt wrappers are lazy businesses. I can already spend 30 dollars a month and i get all the features and future features that openai creates. Furthermore, any business that decides to make chatgpt its foundation for a product is silly because openai could just replicate the features and destroy the smaller apps.\n\nI think ai is overrated in general",
                    "replies": [
                        {
                            "author": "_pdp_",
                            "text": "If you follow that train of logic you could say that running a Rails App is a \"lazy business\" because it wraps the kernel - \"real businesses write their own kernels\"."
                        },
                        {
                            "author": "googlehome12345",
                            "text": "I recently got off my LLM for a prompt because I didn’t want to feed it one of my ideas haha."
                        },
                        {
                            "author": "dthedavid",
                            "text": "What is your business?"
                        },
                        {
                            "author": "Significant-Self-961",
                            "text": "Cursor ai is such a shitty product. They wrap around OpenAI and Anthropic",
                            "replies": [
                                {
                                    "author": "loganfordd",
                                    "text": "I wouldn't call cursor a bad product. it's very convenient to have the power of those two in your IDE. People pay for convenience."
                                }
                            ]
                        },
                        {
                            "author": "sergiogonai",
                            "text": "You can and that is great for you. But my point is that not everyone needs or wants all the features.   \nMany people don't even care about which LLM they are using as long as it does what they need and it's easy to use. \n\nMost people just want the chat. They don't need projects, create gpts, have Operators and much more. \n\nBut for your case you can also use Deepseek instead and it's cheaper! Which is actually based on Chatgpt, so a kind of different wrapper."
                        }
                    ]
                },
                {
                    "author": "_pdp_",
                    "text": "Everything is a wrapper of something. \n\nAt the end of the day you get to vote with your wallet and  some wrappers make money because they provide added value - whether that is convenience or something else.\n\nLet's take even a trivial example that simply wraps the OpenAI API without adding anything else on top. Is it useless? Well, if you manage to get preferential deal with OpenAI (or get to a higher tier) you can offer this as a service to your customers for a small fee. You are selling access and some will find value in that - especially where there might be imposed restrictions for whatever reason.\n\nThere are tons of successful online businesses that wrap something like open source databases, application platforms, etc and sell those to other customers that are looking for convenience, added security / privacy, or extra features.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "That is exactly the point. In the end even DeepSeek is a wrapper of ChatGPT."
                        }
                    ]
                },
                {
                    "author": "good-luck-commander",
                    "text": "People also like to falsely call something a wrapper that is more than a wrapper. Business logic with LLMs powering a core part of that logic. But thats like saying a social media management tool is a wrapper for social media APIs. Doesnt mean its not adding a lot of work and value to that flow. It does get a bit annoying when people  claim their tool does some special stuff or has their own AI when it REALLY only calls OpenAI without doing much else."
                },
                {
                    "author": "cuervo_gris",
                    "text": "Jelousy"
                },
                {
                    "author": "[deleted]",
                    "text": "[removed]",
                    "replies": [
                        {
                            "author": "NPC_HelpMeEscapeSim",
                            "text": "your landing page is not exactly a good advertisement for your product lol",
                            "replies": [
                                {
                                    "author": "[deleted]",
                                    "text": "[removed]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sharp_Preparation600",
                    "text": "yeahh"
                },
                {
                    "author": "Andreiaiosoftware",
                    "text": "because they are everywhere"
                },
                {
                    "author": "TradeApe",
                    "text": "Assuming AI keeps on improving, you simply don't have any significant moat by developing a wrapper. So many of those wrappers are just \"let's make a lot of $ quickly before it dies\" projects that aren't sustainable in the long run.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "It may be. But why not? If it works for some people let them build wrappers. As long as they are users that buy them."
                        }
                    ]
                },
                {
                    "author": "_cofo_",
                    "text": "Are you saying people are selling crappy SaaS to crappy SaaS collectors in this sub?"
                },
                {
                    "author": "idgafsendnudes",
                    "text": "There’s nothing wrong with using chatGPT to enhance a product but if chatGPT is the whole product it means your product is easily replaceable and 100% not worth the money in almost all cases"
                },
                {
                    "author": "Funny_Ad_3472",
                    "text": "There is absolutely nothing wrong with a wrapper if it is priced well. I only find it annoying when it's overpriced and I can pay $20 monthly for it with the original chatgpt.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "Exactly that. If there is a market for and people building, that's all that matters."
                        }
                    ]
                },
                {
                    "author": "Free_Afternoon_7349",
                    "text": "Cars and many other machines are just wrappers around gasoline. \n\nGood car companies aren't necessary also good at extracting and refining petroleum. \n\nI have a feeling it will be similar with foundational models and the apps they are used in.",
                    "replies": [
                        {
                            "author": "doobsicle",
                            "text": "Yep. I’ve always said Dropbox/Google Drive is just a wrapper around FTP. MacOS is just a wrapper around Unix. Things are built on top of other things."
                        }
                    ]
                },
                {
                    "author": "dthedavid",
                    "text": "People who are annoyed haven’t shipped anything.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "Probably... eheheheh"
                        }
                    ]
                },
                {
                    "author": "HeadLingonberry7881",
                    "text": "\"Is it jealousy from developers\" yes"
                },
                {
                    "author": "earthcitizen123456",
                    "text": "Nothing wrong with it. It's your time and resources anyway. Just keep building. If Salesforce can be a billion dollar company then why not yours right?"
                },
                {
                    "author": "Academic-Voice-6526",
                    "text": "Though chatgpt can do lot of things, but these wrappers actually make the user experience and user interface so easy to interact with llm and get response. Just like even after 15+ year of Google existence lot of people don't know how to do smart search, same thing is happening with promoting. There is only small % of users who even knows how to get desired out come from llm. So I think there is not harm in gpt wrappers till the time they are affordable and solving user problem.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "Exactly the point. There are a lot of features on Chatgpt that people don't know how to use. \n\nFor example if all they want is to analyse an image, they can have a wrapper that just does that. \n\nSimplicity is the key often"
                        }
                    ]
                },
                {
                    "author": "GrabWorking3045",
                    "text": "This post is not intended for discussion, it's more about stating an opinion.",
                    "replies": [
                        {
                            "author": "sergiogonai",
                            "text": "That is your opinion!",
                            "replies": [
                                {
                                    "author": "GrabWorking3045",
                                    "text": "Here’s another opinion: if you want to start a discussion, start with a neutral stance. You're clearly biased here. Whoever disagrees will get brainwashed with your ideology. This is just you seeking approval."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fuzzylog1c-stuffs",
                    "text": "I use LLMs' APIs mixed with Google search results to write some financial reports for [valu8.app](http://valu8.app) . So far, nothing special. However, I think the best value provided is through market scans based on any financial metric, which run 24/7, even though alerts are provided weekly. Furthermore, I believe there's untapped potential in leveraging human analysts' intelligence (A.I. = Analysts' Intelligence ![gif](emote|free_emotes_pack|facepalm)) for stock valuations. This approach, which is human-driven rather than AI-driven, could use the right incentives to ensure quality. While this might seem unconventional, I am enthusiastic about exploring this concept further."
                }
            ]
        },
        {
            "title": "Pre-churn survey tools & churn-reducing techniques?",
            "author": "BotDog",
            "text": "Hey everyone - does anyone here run pre-churn surveys (\"why are you leaving us\") and/or has experimented with techniques to reduce churn? I see a lot of products giving out discounts when you churn, but now I know this I always tell my friends \"create an account and stop the subscription they'll give you a 50% discount\". I'm sure this could create some artificially high churn because of this. \n\n\n\nTrying to figure out if it's worth investing time here, if we should build a quick survey ourselves or buy a tool on the shelf (they tend to be surprisingly expensive). Or just focus our energy on building a better product so that people don't churn. Any feedback appreciated! \n\n  \nPS: We typically see a 20% user churn the first month, then this gets to \\~30% total churn on month 4, and then stable from there",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "gaberidealong",
                    "text": "My experience is in B2B Customer Success and it sounds like you are referencing B2C, but I'm sure the same principals apply. 3 things come to mind:\n\n1. Monitor Customer Health: If they are already giving notice of leaving it's too late. How is your back end analytics? I would dive deep into what the leading indicators of churn and what were your customers doing (or not doing) 3-6 months before leaving. I would then chart those behaviors and start to create a customer health scorecard where you can preemptively identify churn and proactively intervene (send knowledge base articles, automated emails, etc)\n\n2. Onboarding: With such high churn on the front end how is your onboarding? How do you track adoption on your onboarding? There is a term called Time to Value which is basically how quickly your users get value out of the product. I would suspect there may be a something going on there\n\n3. Post Mortem Survey: IMO I find those hey we'll give 50% if you leave tacky beuase it makes me think why didn't you just give me that price to begin with? And now I feel like I wasted money. I would send an anonymous survey just asking for general feedback on why there are leaving and taking a look at the responses.\n\nMy 2 cents. Happy to answer any questions"
                },
                {
                    "author": "CrimsonRider_FrostBy",
                    "text": "Sounds like a classic case of discount gymnastics—invest in the product and watch them stick around instead of playing the churn game like it’s a circus act!"
                },
                {
                    "author": "285_traffic",
                    "text": "Depends on if this is B2C or B2B. \n\nAlso depends on if you’re doing a freemium or PLG GTM model. Based on that it’d be easier to answer. One way to drive down churn is to raise the initial price so that way only “serious” people sign up. \nYou’ll have lower volume but higher CLV which will help drive down CAC:CLV ratio. \n\nThe discount at cancel is very much wired into the B2C realm. B2B for PLG for sure not generally not for sales led motions. \n\n30-50% churn over the 1st three months also signals that you’re GTM messaging is probably far too broad. Product might be cool but the messaging to get people in the door might not be aligned with what your product truly derives value from."
                },
                {
                    "author": "richexplorer_",
                    "text": "pre-churn surveys can work, but keep them super simple, 1-2 questions max, like *\"Why are you leaving?\"* and maybe a free text option. Trigger it during the cancellation process.\n\nDiscounts can backfire if they’re overused. Try offering options like pausing subscriptions or highlighting underused features instead of just slashing prices.\n\nFor building vs. buying: If you’ve got the dev resources, a basic survey is easy to build. Otherwise, tools like ChurnZero or Gainsight might be worth it if you need deeper analytics.\n\nThat 20% first-month churn sounds like an onboarding issue, focus on getting users to see value faster.\n\nIf you want to save time on churn reducing features, check out [PLG OS](http://plgos.com). we provide ready-to-use components that can help you reduce churn for your SaaS . I’m one of the co-founders, happy to share more if you're interested!"
                }
            ]
        },
        {
            "title": "Is $10k too much for an influencer with 1M followers?",
            "author": "neverviraly",
            "text": "I have a SaaS product and this tech influencer wants $10k for one post. They have 1M followers and decent engagement in the tech space. Most of their content is about general tech though (product reviews both hardware and software). I've seen others charge way more but also way less.\n\nSome people are telling me to go with micro influencers instead. Has anyone had any success with these big influencers? Would it be better if I promoted it with a bunch of smaller creators instead of one big creator?",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "punkpang",
                    "text": "You have no guarantee that $10k will convert into meaningful income for you. You didn't state who the audience is, what's the demographic breakdown or whether half of those are bots or not. \n\nWhat I'd want to know before parting with 10k is what I could expect from conversion (at least the minimum) and whether my ideal user profile even exists among the followers. \n\nTL;DR: I'd pass."
                },
                {
                    "author": "pilotcodex",
                    "text": "It won’t produce any output like you think. Most promotional posts are ignored by people or skipped.  \n\nI’d say you can make money maybe putting that into paid ads",
                    "replies": [
                        {
                            "author": "ciliandiaz",
                            "text": "Absolutely! Anything labeled as promotion or sponsored is clearly marketing, so I don’t trust it at all."
                        }
                    ]
                },
                {
                    "author": "Good_Cockroach_6357",
                    "text": "bro that's WAYYYYYYYYYYY lot. you can buy targeted marketing for way less like $1000 A MONTH"
                },
                {
                    "author": "Beneficial-Being-821",
                    "text": "You can do much better marketing than spending on one influencer"
                },
                {
                    "author": "igrowsaas",
                    "text": "I'd suggest starting with smaller influencers to test the waters first."
                },
                {
                    "author": "EmersynMarry",
                    "text": "$10K for 1M followers *can* be worth it, but only if their audience is **highly engaged and aligned** with your SaaS product. The biggest issue with macro influencers is that their audience is often broad, and if they mostly do product reviews, their followers may not be in *buying mode* for your specific solution.\n\nInstead of putting all your budget into one big influencer, I’d recommend **testing multiple micro-influencers** (10K–100K followers). They tend to have higher engagement rates, niche audiences, and more trust with their followers. Plus, for $10K, you could get 5-10 micro-influencers, meaning more touchpoints and more chances for your message to land.\n\nAnother thing to consider: instead of spending $10K on a one-time post, I’ve had *way* better ROI by **directly reaching potential users through Instagram outreach**. I automated it in a way that still felt personal, and the cost was a fraction of what I would’ve spent on influencer marketing. If you want to maximize ROI, that might be worth testing before dropping big money on a single promo post. Happy to share more if you’re interested!"
                },
                {
                    "author": "askoshbetter",
                    "text": "SaaS marketer here. If your product is viraly, as I saw in one of your past comments, influencer, even micro-influencer marketing is not the avenue you want to go down yet. \n\nYour audience of smaller social media agencies have incredibly tight budgets and tend to use freemium tools -- like why should they switch from HootSuite, Sprout Social, Buffer, etc., to you? -- now before you go off on me -- I know you're not competing directly against these products. Still, these products have some analytics functionality built in. \n\nI'd do these things first: \n\nWEBSITE \n\n1. Your website needs to demonstrate more value \n\n2. You should have testimonials and case studies \n\n3. You should create urgency and have an offer   \n  \nORGANIC SOCIAL \n\nYou should become an influencer yourself -- CEO/founder influencers are all the rage right now, like literally every day start posting helpful content for your ICP \n\nSEO, AIO, Video SEO, Image SEO, Barnacle SEO\n\nGoogle search phrases related to your brand and aim to emulate and take placement from all the existing results -- including AI roundups \n\nIf you've got help on your team have them post as well\n\nIMPROVE YOUR PRODUCT and PRODUCT ONBOARDING  \n\nYou can have great marketing and CRO, but if your product itself doesn’t drive adoption or usage you’re going to have a bad time. Have solid onboarding flows, docs, email communications etc\n\nLINKEDIN DMS   \n\\- I've had a lot of success with automated personalized LinkedIn dms using dripify. Waalaxy and some others are out there as well. The message I send is like*: Hay \\[first name\\], I see you like this thing. That means you must do XYZ. I'm from \\[Company name\\], which makes you better at XYZ -- if this sounds helpful, give it a try/book a demo etc --* \n\nAll of the above is easier said than done of course. Building a product and driving adoption is extremely hard. \n\nMy vote would be to save your money for when you know PMF is solid, your website will drive conversions, and you have a high rate of product adoption after sign-up. \n\nbest of luck!",
                    "replies": [
                        {
                            "author": "WAHNFRIEDEN",
                            "text": "Reels don’t require you to play CEO role in your videos you can try various marketing formats until you find one that doesn’t feel like an ad and gets millions of views"
                        }
                    ]
                },
                {
                    "author": "Key-Hyena5292",
                    "text": "Too expensive 😪 🤧"
                },
                {
                    "author": "andreea_carla_b",
                    "text": "Just to add: If you have 10k to burn, I'd probably test out google ads or something like that."
                },
                {
                    "author": "MaximumMood9075",
                    "text": "This is the worst idea I've heard in a while."
                },
                {
                    "author": "pokemonplayer2001",
                    "text": "I bet you can find better ways to spend $10k."
                },
                {
                    "author": "Oleksandr_G",
                    "text": "It's a dilemma. They (influencers) are not willing to work for less. We (businesses) can't make our unit economy work paying 10k for a piece of content. \n\nThat's actually one of the reasons why creators and influencers don't want to do revenue share. They know they can't make it work for both of us.",
                    "replies": [
                        {
                            "author": "seattext",
                            "text": "as infuluencer or you get 10$k from idiots or get $1k from revenue share. what would you choose?  of course you will be picthing to startups who have no idea how marketing works for 10$k. and once a monht you will find idiots."
                        }
                    ]
                },
                {
                    "author": "seattext",
                    "text": "PFFF. one of my friend pay 300$ for 2m guy in his niche on linked in. 4 orders \\*20 buck each. DONT DPEND YOU MONEY ON INFLUENCERS. First of of all reach will be low, second it rasnlates to 0.1-0.8% ctr, and then 1-3% conversion from your visitor to sales at best. you can easily tell 1 that 1m for 10k will NEVER PAY OUT. sign a deal for 70% of revenue paid from post to influencer and thats all."
                },
                {
                    "author": "quick_code",
                    "text": "30% fix payment + rest through affiliate link for revenue share"
                },
                {
                    "author": "Viper4everXD",
                    "text": "Influencers are for when you have F*** You money when you can risk their lack of roi not hurting you. Otherwise I wouldn’t do it."
                },
                {
                    "author": "Winter_Hurry_622",
                    "text": "Yes if it's a youtube video 10k is ok, but for just a post it's expensive."
                },
                {
                    "author": "nooshdev",
                    "text": "Yeah."
                },
                {
                    "author": "inglandation",
                    "text": "Sounds quite expensive. In my field I heard this number quoted for a YouTuber with 6M subs. What really matters is the views in the latest videos though. The number of subscribers is almost irrelevant."
                },
                {
                    "author": "ForgotMyAcc",
                    "text": "Followers doesn’t mean much. Engagement and target audience is the metrics you’d want to look at. How many clicks do they get on their affiliate links? What is the overlap of their audience and you ICP? What is the overall traction for their videos reviewing software such as yours - does their video show up in search results in related searches etc etc. And on your side, what’s your budget for this like? What do you expect that your investment will return? Leads? Controversy and attention? Straight up sales?\n\nSo much more context is needed to answer your question. But GL to you, hope you make a good investment!"
                },
                {
                    "author": "Responsible-Cap-5715",
                    "text": "Start by paying micro influencers most charge like 200 dollars to 500 or a thousand, instead of paying 1 you can pay 10-20"
                },
                {
                    "author": "chinga-te",
                    "text": "Ask for reviews from influencers but first, warm them up, follow, engage, converse with them.. build trust, then ask for help— offer them an affiliate %. Get creative— they too need content so it needs to be relevant. \n\nFind 20 curated niche influencers and engage them on all their channels so they see you. \n\nOr you can piss away $10K"
                },
                {
                    "author": "ciliandiaz",
                    "text": "When I used to run influencer campaigns, I typically had influencers use an affiliate link over an extended period of time rather than just doing a single post. This allowed us to track progress and measure any sales generated. We less likely paid upfront because some influencers are aware they have an engaging community, which is precisely the criteria you’re looking for. However, if you’re only looking for a quick shoutout, $10K is definitely too high."
                },
                {
                    "author": "sweetchiicka",
                    "text": "I had the same question about something similar. A newsletter with nearly 2M subscribers. Paid 400 USD. Barely 200 visitors (3-4 signups).",
                    "replies": [
                        {
                            "author": "normellopomelo",
                            "text": "what's your customer lifetime value? sounds like an ROI",
                            "replies": [
                                {
                                    "author": "sweetchiicka",
                                    "text": "They were free signups.\n\nBut yes, if one or more convert then it could cover.\n\nI think OP is expecting something substantial for 10K."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "goodpointbadpoint",
                    "text": "1M followers => ask them to share the demographics, the industry details etc if available\n\nhow likely is that their audience is your target audience ?",
                    "replies": [
                        {
                            "author": "goodpointbadpoint",
                            "text": "narrowly targeted linkedin ads might give you more relevant impressions. but ad must be made interesting. like a content or offering something - like a report etc.",
                            "replies": [
                                {
                                    "author": "goodpointbadpoint",
                                    "text": "is this for - [https://www.getviraly.com/](https://www.getviraly.com/) ?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Marc_Fb",
                    "text": "Yes it’s too much brother"
                },
                {
                    "author": "fangaas",
                    "text": "Organic results are not what they used to be, if I was you, get multiple good quality posts from micro influencers at a fraction of the cost, then run ads from the most successful piece of content. \n\nI work in an influencer marketing SAAS company and our platform automates this process (on an enterprise level) if you want more advice my DM's are open."
                },
                {
                    "author": "Broad_Minute_1082",
                    "text": "Anyone who actually has the budget / authority to spend on SaaS products aren't swayed by sponsored segments."
                },
                {
                    "author": "andreea_carla_b",
                    "text": "It depends. Is it youtube? Is it a dedicated post/video?\n\nWe tried with microinfluencers, and honestly, it flopped. We haven't tried bigger influencers, but our own YT channel is helping a lot.\n\nUsually, with influencers, it's a hit or miss. They need to be aligned with the product so people actually get influenced."
                },
                {
                    "author": "Remarkable_Novel_391",
                    "text": "Too much. Better go the revenue share route with decent upfront payment instead."
                },
                {
                    "author": "ruspow",
                    "text": "don't pay influences, give them an affiliate code to track the revenue they generate"
                },
                {
                    "author": "Hellob2k",
                    "text": "I think the answer is rather simple. If you see this partnership as a means to produce a return on your investment, it doesn’t matter if the influencer charges 1 million dollars. \n\nIf it makes your company money then it’s always going to be worth it. The question now becomes, if this partnership is going to make you money. That’s the question that needs to be answered, and if your anything except confident, it’s not worth it."
                },
                {
                    "author": "Ok_Possible_2260",
                    "text": "Are they real people? Do they have high engagement? A million followers means nothing if their posts are only getting three likes."
                },
                {
                    "author": "Kliiq",
                    "text": "Go smaller"
                },
                {
                    "author": "gthing",
                    "text": "Ask them how many conversions they'd bet you get. If the number being true makes a good investment, then divide 10k by that number and tell them you will pay them that much per conversion. If they believe what they told you, it should be no problem."
                },
                {
                    "author": "rifatuxd",
                    "text": "For only one post, I think it's too much"
                },
                {
                    "author": "alexrada",
                    "text": "it depends on the results. Seems a lot, but if it brings you a positive ROI, that's good.  \nI'd go with micro influencers as first time try."
                },
                {
                    "author": "ActionJ2614",
                    "text": "Better ways to spend that money.\n\n* Make sure your website is SEO Optimized\n* Case studies / use cases and testimonials on your website,\n* Consider G2, TrustRadius, Capterra for user reviews\n* Make sure your ICP (Ideal Customer Profile) is clearly defined, your personas, you know who the primary decision makers are, etc. What their primary pain points are and how you clearly and concisely can solve them\n* Leverage customers and their network for referrals\n* Leverage partner relationships you may have, does your SaaS add value to another platform look at those for partner in's.\n* Leverage LinkedIn, your connections, post value added articles on your LI company page (not promotional), tag to profile, if you have employees have them repost or point to those articles. Start building a presence there is LinkedIn is where your target is at.\n* Use Dripify to automate LinkedIn connection requests\n   * You can create cadences, A/B test messaging, import contacts from LI (having Sales Navigator makes a big difference), You can determine messaging, how many steps, how long it runs etc.\n   * Make sure you limit the outbound requests to start, there is a control in Dripify\n   * Be aware LI has a connection limit for both regular LI and Sales Navigator (I believe Sales Nav is 150 connections per user profile a week)\n   * Start with a basic connection request, don't make a pitch or ask in that 1st connection request\n      * Example\" I thought we could benefit from being contacted regarding AI, and effective prompting for LLM, chatGPT etc.\n      * Next, could be I am curious what is important to you as it relates the X, Y, Z,\n      * From there you can iterate and have CTA's if no response to the first 2\n* Make sure your domain is DKIM, SPF, DMARC configured for email campaigns, should you use them, make sure you have a warmer set up\n* Run account based or targeted campaigns, that actually add value, help who your targeting solve there pain points. Add value added info that might not be directed related to your product but is a pain point and or could potentially be in the same ecosytem. The play is to make you look and become a valuable resource/organic traction\n* Figure out where your target audience (ICP, Personas) where do they communicate, what information do they consume, what websites etc. How do they get that information.\n\nThat is some basic info, there is so, so, much more. Just some things from having 8 years sales experience selling Enterprise SaaS, On-prem, hybrid applications, with start-ups and larger companies. (workload/workflow automation, RPA, No-code, XR (MR, AR, VR), and Privacy software. (Senior AE, that has helped with building out territories, marketing, channel partners, etc. jack of all trades lol)\n\nOh, set up your internal processes and systems, have some frameworks."
                },
                {
                    "author": "ChairMaster989898",
                    "text": "share your saas and i'll find you the best creators and other marketing channels!"
                },
                {
                    "author": "Practical-Junket2209",
                    "text": "Go for 20 micro influencers for $500 each"
                },
                {
                    "author": "pcrowd",
                    "text": "No fucking way!!"
                },
                {
                    "author": "godiscon",
                    "text": "Why not do marketing , You can generate a lot more leads from just meta ads , If you need help with it lmk i have been doing it for a while and help with it"
                }
            ]
        },
        {
            "title": "Time for self-promotion, what are you building in January, 2025?",
            "author": "vlado86",
            "text": "Use this format:\n\n1. **Startup Name** \\- What it does?\n2. **Problem**: What problem does it solve?\n3. **ICP** (Ideal Customer Profile) - Who are they\n\nI'll go first:\n\n1. [https://lyly.app](https://lyly.app/) AI-powered screen recordings to create beautiful product demos and easy-to-understand async messages & walkthroughs.\n2. Problem -  Creating video assets & clear walkthroughs takes hours and lots of retakes. We're simplifying it with an AI screen recorder that lets you create videos in minutes.\n3. ICP - Our target persona are product managers, founders, product marketing managers, engineers & designers.\n\nLet’s hear about your projects—what did you build in 2025? Drop your stories below! \n\nP.S. Don’t forget to upvote this post to help other business owners discover some awesome SaaS solutions.",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "JoePatowski",
                    "text": "https://datawing.ai - lets you have a conversation with your data, delivering instant answers to your questions, custom data alerts, and create reports by connecting to your favorite tools and simplifying analytics for everyone. \n\nProblems solved: having to deal with multiple dashboards, lack of time to do data research, not finding the data you’re looking for, combining data from multiple sources to get a better overall picture, data analysts are backlogged and need a self-service platform for their team.\n\nICP: marketing teams, small business owners, SaaS founders, data analysts",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "You should add a product video/product screenshots so users can imagine how easy it is to work with it. That could be your selling point, the easy of navigating data that does not require strong analytical skills",
                            "replies": [
                                {
                                    "author": "JoePatowski",
                                    "text": "It’s coming very soon :) the waitlist is going to be to see all of the features first since it’s fairly large and they’ve been riding with me this far lol. Then I’ll add all of that to the new website."
                                }
                            ]
                        },
                        {
                            "author": "GrabWorking3045",
                            "text": "How many fake voters do you have?"
                        }
                    ]
                },
                {
                    "author": "Spare-Island-5277",
                    "text": "[makeclips.com](http://makeclips.com) \\- Easily create faceless videos to promote a site/app or grow a following. Includes an AI UGC template where you can generate a video of a person in a car looking shocked, include a text overlay like \"I can't believe I found this app that \\[your value proposition\\]\", then include a screen recoding of your product to make viral videos\n\nProblem: It's hard to promote your product on social media and lots of people do not like showing their face.  Hiring UGC creators can quickly become expensive\n\nICP: App developers, ecommerce store owners, and marketing agencies who want an affordable short form video strategy instead of paying creators"
                },
                {
                    "author": "Remarkable_Novel_391",
                    "text": "[ExtensionHub](https://www.extensionhub.io/)\n\nOne stop platform for browser extension developers and enthusiasts to showcase, discover, buy and sell browser extensions."
                },
                {
                    "author": "phil9l",
                    "text": "🌶️ https://spicee.me – made a small app with my GF to spice up the intimate life: track time, locations, added a couple of challenges. It really changed the relationships, so we gave it to a few friends, who are happy users now too. Made a landing page to see if I should keep it for us or scale.\nUsers: anyone who wants to add more fun to their relationships.",
                    "replies": [
                        {
                            "author": "the_grayhorse",
                            "text": "What happens when people break up?",
                            "replies": [
                                {
                                    "author": "phil9l",
                                    "text": "So the app implements the following concept: \n- Personal space: you can track your own activities, solo, with any partner, with multiple partners; you can specify your partners manually \n- Couple space: you can create and invite a partner to the space; activities tracked here also appear in both (or even more) partners' spaces. \n\nYour personal space always stays. \n\nIf you break up, you can: \na) Just leave the space, you can keep data in your personal space or wipe it\nb) Archive it, so you still have access to memories but it's not on the main list (if you want to hide it completely, there is an option to PIN-protect it; you won't see it on any list; it looks like it doesn't exist; and only if you enter the correct PIN it appears; so even if your new partner checks the app, they won't have a way to tell if there are any hidden spaces or not) \n\nYou can switch between spaces the same way as you switch between your Google accounts. In theory you can have a personal one and as many couple ones as you want."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Aggressive_Initial60",
                    "text": "Hi,\nI Build [StatementSheet ](https://statementsheet.com/)\n\nIts a online accurate bank statement converter for convert any PDF Bank statements to Excel & CSV"
                },
                {
                    "author": "FeistySchedule3693",
                    "text": "[MX Suite](https://mxsuite.co/) \\- Email Deliverability and Warming Solution\n\nProblem: Email marketers and businesses struggle with low open rates, high bounce rates, and poor deliverability due to sender reputation issues. MX Suite helps solve these problems by offering automated email warming and deliverability solutions to ensure emails reach the inbox.\n\nICP: Our ideal customers are email marketers, digital marketers, business owners, and cold emailers who need to improve their email deliverability and sender reputation to boost engagement and conversions.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Great tool! For your website hero message, you should include some metrics on how much spam prevention you can offer, e.g. reduce it by factor of 10 or x% reduction of hitting spam boxes",
                            "replies": [
                                {
                                    "author": "FeistySchedule3693",
                                    "text": "Thanks for the great suggestion! We're in the phase of working on our UI, and that’s definitely something we’ll think about."
                                }
                            ]
                        },
                        {
                            "author": "Creme-Low",
                            "text": "I would love to test this product.  I have an approx 20k email list"
                        }
                    ]
                },
                {
                    "author": "tvoutfitz",
                    "text": "1. [https://callio.com](https://callio.com) \\-- an AI-driven marketing and content management platform.   \n2. Problem -- founders and startups know they need to pursue a multi-channel marketing strategy, but most aren't ready to hire a FT marketer or agency. Our tool uses AI to allow anyone to build and execute am marketing plan that maximizes impact across channels.    \n3. ICP -- founders, startup teams, small businesses, and really anyone who wants to market their business in a hollistic and sustainable way!",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "It looks great, I can see how this could resonate with a team, but it's a bit unclear what would be the value for a single founder. Maybe you could also outline that to solve the cold start problem",
                            "replies": [
                                {
                                    "author": "tvoutfitz",
                                    "text": "I appreciate the feedback!  The idea is that you see a lot of generic advice for solo founders to the effect of \"create an SEO strategy\" or \"Start doing social media content\" etc. But those sorts of endeavors are only really impactful if they are done in an ongoing, perpetual way and one that reuses content across all channels.  Coming from my years of managing content and marketing teams, I have found that a unified, multi-channel marketing calender is the best way to manage this, but even creating a schedule and developing campaigns is something that takes some know-how.  So our product is designed to guide folks to build a strategy in an automated way that uses AI to fill in those blanks. We're still building this but the idea is that as a founder, you tell our App about your business, your experience level and goals, and instead of it just giving you some blog posts to copy to your CMS or something, it works with you to develop a complete, integrated strategy. \n\nHope that makes sense -- and yes, I am very aware I need to work on being able to deliver this pitch in fewer words :)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dariushabbasi",
                    "text": "I'm building new version of [Altern](https://altern.ai/)"
                },
                {
                    "author": "aiotu",
                    "text": "[MyTimeo](https://www.timeo.me) – A voice-based task planner for iOS that turns your spoken thoughts (e.g., “I need to do X, Y, and Z”) into organized to-do lists.\n\n**Problem**: People often forget tasks or feel overwhelmed by complicated planning tools. MyTimeo solves this by providing a simple voice or text input to quickly capture ideas and set reminders. The goal is to reduce friction so you can focus on completing tasks instead of wrestling with complex interfaces.\n\n**ICP**: Individuals who juggle multiple routine tasks and want a frictionless way to stay organized (busy professionals, students, parents) and anyone who values quick, minimal-effort planning via voice.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Great site! Simple and down to the point!"
                        }
                    ]
                },
                {
                    "author": "Coolzie1",
                    "text": "SimpleOTA - A platform for IOT devices to connect for software download and data logging. It's in Beta now, looking for beta users if anyone is making IOT devices, and is willing to give it a shot and some feedback of what works for them and doesn't.\n\n[SimpleOTA](https://www.simpleota.com)",
                    "replies": [
                        {
                            "author": "Spirited_Set7240",
                            "text": "So if i upload my firmware in your website will it get downloaded into on field iot device?"
                        }
                    ]
                },
                {
                    "author": "snow_princess",
                    "text": "I am building SummaBook (https://www.summabook.com/) - a technical book summary app aimed at software engineers! :) Think Blinkist/Shortform but for technical people - would love some feedback! 🙌\n\nProblem: technical books are complex, dense & time consuming\n\nICP: Software Engineers who want to learn and advance quickly in their careers👏"
                },
                {
                    "author": "Appropriate-Garlic41",
                    "text": "https://www.promptsforeveryone.com prompt library",
                    "replies": [
                        {
                            "author": "Creme-Low",
                            "text": "Would love to test your site. I have made some good prompts for ymyl and eeat for medical page"
                        }
                    ]
                },
                {
                    "author": "Kimeur",
                    "text": "[MockFlick](https://MockFlick.com) - 3D animated clothing mockups \n\nProblem: POD business need to flex on the market and to create originality content, MockFlick will help create 3D Mockup for t-shirt\n\nICP: POD business",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Nice use case! It's great to focus first on a niche industry and niche use case to become best in breed solution for a particular problem, well done!"
                        }
                    ]
                },
                {
                    "author": "Ok_Essay_6476",
                    "text": "[https://goleads.me/](https://goleads.me/) \\- Free Premium Verified business leads (potential clients)"
                },
                {
                    "author": "Comfortable_Long3594",
                    "text": "1. [https://epitechintegrator.com/](https://epitechintegrator.com/) An easy to use data integration tool\n\n2. Designed for non-technical small business managers and others with limited data management skills.\n\n3. Ideal clients are Managers and Founders in Telecommunications, Government and Public Sector, \n\nHealthcare,  Financial Services and Small Business"
                },
                {
                    "author": "tone-row",
                    "text": "[flowchart.fun](http://flowchart.fun) \\- Text to Flowcharts  \nProblem - Flowcharting Software doesn't work as quickly or intuitively as people think. It's good to have an option which is closer to taking notes.  \nICP - Teachers or Students, Project Managers, Manufacturing Process and Customer Support Flows",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Nice! You should play around the idea of canvas, there are multiple angles to explore such as presentations, technical flowchart and many more. The more you focus on specific workflow, the higher is the addressed pain and your chance to monetize it"
                        }
                    ]
                },
                {
                    "author": "milkyral",
                    "text": "1. **Startup Name** \\- MEGA SEO ( [www.megaseo.ai](http://www.megaseo.ai) ) \n2. **Problem** \\- Fully automates SEO end to end: keyword research + sourcing ideas from Reddit / YouTube -> high quality content gen -> publishing to your blog -> optimizing content over time automatically\n3. **ICP** (Ideal Customer Profile) - Startups and SMBs!"
                },
                {
                    "author": "gujuvenile",
                    "text": "https://linkomatic.ai\n\nAi powered\nSuper duper big list making\nSuper duper duper fast\nBacklink prospect list building tool\n\nDemo: https://app.storylane.io/share/0sf2lvpazqbd"
                },
                {
                    "author": "UX_Forward",
                    "text": "[https://www.uxforward.com/flyingcats](https://www.uxforward.com/flyingcats) \\-  This guide shows you how to create playful flying cat images for any website platform. It’s beginner-friendly and perfect for anyone looking to add a fun, unique touch to their site.\n\nNot a fan of flying cats? No problem! You can swap out the cat images for literally anything you want. Want flying tacos? 🚀🌮 How about some dancing unicorns? 🦄✨\n\n**Problem:**  \nYour website feels plain and uninspired. You want to make it stand out, but you don't know how to code, and hiring a developer is out of budget. Flying cats—or any flying image—can make your website fun, memorable, and engaging again.\n\n**ICP:**  \nCreative DIYers, small business owners, and designers managing their own websites who want a unique, personalized site but lack coding knowledge or a large budget."
                },
                {
                    "author": "loganfordd",
                    "text": "[techblitz.dev](http://techblitz.dev/)\n\nBeginner programmers wanting to learn web-based technologies whilst on the go",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Nice! This looks like a really great service! I am a bit of self-taught coder and when I started I'd love to have a service like this!",
                            "replies": [
                                {
                                    "author": "loganfordd",
                                    "text": "appreciate it!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "glozo_michael",
                    "text": "[https://glozo.com](https://www.glozo.com/?utm_source=reddit)\nProblem: Assist recruiters in locating candidates not typically found in conventional sourcing tools using a proprietary search engine\nICP: Recruiters"
                },
                {
                    "author": "Floloppi",
                    "text": "[Tabsence: Inactive Tab Manager](https://chromewebstore.google.com/detail/tabsence-inactive-tab-man/eacpmniepmclkjbkpgfipegppjnddpam)\n\nThis Chrome Extension closes unused tabs automatically, so you dont end up with 250 opened tabs that wont be used anyway. Saves you some lifetime and boosts your productivity!"
                },
                {
                    "author": "johnyeocx",
                    "text": "[https://useautumn.com](https://useautumn.com) \\-- Clerk for pricing plans. Today auth, DB, analytics are all up in one line of code, if not minutes. Pricing should be the same, no need to handle 282 webhooks, upgrades / downgrades, etc.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Great service!"
                        }
                    ]
                },
                {
                    "author": "Yashraii",
                    "text": "FileO.co\n\nA file management system that can literally save you a lot of time if you deal with large amount of files"
                },
                {
                    "author": "Cris_STEM",
                    "text": "**Startup Name**: Holidays Best Buys\n\n**What it does**: Curates the best holiday deals, discounts, and coupons on Amazon, focusing on Christian books and music.\n\n[Holidays Best Buys](https://www.holidaysbestbuys.com/)\n\n**Problem**: Finding quality Christian books and music at discounted prices can be time-consuming. Holidays Best Buys simplifies this by providing a regularly updated catalog of the best deals available.\n\n[Holidays Best Buys](https://www.holidaysbestbuys.com/)\n\n**ICP (Ideal Customer Profile)**: Individuals seeking Christian literature and music, including church members, religious educators, and anyone interested in faith-based content.\n\nFeel free to use this template to share your project in the Reddit thread!"
                },
                {
                    "author": "kNeoAI",
                    "text": "App.kneoai.com\n\nTravel guide for cities. LLM Chat, Data feeds. 3D Story telling maps. \n\nAnyone going to Paris, Rome, Florence or Milan. Now. \n\nAnd London or Athens by May 1."
                },
                {
                    "author": "waslahsolutions",
                    "text": "https://myrezumai.com - ai powered toolkit for job seekers. \n\nCurrently has 3 tools, an ai resume builder + job specific optimizer, a job specific cover letter generator, and a job tracking system. \n\nThis upcoming Monday however we will be launching 3 more tools. Easy apply job board, LinkedIn network builder, ai interview helper.\n\nProblem(s):\n\nOriginal: Getting auto rejected when applying to jobs. \n\nNew: More general problems job seekers face, it still solves the original problem but the new tools will help to further support job seekers in their job search as well as make their lives easier.\n\nICP - Anyone seeking a job, primarily STEM jobs but can be used for any industry.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Nice! You might want to add some additional formatting to your resumes, like dividers and center-aligned contact information on top which are a standard in the US market"
                        }
                    ]
                },
                {
                    "author": "dylpickle300",
                    "text": "[trackables.me](http://trackables.me) free beautiful habit tracking"
                },
                {
                    "author": "dougthedevshow",
                    "text": "1: [Tackleboot](https://tackleboot.app) - log incremental progress on tasks\n\n2: Not being able to mark something off a todo list when your in progress is demotivating. This lets you log your progress and chip away at tasks.\n\n3: those with large tasks that can’t (or don’t want) to be split into smaller ones. IE long math assignments, books, etc"
                },
                {
                    "author": "JasonJ-Tarvent",
                    "text": "r/Tarvent \\- an email marketing platform that is modern, intuitive, flexible at any skill level, and most of all, affordable.\n\nWe find far too many companies complaining about rising prices of email marketing service providers that charge for features that cost no money to implement. We also learned that many platforms are slow and archaic and focus on the dollar more than the customer.\n\nWe take a different approach. Our platform offers only one plan. You get every feature and pricing is solely based on the number of contacts you have. We offer features like multivariate campaigns (A/B testing but with up to 10 variations) that cost more than $5k per month at Sales Force Marketing Cloud, yet isn't expensive to implement.\n\nYou will also find that everything is laid out logically, where you'd most likely expect everything to be. We also try hard to eliminate any stopping points, such as when you need to add a new field when importing your contacts. This makes you more efficient and saves us money on rendering a ton of HTML as you get to where you have to go.\n\nLastly, we're very transparent. We actually show you why an email bounced (the actual error), who reported you as spam, the exact timing of things, and many other data points other ESPs hide because it could make them look bad. We're as honest as they get, tell it how it is, and will take the hit if it's our fault. We'll even apologize and get the problem fixed ASAP. We never see that from our competitors.\n\nThe bottom line is that our goal focuses on a win-win partnership with customers, not the dollar. That has allowed us to grow fast, and be profitable. We're now in 88 countries, send millions of emails, and are critical to some of the largest companies in the US, and that's from that last 6 months of growth.\n\nCheck out [Tarvent ](https://tarvent.com)and let us know what you think.\n\nFor all you developers out there, we support transactional email via our GraphQL-based API so you can send emails from your apps with ease and get great reporting.\n\nAlso, we're looking for partners that we can refer customers to that can all refer customers to us."
                },
                {
                    "author": "ZerocratAccounting",
                    "text": "Zerocrat: The privacy-focused accounting suite, completely end-to-end encrypted with a zero-knowledge architecture.\n\n[https://zerocrat.com/](https://zerocrat.com/)\n\nOur ideal customer has already bought into the privacy lifestyle, using password managers, encrypted email, hardware keys, chat apps, etc. We aim to serve the entrepreneurial subset of this market segment.\n\n![gif](giphy|U2XNoyO16Yg5VmFkq2)"
                },
                {
                    "author": "kkiru",
                    "text": "Working on two main apps for now: \n\nTinder to decide what to eat: [https://whatdinner.com/](https://whatdinner.com/)\n\nLearning a language by learning sentences: [https://apps.apple.com/us/app/fluent-read-ai-language-learn/id6738277606](https://apps.apple.com/us/app/fluent-read-ai-language-learn/id6738277606)\n\nSo well so far!"
                },
                {
                    "author": "itguygeek",
                    "text": "I'm building [CostMeet ](http://www.costmeet.com) not a SaaS but just a fun tool to calculate meeting cost",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "This could work well as a chrome extension, where in gcal it would show you the expected cost of a meeting, that way user wouldn't have to enter data themselves which lowers the friction to use it"
                        },
                        {
                            "author": "the_grayhorse",
                            "text": "not working",
                            "replies": [
                                {
                                    "author": "itguygeek",
                                    "text": "I corrected the link"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Certain-Issue-4016",
                    "text": "[LiteAssist](https://liteassist.com) offers customizable AI chatbots designed to automate customer service, increase sales, save time, and improve customer experience. The chatbots can be installed on any website platform with a single line of code and provide features such as advanced AI, full customization, real-time analytics, and various use cases including customer service, personal assistant, and onboarding assistant.\n\nicp: each webpage owner",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "You should figure out a particular vertical you want to tackle. E.g. you might do really well in e-commerce, where this can reduce cart abandonment issue, in that case you might want to include pictures and examples of how well is the problem solved"
                        }
                    ]
                },
                {
                    "author": "doryphorus99",
                    "text": "1. [**Beat the Sweep**](http://www.beatthesweep.pro) \\- Helps drivers in my city (Lancaster, PA) avoid street-sweeping tickets.\n2. **Problem**: For residents here who have to park on the street, they are constantly having to move their cars for frequent street sweeping. This app lets them know about the relevant nearest route(s), th next sweep, and most important, sets reminders to move their car. \n3. **ICP:** City residents (like me) who don't have off-street parking."
                },
                {
                    "author": "Any_Perspective_291",
                    "text": "[https://twocents.site/](https://twocents.site/)\n\nGet or Give real user feedback.  ICP - everyone.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Great name!",
                            "replies": [
                                {
                                    "author": "Any_Perspective_291",
                                    "text": "thank you!"
                                }
                            ]
                        },
                        {
                            "author": "LessBadger4273",
                            "text": "Can you explain a bit more about your product? It sounds super cool",
                            "replies": [
                                {
                                    "author": "Any_Perspective_291",
                                    "text": "As a founder, marketing and gathering user feedback can be challenging. What this site does is help founders get user feedback, whether it’s for a landing page or a specific product. It’s also a great way to advertise your service. You can check out the archive tab to see previous submissions from other founders and the feedback they got."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Impossible_Alarm9524",
                    "text": "[**AutomatePOD**](https://automatepod.com/)\n\n**What does it do?**\n\nAutomatePOD streamlines print-on-demand (POD) creation with automation for Canva and Photopea text, with Kittl support coming soon. Future updates will include niche analysis, design management/storage, and marketplace integrations.\n\n**What problem does it solve?**\n\nThe vision is to empower POD creators and businesses of all sizes to succeed through quality-focused tools, countering the market's trend toward low-quality, high-volume approaches.\n\n**Ideal Customer Profile**\n\nQuality-focused POD creators and businesses seeking efficient, sustainable growth through automation, research, and planning."
                },
                {
                    "author": "MCS87_",
                    "text": "1. [ScanKit.io](https://www.scankit.io) – AI-powered document scanning SDK and API to turn physical documents into clean, actionable inputs for LLMs, Gen AI workflows, and automation.\n2. Problem – Most apps assume users already have clean PDFs. ScanKit enables apps to accept physical documents and transform them into high-quality scans, ready for workflows like legal compliance, contract analysis, and AI-driven automation.\n3. ICP – Developers and companies building AI-driven apps that need to process physical documents for modern Gen AI and compliance use cases.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Great idea, you might want to at least outline the pricing piece, as often with API the cost might be prohibitive and customers might be uneasy try something they might not be able to afford"
                        }
                    ]
                },
                {
                    "author": "dev-guy-100",
                    "text": "[https://www.getfoundertab.com/](https://www.getfoundertab.com/) a new way to organize your work - Access powerful tools right from your browser—drag and drop trackers, reminders, notes, and more to organize your tasks and stay productive anywhere on your screen.\n\n  \nThe #1 problem Founder Tab solves is disorganized workflows for busy founders.\n\n  \nOur target persona is Founders, as well as those who indulge in productivity tools."
                },
                {
                    "author": "Craygen9",
                    "text": "Compliment generator: upload a pic, receive uplifting words! https://www.craygen.com/compliments/\n\nThere's not enough positivity out there. Sending good vibes to anyone who wants it."
                },
                {
                    "author": "kevamorim",
                    "text": "[https://paytick.app](https://paytick.app) To help freelancers and solopreneurs keep track of their hourly rate and overall project/client profitability.\n\nStill in development but some feedback would be great. 🙂",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "You should include on your HP some images of you tool, so folks know how it looks and how easy is to use. Feel free to sign-up for lyly, we can help you with walkthrough videos",
                            "replies": [
                                {
                                    "author": "kevamorim",
                                    "text": "Hey thanks! I want to do that asap. I’ll check up Lyly."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thick_Pop7435",
                    "text": "Construction SaaS erp, with all modules, warehouse, materials, construction, supplier, vehicle, accounting, quotes, ecc…"
                },
                {
                    "author": "limandocNN",
                    "text": "1. [LimanDoc](https://limandoc.com) \\- a file visualization desktop app\n2. **Problem**: I always had a problem with organizing all types of data: text, images, files, etc. So I needed offline desktop app to organize my knowledge to optimize my work, my notes/drafts, and research!\n3. **ICP**: those who do research, personal knowledge managers, and those who tired of Notion! Students, Master/PhDs, are one example."
                },
                {
                    "author": "Ok_Maintenance_708",
                    "text": "Start Up Name: Camie AI (https://camie.ai)\n\nProblem: We help convert website visitors into booked appointments. We do this by using AI to follow up, provide value and eventually book the appointment.\n\nICP: B2B marketing agencies"
                },
                {
                    "author": "nappynaz",
                    "text": "We are building https://www.ashdeck.com to help you stay focused, block distractions, and track your progress while effortlessly achieving your goals."
                },
                {
                    "author": "fusssuppe",
                    "text": "\n\n[indiecloud.dev](https://indiecloud.dev/) is a vercel alternative with predictable pricing and for backend frameworks like spring-boot, django, etc. Its for freelancers, indiehackers and startups.\n\nDM me if you’d like to try it and you’ll get free hosting-time for some feedback!"
                },
                {
                    "author": "SimonFletcher",
                    "text": "[SavvyIdeas](https://www.savvyideas.co) - Anonymous employee feedback\n\n**Problem:** The people closest to the work are the most likely to see the problems and opportunities, but it's not always easy for them to voice them and they sometimes fear ridicule or retaliation. You're much likely to get candid feedback if people know their identity is protected.  SavvyIdeas solves this problem, enabling your staff to share feedback anonymously, including anonymous 2-way conversations, and enables you to manage your response and, optionally, make the feedback and your response public.\n\n**ICP:** Any business with a large workforce or one which is rarely in an office.",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "The challenge here is that often this goes sideways and employees can voice their concerns, potentially you should think about how to set up the incentives for users to gravitate towards good behavior"
                        }
                    ]
                },
                {
                    "author": "lukakopajtic",
                    "text": "https://blueprint.now  personalized Notion system generator with 100+ prebuilt blocks \n\nProblem - Building a system that adapts to your workflow takes a long time. Blueprint lets you build it with drag and drop in seconds.\n\nICP - Founders and creators that want an all-in-one system to manage their projects, goals, content, marketing and finance."
                },
                {
                    "author": "curious_informer",
                    "text": "Startup Name : TaskRocky - a gamified task management tool\nProblem solved : completing tasks are boring. We give users a reason to keep coming back and an incentive to complete tasks.\nCustomer profile : individuals and teams (small and large).\n\nGamified features : rank ups, achievement points, redeemable rewards, shout outs.\n\nTask features : Projects, Todo lists, notes, collaboration (invite another team member), messaging, kanban board, e.t.c"
                },
                {
                    "author": "Electronic_Set_4440",
                    "text": "[use ChatGPT plus with its api no need to use subscription any more , only 2 euro to use our apps as a platform to use ChatGPT plus with its api](https://apps.apple.com/at/app/ai-chat-by-api/id6739469873?l=en-GB)"
                },
                {
                    "author": "Electronic-Log-1780",
                    "text": "Acorn - Book Podcast and Summaries App powered by Conversational AI that lets you to chat with the book you are listening to 💪 check it out: acornx.ai"
                },
                {
                    "author": "Key-Field5622",
                    "text": "https://cobaltapp.nz Invoicing and payments software\n\nCobalt helps users manage their business financial information. It is ideal for freelancers or small business owners who can’t justify the cost or complexity of bigger systems such as Xero or QuickBooks. \nBuilt with New Zealand and Australia business practices in mind, but would love to extend support to other regions. \n\nAny feedback is welcome 👋🏼"
                },
                {
                    "author": "rand0mm0nster",
                    "text": "Startup name: Scout\nProblem: web analytics can be tedious to setup and get insights\nICP: Post revenue/pre seed saas founders and devs\n\nhttps://usescout.io/"
                },
                {
                    "author": "DanielShakibaie",
                    "text": "1. ReelProof - AI-powered video interviews and testimonials made simple.\n\n\n2. Problem: Capturing high-quality customer testimonials is time-consuming, expensive, and often a hassle to organize. ReelProof simplifies the process with an AI Video Collector that interviews customers, selects the best responses, and delivers professionally edited videos—at a fraction of the cost of traditional production.\n\n\n3. ICP: SaaS founders, marketing teams, and customer success professionals who want to close deals faster with authentic, trust-building testimonials.\n\nReelproof.io"
                },
                {
                    "author": "yuzbashev",
                    "text": "BuildFast https://buildfast.es\nI help web devs to make awwward type animations (hard to find such info)\nFreelance web devs",
                    "replies": [
                        {
                            "author": "the_grayhorse",
                            "text": "questionable shaking button",
                            "replies": [
                                {
                                    "author": "yuzbashev",
                                    "text": "Better to make it sticky ? I thought maybe shaking effect will attract attention"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "East-Home-7362",
                    "text": "1. [readtype](https://app.read-type.com) - An app to facilitate users to read by typing\n2. There are study mentioning about handwriting can help people understand the book better. While it can be done with digital books too, as someone who love doing things digitally, it would be nice if I can do the same by my keyboard. Thats how readtype created. Upload your book, then read it by typing.\n3. Students, someone who read digital books a lot. I do find myself wanting to build this as I need to learn some material and need a fun and better way to read and understand the book."
                },
                {
                    "author": "Free_Afternoon_7349",
                    "text": "[www.versors.com](http://www.versors.com) \\- knowledge assistant  \n  \nSo far we have an interface to search web, scan websites, and automatically structure the results into custom tables you create.\n\nIt is great for researching competitors, prospects, investors, ML papers, restaurants, or whatever you need to quickly make a spreadsheet of."
                },
                {
                    "author": "Academic-Voice-6526",
                    "text": "1. **ActionAgents (dot) co** \\- We are building a marketplace to hire AI Agents\n2. **Problem**: At present there are lot of AI tools available and each comes with different plans and commitment. Ideally as a user i dont want to pay $20 subscription to each different platform even if I am not going to use them daily. This is where we find a gap and we decided to build marketplace for AI agents where you can hire any agents as per your needs nd with the single credit system. Further, our agents are not just GPT wrappers, but they perform various actions including connecting ith API and other web tasks to get you more optimum result. \n3. **ICP** (Ideal Customer Profile) - Our target audience is anyone who is exploring AI and wanted to use AI in their day to day life to increase their productivity.  \n\nDo visit our platform and share your thoughts."
                },
                {
                    "author": "Jebick",
                    "text": "[willpayforthis.com](http://willpayforthis.com) \\- An AI Agent that searches the internet and accumulates user pain points in one library that you can explore. ICP: Anyone wanting to start a business"
                },
                {
                    "author": "Ok-War-9040",
                    "text": "[Bextora.com](https://bextora.com) - A ‘best of’ voting platform."
                },
                {
                    "author": "isinteresting",
                    "text": "I am building [spelltastic.io](http://spelltastic.io) , A free AI powered content reviewer for your landing page. Here's a scan for [https://lyly.app](https://lyly.app)[https://spelltastic.io/public-report/ef54110f-39ba-4371-b35a-6bfdc16eae01](https://spelltastic.io/public-report/ef54110f-39ba-4371-b35a-6bfdc16eae01)",
                    "replies": [
                        {
                            "author": "vlado86",
                            "text": "Nice, I love how automated it is!"
                        }
                    ]
                },
                {
                    "author": "Background-Pop-9059",
                    "text": "Find problems or leads for your next SaaS: www.leadblooms.com",
                    "replies": [
                        {
                            "author": "No_Teach2939",
                            "text": "I love the countdown #sarcasm. It doesn't suggest at all, that you are rate limiting your API acces to some GPT generating random non-existing user conent #sarcasm. No for real, it highly stinks. Gake it away"
                        }
                    ]
                },
                {
                    "author": "Opposite_Aside9554",
                    "text": "We deliver AI inbound and outbound calling. We are Veteran owned and priced affordable. Feel free to message me for more details. Have a great weekend"
                },
                {
                    "author": "alexrada",
                    "text": "1: ActorDO -> AI Assistant for busy professionals  \n2. Organize your work  \n3. Busy professionals, executives, freelancers."
                },
                {
                    "author": "itswesfrank",
                    "text": "what a fantastic project, Lyly! AI-powered screen recordings can really transform how teams communicate, especially in fast-paced environments. You might consider exploring integrations with popular project management tools to tap into your ICP even more. This could simplify sharing those demos directly where teams are collaborating. If you’re looking for insights on market needs or competitor analysis, check out refinefast.com to help structure your strategy effectively.",
                    "replies": [
                        {
                            "author": "PlayboiCult",
                            "text": "thank you GPT🙏🏽"
                        }
                    ]
                }
            ]
        },
        {
            "title": "How are you building your logos?",
            "author": "ShahriarSiraj",
            "text": "Nowadays most of the indie developers rely heavily on AI assistant tools for almost the entire development process. \n\nHowever, one of the most overlooked, yet crucial aspects of a SaaS project is the logo. How are you guys building the logos? With the help of another AI tool or by hiring a designer?",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "investurug",
                    "text": "We've been using the same seller on fiverr for years. Logos, banners, ads, business card.\n\nedit: I won't put the seller link here, if you want their contact, DM.",
                    "replies": [
                        {
                            "author": "Coolzie1",
                            "text": "Drop their link here, it will help their exposure!",
                            "replies": [
                                {
                                    "author": "NoJob8068",
                                    "text": "He’s gatekeeping 😭🙏🏾"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "boredguy74",
                    "text": "Plenty of free services that offer decent logos. I mainly use [Logofast](https://logofa.st) and [Logo-creator](https://www.logo-creator.io/)"
                },
                {
                    "author": "MindingMomma",
                    "text": "I would say try to go for a designer and not AI. AI logos are generic + based on templates and pre-designs in their system.  \n\nMy saas developer outsourced to a design team. Given the parameters I gave them they provided 6 options for me to chose from. I ultimately selected 1 and asked them to make some edits (colors, slight modifications, etc.). I get complimented for my logo a lot so I'm happy with the outcome."
                },
                {
                    "author": "YopBuilder",
                    "text": "Crucial?"
                },
                {
                    "author": "Academic-Voice-6526",
                    "text": "Yes indeed lot of AI tools available in the market for logo. But not all are real AI, they are just loading it based on template they already have. Together.ai you may find one free logo generator tool which I feel is actually generating logo based on prompt. Though result are not very good, but still it seems like real AI generated and not just a template."
                },
                {
                    "author": "Fit_Acanthisitta765",
                    "text": "namecheap has a free one if you are looking for just a placeholder for the first 1-2 years, easy to use tool, plenty of color choices.  I've used them for 5 years + for domain registration."
                },
                {
                    "author": "Parmg100",
                    "text": "I just hire a guy on Fiverr, I’m very particular on how I want my logos"
                },
                {
                    "author": "Starkboy",
                    "text": "raw dogged it in figma. it sucks, but who looks closely at a favicon?"
                },
                {
                    "author": "uhsauh",
                    "text": "If you feel like spending some time and getting creative, feel free to check out the design tool I'm building, [Typogram](https://typogram.co/)! it's an easy-to-use logo design tool for people with little design experience, and you can create a complete brand kit with it."
                },
                {
                    "author": "Funny_Ad_3472",
                    "text": "You can generate logo with AI.",
                    "replies": [
                        {
                            "author": "ShahriarSiraj",
                            "text": "Which tools offer it?",
                            "replies": [
                                {
                                    "author": "Funny_Ad_3472",
                                    "text": "Namecheap, even if you have an account, has a AI logo generator."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "yuzbashev",
                    "text": "I use AI for inspiration or just put an icon into a color"
                },
                {
                    "author": "the_grayhorse",
                    "text": "I normally use AI tools to create the first draft and hire a designer to polish it."
                },
                {
                    "author": "Such_Fox7736",
                    "text": "Fiverr has a lot of talented people that can produce logos and graphics far beyond anything I can make and they don't charge much. I try to find a good seller for something and stick with them unless they give me poor quality results later on."
                },
                {
                    "author": "marksofpain",
                    "text": "Fucked around in Pixelmator until I made something passable."
                },
                {
                    "author": "Oleksandr_G",
                    "text": "The most recent ones I created with Bing. It's probably powered by dalle but the quality is actually better. You still need to spend time prompting.\n\nHere are the examples: https://bestaiapps.co. Not all logos are awesome but I do like some of them.\n\nWhat I'd recommend is to pick a style and stick to it. For example we first started with Pixel art but then switched to more Andy Warhol pop art."
                },
                {
                    "author": "All3wins",
                    "text": "I created a logo for my website using the free version of DeepSeek. The key is writing a good, detailed prompt and, of course, the most important thing for everything to work, is for it to create an SVG image."
                },
                {
                    "author": "The_Vorthian",
                    "text": "I am bad with vector design so I mostly have text only logos and but if I need to have some vector graphics I use figma."
                },
                {
                    "author": "daem-carpe",
                    "text": "Canva: nice icon with a decent header font! Done. Fast and free!"
                },
                {
                    "author": "Aggravating_Owl_5591",
                    "text": "Hi. May be you can check this portfolio. https://www.behance.net/gallery/217061855/My-Designs"
                },
                {
                    "author": "AgencySaas",
                    "text": "Fiverr's fine\n\nDo an inspo from Canva, then handover to a designer and say \"make that, but better\""
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!",
                    "replies": [
                        {
                            "author": "NoJob8068",
                            "text": "What does this have to do with their question?"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Name a tool that you can’t live without in your business.",
            "author": "Smooth-Theory-2545",
            "text": "",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "hu-beau",
                    "text": "Email...",
                    "replies": [
                        {
                            "author": "TopDeliverability",
                            "text": "Definitely this 😁"
                        },
                        {
                            "author": "[deleted]",
                            "text": "[removed]",
                            "replies": [
                                {
                                    "author": "Passenger_Available",
                                    "text": "The market is so saturated with these things that I think everyone knows what they are.\n\nKnow what would be a cool idea to test? Throw up a compare section right on the landing page so I know what’s going on immediately.\n\nI’ve gone through so many of these services, from old school sendgrid, mandrill, mailchimp, resend, etc."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Chance-Sprinkles-923",
                    "text": "Dark mode"
                },
                {
                    "author": "Acesleychan",
                    "text": "Figma",
                    "replies": [
                        {
                            "author": "No-Look9928",
                            "text": "Kinda like Ligma"
                        }
                    ]
                },
                {
                    "author": "Old_Taste_2669",
                    "text": "Claude",
                    "replies": [
                        {
                            "author": "googlehome12345",
                            "text": "Clyde for me"
                        }
                    ]
                },
                {
                    "author": "Coolzie1",
                    "text": "Github",
                    "replies": [
                        {
                            "author": "reets007",
                            "text": "Lot of other options right?",
                            "replies": [
                                {
                                    "author": "Coolzie1",
                                    "text": "There is, but the flexibility it's given me to both version control, roll back changes and more importantly use CodeSpaces to work on my projects live in a couple minutes from anywhere has meant I have been able to make some quick changes and updates on breaks at work etc.\n\nWe use Vault by autodesk for CAD PDM (Product Data Management) and that costs an arm and a leg for a hobbyist, so the fact that GitHub is free is an absolute win and something I couldn't live without now... although I'm happy to hear out any alternatives which people are using and why?"
                                },
                                {
                                    "author": "hu-beau",
                                    "text": "No. For selling your open source product, this is the only useful platform"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Agreeable_Service407",
                    "text": "IDE"
                },
                {
                    "author": "avanti33",
                    "text": "My brain"
                },
                {
                    "author": "contactanimeshs",
                    "text": "Reddit"
                },
                {
                    "author": "HeadLingonberry7881",
                    "text": "Canvas, cursor, claude"
                },
                {
                    "author": "WittySigner",
                    "text": "MySignature, Buzzstream, Figma"
                },
                {
                    "author": "diversecreative",
                    "text": "Browser"
                },
                {
                    "author": "Any-Blacksmith-2054",
                    "text": "Genious"
                },
                {
                    "author": "CryingInABenz",
                    "text": "Chatgpt"
                },
                {
                    "author": "hubertryanofficial",
                    "text": "Cloudsky"
                },
                {
                    "author": "alexrada",
                    "text": "github.  \nchrome (maybe brave)\n\nnone of those are optional.  \nOther than this ActorDO is starting to get on the list, but still has to improve."
                },
                {
                    "author": "Spiritual_Safe8127",
                    "text": "Computer, Windows, etc"
                },
                {
                    "author": "DanielShakibaie",
                    "text": "My phone"
                },
                {
                    "author": "flashbang88",
                    "text": "Hands"
                },
                {
                    "author": "Live-Ad6766",
                    "text": "Simple: Git"
                },
                {
                    "author": "srodrigoDev",
                    "text": "Notepad."
                },
                {
                    "author": "Sharp-Strength8923",
                    "text": "Notion -  All-in-one tool for product management and collaboration."
                },
                {
                    "author": "anas101siddiqui",
                    "text": "Reddit"
                },
                {
                    "author": "West-Air2726",
                    "text": "www.digitalpilot.app"
                },
                {
                    "author": "mandelbrot1981",
                    "text": "Stripe"
                },
                {
                    "author": "theDaveB",
                    "text": "Screwdriver"
                },
                {
                    "author": "Good_Cockroach_6357",
                    "text": "chatgpt"
                },
                {
                    "author": "SlideStraight8",
                    "text": "Keyboard ⌨️"
                },
                {
                    "author": "HouseOfYards",
                    "text": "Our own saas, we built it for your landscaping business initially so we need it daily."
                },
                {
                    "author": "raindropl",
                    "text": "VSCode.  For 20+ years I was vim only developer; once I did the switch; is night and day."
                },
                {
                    "author": "Funny_Ad_3472",
                    "text": "Netflix!"
                },
                {
                    "author": "Careless_Heat907",
                    "text": "# Notion."
                },
                {
                    "author": "you_zir_name",
                    "text": "Slack lol jk iterm/tmux"
                },
                {
                    "author": "phil9l",
                    "text": "There are many, got used to posthog recently, incredibly helpful."
                },
                {
                    "author": "heykal75",
                    "text": "Pennylane."
                },
                {
                    "author": "am-i-coder",
                    "text": "DeepSeek"
                },
                {
                    "author": "whitepalladin",
                    "text": "https://formalternative.com"
                },
                {
                    "author": "Professional_Law_379",
                    "text": "Common Sense"
                },
                {
                    "author": "comicfy",
                    "text": "Upwork"
                },
                {
                    "author": "Ok_Essay_6476",
                    "text": "goleads.me"
                },
                {
                    "author": "Mindless-Talk-1635",
                    "text": "ChatGPT ☠️"
                },
                {
                    "author": "FromValledupar",
                    "text": "GitHub Copilot"
                },
                {
                    "author": "SuperchargeRectech",
                    "text": "Recruit CRM"
                },
                {
                    "author": "isbajpai",
                    "text": "[Lane](https://www.laneapp.co)\nThe only product management tool I use"
                },
                {
                    "author": "michael_curdt",
                    "text": "MS Office"
                },
                {
                    "author": "ChuffedDom",
                    "text": "Google Workspace"
                },
                {
                    "author": "Affectionate_Gap972",
                    "text": "Deepseek"
                },
                {
                    "author": "Background-Pop-9059",
                    "text": "www.leadBlooms.com",
                    "replies": [
                        {
                            "author": "Background-Pop-9059",
                            "text": "jk I'll say ChatGPT"
                        },
                        {
                            "author": "Spirited_Set7240",
                            "text": "What is it",
                            "replies": [
                                {
                                    "author": "Background-Pop-9059",
                                    "text": "Find leads of problems"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NecessaryTourist9539",
                    "text": "[https://clevrscan.com](https://clevrscan.com)"
                },
                {
                    "author": "DingoProfessional168",
                    "text": "Slack, RB2B, Canva, Konnectify"
                }
            ]
        },
        {
            "title": "Use a Branded Giphy Channel to Level Up Your SaaS Marketing",
            "author": "ZerocratAccounting",
            "text": "If you're looking for a creative way to market your SaaS product and stand out on platforms like Reddit, then apply for a branded channel on Giphy. With a branded channel, your demo GIFs can become searchable and usable in Reddit comments (if the subreddit allows GIFs from Giphy). This can be a game-changer for showcasing your product in an engaging way.  \n\nWhen you pair your promotional comment with a polished, visually compelling GIF, it’s more likely to grab attention and resonate with users.  \n\nCheck the comments on this post for an example of how you can use a demo GIF to promote your SaaS product:",
            "subreddit": "SaaS",
            "comments": []
        },
        {
            "title": "What is your end goal with your app?",
            "author": "Swimming_Driver4974",
            "text": "Let’s share some goals we have, of course getting a million dollars would be amazing. But what are some immediate goals?\n\nFor me I’m building https://gitfolio.ai, and am aiming to get a thousand users by end of next month.",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "doryphorus99",
                    "text": "I made a web app simply to solve my own problem--avoiding street sweeping tickets in my city. [Beat the Sweep.](http://www.beatthesweep.pro)"
                },
                {
                    "author": "rollrodrig",
                    "text": "what the your action plan to get those users?",
                    "replies": [
                        {
                            "author": "Swimming_Driver4974",
                            "text": "- fix the various bugs I came across due to having a good error detection system (Sentry) and my own usage of the app\n- keep building an audience on X, Reddit, and LinkedIn\n- make free tools as a funnel, i.e. curated job board which has backlink to my app which is a resume builder, so makes sense"
                        }
                    ]
                },
                {
                    "author": "-Django",
                    "text": "My goal is to empower founders to build better, more informed products."
                },
                {
                    "author": "daem-carpe",
                    "text": "I got my SaaS side project [That’s Rank!](https://www.thatisrank.com) to 900+ users in the first couple weeks, just came out of Beta so now to generate revenue 🚀",
                    "replies": [
                        {
                            "author": "Swimming_Driver4974",
                            "text": "That’s sick! ProductHunt number 1, congrats. I urge you to share a huge paragraph, I’m sure it would benefit a lot of others and I’d love to know your journey."
                        }
                    ]
                },
                {
                    "author": "SoftSkillSmith",
                    "text": "One paying customer in 2025 😎"
                },
                {
                    "author": "asksherwood",
                    "text": "I've been an SEO consultant for a ton of years. But it's the classic non-scalable business. And lately it feels like AI is breathing down my neck. So I built an AI app to replicate my workflow.\n\nIf AI is going to replace me, I want to own it myself."
                },
                {
                    "author": "Funny_Ad_3472",
                    "text": "What is your project about? When I land on your page, I should ge ta sense of what you do within the first 4 seconds."
                },
                {
                    "author": "curious_informer",
                    "text": "Product : TaskRocky www.TaskRocky.com a gamified task management tool.\n\nImmediate goals : Build a community of TaskRocky enthusiasts on various social media platforms, getting more feedback from more users so we can know what to iterate and what to keep moving forward."
                },
                {
                    "author": "itguygeek",
                    "text": "Add more valuable features to [costmeet](http://www.costmeet.com)"
                },
                {
                    "author": "Floloppi",
                    "text": "i recently launched [Tabsence: Inactive Tab Manager](https://chromewebstore.google.com/detail/tabsence-inactive-tab-man/eacpmniepmclkjbkpgfipegppjnddpam?hl=en&authuser=0)\n\nThis Chrome Extension closes unused tabs automatically, so you dont end up with 250 opened tabs that wont be used anyway. Saves you some lifetime and boosts your productivity, for people that has browser chaos on a daily basis haha"
                },
                {
                    "author": "alexrada",
                    "text": "Get to 1 million users"
                },
                {
                    "author": "Passenger_Available",
                    "text": "I made a web app to help me organize, read and annotate my physical books better.\n\nThe only goal I have right now is to have something usable for myself.\n\nI don’t care about users so do not even sign up, it’s not working anyways LOL:\n\nhttps://www.sovoli.com/shawn/shelves"
                },
                {
                    "author": "armageddon_20xx",
                    "text": "Change the world."
                },
                {
                    "author": "89dpi",
                    "text": "20k MRR so my coding co-founder would have confidence to quit and we could really pull in a second gear.\n\nThough thats 1000 paying users 😂"
                },
                {
                    "author": "Pretty_Crazy2453",
                    "text": "World domination"
                },
                {
                    "author": "BusyBusinessPromos",
                    "text": "Not a single comment on the hidden agenda of this post."
                }
            ]
        },
        {
            "title": "We earned $50k+ on UpWork, but spent 100h+ to get those gigs - until today",
            "author": "rbatista191",
            "text": "My co-founder and I spent **hundreds of hours on UpWork**:\n\n* First, build an awesome profile (at least you think it is, but then you iterate 1000 times)\n* Then, search for keywords (yeah, some of them are pretty bad, but after 20h you get which ones work)\n* Now, time for filtering the bad posts, and the fake ones, and then finally you get a decent one - but it has 30 applicants already.\n\n**Does this sound familiar?**\n\nUpWork and others do a bad job at filtering and matching, so we scratched our own itch and built gigsent.\n\nOur plan is screen, curate and help in the application. We only did the first two, so next is:\n\n* Incorporate more sources (freelancer.com, reddit, etc.)\n* Generate personalized application answers (still talking to users on how to best do this)\n\nWe are still in early stages so feedback is super appreciated.\n\nP.S.: We would love to have shared this for free, but scraping + filtering + matching is SUPER expensive (we barely make any money out of each subscription).",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "ijorb",
                    "text": "Interesting solution to noticeable problem.\n\n\nYou have to figure out how to make it more affordable or free for limited use so users can see value first.\n\n\nFor example free first few gigs.\n\n\nGood luck!",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "Thanks u/ijorb!  \nVery true, we are planning on doing so very soon when we are able to control the costs. We also want paying users that can help us shape the product - so we go mass scale ![gif](emote|free_emotes_pack|give_upvote)",
                            "replies": [
                                {
                                    "author": "ijorb",
                                    "text": "Grear, that will be the right way"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Teoyame",
                    "text": "Hey just have some feedback on creating a profile and setting up a filter. For the client rating filter it looks like when you select an option (at least on mobile iOS) it automatically checks the rest of the lower filter ranges as well. Maybe this already works the way I imagine it should, but as a user, if I select 4.0 and 3.0 rating clients only, I do not want to see clients with a 2.0 and above rating. The current UI behavior makes me think this is what’s going on. IMO it would make more sense to not force lower threshold selections if this is in fact not how the filter works on the backend. Otherwise I’m a bit confused on why there is a filter at all if it works essentially top down, where you can only filter out higher rating clients, but not lower.",
                    "replies": [
                        {
                            "author": "Dramatic_Device_6622",
                            "text": "Hey! gigsent.com Co-Founder here - you are right, there was a bug in the UI. In the backend it was already working as it should but the UI was not behaving correctly. That’s already fixed! Do you mind checking if it’s now working well on your side? Thanks!!",
                            "replies": [
                                {
                                    "author": "Teoyame",
                                    "text": "Yes seems working now!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Beneficial-Being-821",
                    "text": "But I can filter myself on upwork. \nWhy use your platform? \nWhat does it offer that makes my life easy.",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "We analyze your profile and check the best matches for you. No need to be searching for tens of keywords to find what you need.",
                            "replies": [
                                {
                                    "author": "Beneficial-Being-821",
                                    "text": "I don't think people will pay for this"
                                }
                            ]
                        },
                        {
                            "author": "Agreeable_Mountain_9",
                            "text": "People are already paying for this. There is actually a competitor that’s big with Upwork freelancers. But people are complaining about it"
                        }
                    ]
                },
                {
                    "author": "ComfortableRare8705",
                    "text": "LOVE THIS",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "We also do!!!"
                        }
                    ]
                },
                {
                    "author": "muhammad_arshul",
                    "text": "Hey i would like to know more. I am starting my freelancer journey and would love to know your approach",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "hey u/muhammad_arshul , sure.\n\nYou just need to signup at gigsent(.)com, pay a very low subscription and you'll start getting the suggested gigs that are tailored to your profile."
                        }
                    ]
                },
                {
                    "author": "rbatista191",
                    "text": "We have just released a 24h trial for everyone to try it!  \n(thanks u/ijorb for the suggestion)",
                    "replies": [
                        {
                            "author": "ijorb",
                            "text": "Thanks to you guys!"
                        }
                    ]
                },
                {
                    "author": "iamanwar82",
                    "text": "Nice Product if it Really Works the way it says Going To try It",
                    "replies": [
                        {
                            "author": "Dramatic_Device_6622",
                            "text": "Feel free to reach out after giving it a try. We would love to hear your feedback 🤝"
                        }
                    ]
                },
                {
                    "author": "Hejsek10",
                    "text": "Just out of curiosity. Why is scraping so costly? Or the costly part is running these results through llms? :)",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "Great point. The scraping is a fixed cost (not user dependent), the LLMs are the costly part because there is a fixed part (analyzing user and job) and a variable part (matching both). \n\nWe’re spending roughly $0.30 per user per day, which barely makes up for the subscription."
                        }
                    ]
                }
            ]
        },
        {
            "title": "The real story behind each solopreneur, the journey to the first $",
            "author": "MahmoudElattar",
            "text": "To be honest, there are a lot of scams in this subreddit.  \n  \n And while some of the stories are true, I just want to clarify a few things from a business perspective.  \n  \n Any project run by one person usually leads to two possible outcomes\n\n1 - It's a little setup that isn't built for growth over the long haul, which means they’ll be hanging out at the same revenue level without any chance to earn more.  \n  \n 2 - They might have a tough time if the numbers start to climb.\n\n**you just can't do everything in simple words**,  \n  \n **for successful indiehackers or solopreneurs, share your story for the first $, and show us the real way to be indiehackers away from scammers.**",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "Careless_Heat907",
                    "text": "I totally get it! When I first started out, all I cared about was snagging my first few customers. I didn’t really think about what would happen if things blew up. Let’s just say I picked up some tough lessons about scaling along the way. It's definitely something to think about from the get-go!",
                    "replies": [
                        {
                            "author": "MahmoudElattar",
                            "text": "You're absolutely right! If the foundation is solid from the start, it'll save you a lot of headaches down the road"
                        }
                    ]
                }
            ]
        },
        {
            "title": "400+ users on waiting list for a SaaS that hasn't launched, looking for technical co-founder",
            "author": "attxb",
            "text": "Not sure if this is the right place to post this but I'll give it a go.\n\nI've owned and been running food businesses since 2020, I sold the last of the food businesses off in May last year. Since then I've been working on trying to start something more scalable, naturally I landed on tech.\n\nI toyed with many ideas until I landed on one I liked, however instead of building first, I chose to validate. The result is a waiting list of over 400 (soon to be) paying users, who have already signed up to a free trial, their details are in a Stripe plan, and when the free trial expires, they will become paying users... the product isn't built yet.\n\nAbout the product: Its a workspace tool aimed at small businesses, with the core feature being marketing tools (main focus) and management / productivity tools. I landed on the idea after thinking about everything I used to do for my businesses, and how useful some of those things would be to others.\n\nAs the title says, I am looking for a co-founder. Why a co-founder? Because if 5 years of business have taught me anything, its that a single pair of hands can only do so much.\n\nThanks and feel free to reach out.\n\n",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "alhezu_",
                    "text": "Could you give me more details? I'm looking for new businesses."
                }
            ]
        },
        {
            "title": "How I’m Building a Sustainable SaaS Without the $100,000/Month Hype",
            "author": "rohang57",
            "text": "Hey Reddit,\n\nI’ve noticed a lot of posts here about hitting crazy revenue numbers like $100K/month with their SaaS. While that’s inspiring, it’s not always the reality for many builders starting out.\n\nI’m building [Invoicer AI](https://aiinvoicer.in), a simple, smart invoicing tool for freelancers and small businesses. We’re growing steadily, focusing on creating value for our users rather than chasing vanity metrics.\n\nSo, for anyone out there starting their SaaS journey:\n\n* Growth takes time.\n* Focus on solving real problems.\n* Don’t get discouraged by flashy posts; most of the time, they’re exaggerated or fake.\n\nWhat’s your approach to growth? Let’s keep it real and help each other build genuinely impactful products.\n\nWishing you all the best on your journey! 🚀",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "mrtcarson",
                    "text": "Beat of luck with it."
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!"
                }
            ]
        },
        {
            "title": "AI in web development survey for my Master's thesis",
            "author": "Material_Physics6467",
            "text": "Hello Reddit!\n\nI’m conducting research for my Master’s thesis on AI in web development and I’m looking for input from professionals in the field. If you work in web development, I’d love for you to take part in my survey, which should only take 5–10 minutes to complete. The link is below—your participation would mean a lot!\n\nLink to survey: [https://link.webropolsurveys.com/S/912CFE17C68C17B6](https://link.webropolsurveys.com/S/912CFE17C68C17B6)\n\nP.s. throwaway account",
            "subreddit": "SaaS",
            "comments": []
        },
        {
            "title": "Can you give a good example of a serverless application?",
            "author": "mandelbrot1981",
            "text": "Can you give a good example of a serverless application?",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "throwaway001anon",
                    "text": "Youre better off using vms with load balancers. Or else youre just begging for a costly bill."
                },
                {
                    "author": "akramq",
                    "text": "You can have mobile apps directly talking to Lambda functions or Firebase functions to process data and interact with db."
                },
                {
                    "author": "xtreampb",
                    "text": "A serverless application example would be a function app that filters out unneeded messages before putting them on a service bus for consumption."
                }
            ]
        },
        {
            "title": "I'm 17 years old and still in school, but I want to start a SaaS business. Any helpful tips would be greatly appreciated!",
            "author": "Difficult_Low179",
            "text": "I'm 17 years old and still in school, but I want to start a SaaS business. Any helpful tips would be greatly appreciated!",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "Background-Pop-9059",
                    "text": "find a problem then start building!",
                    "replies": [
                        {
                            "author": "mayobot_com",
                            "text": "I’m confirming"
                        }
                    ]
                },
                {
                    "author": "Appropriate-Bid-904",
                    "text": "There are two sides: \n\ntech: learn how to code and deploy front end and backend code on a server. \n\nbusiness: learn how to acquire customers (marketing for b2c or sales for b2b) \n \nWork on it every single day for 18 months. \nThere is no trick or magic tool."
                },
                {
                    "author": "Dapper_Reputation186",
                    "text": "So I’m 15 and I did have my own Saas and sold it , and i do work as a software developer without knowing how to code , I would advice you to learn how to use ai IDE like cursor , and learn marketing , and I like to help you could DM me",
                    "replies": [
                        {
                            "author": "North-Glove-3057",
                            "text": "Hey can you help me too I need your lessons",
                            "replies": [
                                {
                                    "author": "Dapper_Reputation186",
                                    "text": "You can Dm me"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AlexIan91_",
                    "text": "Read the ‘Minimalist Entrepreneur’, i think that should give you a good idea where to start with a clear step-by-step process. \n\nIn principle I’d say: \n\n1) come up with a product YOU would enjoy and maybe pay for.\n2) make sure it’s at least somewhat a niche product\n3) Build an MVP quickly. Make sure the main value proposition works really well.\n4) launch it with a targeted campaign for your niche, get feedback from customers and your analytics, iterate.\n5) Monetize right away since that will be your best indicator of product market fit.\n\nAnd then just problem solve as you continue. Some things will work, many things will fail. Try to fix at least one problem every day."
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!"
                },
                {
                    "author": "FunFerret2113",
                    "text": "Most important advice I can give you is 95% advice is BS and not applicable"
                },
                {
                    "author": "Round_Technology_284",
                    "text": "Just building something is not enough, you should learn some sales and marketing as well. Doesn't matter how great products you build, you won't be able to make it reach to lot of people if you don't have these skills."
                },
                {
                    "author": "TheSoloEntrepreneur7",
                    "text": "Choose a niche that interests you —> create content —> build a community—> understand the common problems community members are facing —> if there’s no solution available for that problem, build it"
                },
                {
                    "author": "newintownla",
                    "text": "First tip, do not trust 95% of the advice you see on this sub. Most of it is coming from people who have no idea what they're doing. Second, find a local business, partner with them, and build software for them that can be extrapolated out to other similar businesses. \n\nKeep in mind that this is just my opinion for the best approach to a B2B saas. You can try B2C if you want, but it's a much tougher road."
                },
                {
                    "author": "kowalski0805",
                    "text": "I don't have much expertise (I haven't launched any successful SaaS yet), but there is a point that I've read in a few business books that I always remind myself (paraphrased): \"If you ask a good CEOs why they are successful, they will tell you about some genius strategy or their great sixth sense or something else. If you ask a great CEOs why they are successful, they will say \"I didn't quit\"\".\n\nKeep in mind that if by any chance you failed, it's not the reason to stop. Many great companies were a 5th or 10th or whatever Nth try of their founders to make something valuable.\n\nParaphrasing again: \"The skills of launching and operating a company is something unnatural to human nature, therefore, it takes time and effort to become good at it. No one was born a great CEO, they've learned to be one\". So if ever you will feel that you're not good at it, remember, that no one was good at it to begin with. They trialed and erred until that found something that clicked.\n\nSo, best of luck to you, and I hope that advice will help you keep going through hard times (if there will be any)!"
                }
            ]
        },
        {
            "title": "Turn metrics to insights - SaaS idea",
            "author": "Content-Lavishness83",
            "text": "I’m a software engineer working in a data team and been tinkering over a saas idea that pulls data from all sources (databases, google analytics, salesforce etc) combine into one and provide intelligent insights to founders or people running the business. The tool should just work with very less friction. It should also be design centric alongwith AI features that will let you chat with your data essentially.\n\nIf you own/run a B2B saas, would you find value in such product?",
            "subreddit": "SaaS",
            "comments": [
                {
                    "author": "AzureFlame_MoonDance",
                    "text": "data whisperer and business genie in one app? sounds like you’re cooking up a recipe for success that even the best chefs would envy—keep stirring that pot of innovation!"
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!"
                }
            ]
        }
    ]
}