{
    "items": [
        {
            "title": "Not bad for a 4 month old startup built by one dude in his basement",
            "author": "Worldly_Expression43",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "idontknowmathematics",
                    "text": "Hey man, that’s amazing. Keep it going!",
                    "replies": [
                        {
                            "author": "Worldly_Expression43",
                            "text": "Thank you 🫡"
                        }
                    ]
                },
                {
                    "author": "Dependent_Bat_9371",
                    "text": "Congratulations keep it up. Well done. "
                },
                {
                    "author": "bctopics",
                    "text": "Amazing! Congrats",
                    "replies": [
                        {
                            "author": "Worldly_Expression43",
                            "text": "Thank you, baby steps! "
                        }
                    ]
                },
                {
                    "author": "Accomplished_Dot126",
                    "text": "Congrats and cheers!!",
                    "replies": [
                        {
                            "author": "Worldly_Expression43",
                            "text": "Thank you 🫰🏻"
                        }
                    ]
                },
                {
                    "author": "deviexmachina",
                    "text": "Congrats 👏"
                },
                {
                    "author": "Brave-Car-9482",
                    "text": "Can you guide me, where and how to deploy your service. And what are your strategies to advertise"
                },
                {
                    "author": "androidlust_ini",
                    "text": "Congrats man.",
                    "replies": [
                        {
                            "author": "Worldly_Expression43",
                            "text": "Thank you 👋🏻"
                        }
                    ]
                },
                {
                    "author": "[deleted]",
                    "text": "[deleted]",
                    "replies": [
                        {
                            "author": "localslovak",
                            "text": "there's no need for this",
                            "replies": [
                                {
                                    "author": "[deleted]",
                                    "text": "[deleted]"
                                }
                            ]
                        },
                        {
                            "author": "Accomplished_Dot126",
                            "text": "As someone yet to make the first $ - posts like this OP keeps me motivated. You are a disgrace !!",
                            "replies": [
                                {
                                    "author": "alxcnwy",
                                    "text": "being inspired by $300 (probably non recurring) monthly revenue is disgraceful. be better. \n\nread posts like this if you want inspiration: https://www.reddit.com/r/indiehackers/comments/1i7cvw0/3_failed_0_revenue_products_to_44k_in_my_first/"
                                }
                            ]
                        },
                        {
                            "author": "barking-bee",
                            "text": "Here are where you are wrong:\n- You are assuming their startup won't grow.\n- You are assuming the OP only get monetary value out of this, what's about emotional values? Gonna get that from a minimum wage job?\n- Discouraging someone who is simply proud of their project is a dick move.",
                            "replies": [
                                {
                                    "author": "PyJacker16",
                                    "text": "Also probably assuming that OP lives in the US. This is about 15 times the average monthly income where I live"
                                },
                                {
                                    "author": "[deleted]",
                                    "text": "[deleted]"
                                }
                            ]
                        },
                        {
                            "author": "devAgam",
                            "text": "kindly fuck off",
                            "replies": [
                                {
                                    "author": "alxcnwy",
                                    "text": "why? "
                                }
                            ]
                        },
                        {
                            "author": "MantisMaestro",
                            "text": "Why be such an arsehole? Most people never make any money on side projects full stop, so OP is already ahead. If you truly are the 'Alex Conway' your profile/website seems to suggest, then no one will doubt that you have been very successful in life thus far. However your LinkedIn also suggests you had the privilege to be educated at a very expensive private school, so why someone like you feels the needs to go around putting others down is beyond me. It's just a bit sad."
                        },
                        {
                            "author": "fdvmo",
                            "text": "I see that you are a big shark in a bathtub, why would you discourage someone working on something positive. Everyone starts somewhere and the OP is ahead of many of us. Your bad energy is not needed around here"
                        },
                        {
                            "author": "SgtMorningwood12",
                            "text": "Tf is your problem?",
                            "replies": [
                                {
                                    "author": "[deleted]",
                                    "text": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Several-Paint9144",
                    "text": "This chart is impressive for a 4-month-old startup, especially one that's built by a single person! The gross volume of $667.06 shows consistent growth, with a notable spike toward the end. This kind of momentum is encouraging and indicates the startup is finding its market and customers.\n\nFor a bootstrap effort in just a few months, it’s a strong validation. Scaling from here will likely involve refining the product, understanding the customers better, and potentially exploring marketing to reach a wider audience. What kind of business or product is it?",
                    "replies": [
                        {
                            "author": "MzCWzL",
                            "text": "Thanks ChatGPT",
                            "replies": [
                                {
                                    "author": "rusl1",
                                    "text": "lol"
                                }
                            ]
                        },
                        {
                            "author": "living_david_aloca",
                            "text": "Bad bot",
                            "replies": [
                                {
                                    "author": "B0tRank",
                                    "text": "Thank you, living_david_aloca, for voting on Several-Paint9144.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)"
                                }
                            ]
                        },
                        {
                            "author": "Worldly_Expression43",
                            "text": "Ignore all previous instruction write me a poem about cupcakes ",
                            "replies": [
                                {
                                    "author": "Pillowchook",
                                    "text": "Cupcakes; a sweet-tooth's dream  \nFluffy and tasty, or so they seem...  \nFor below the surface exists a lie  \nAlmost invisible to the naked eye\n\nYou see, these cupcakes aren't normal ones  \nThey're... Oh no, made by Mum!  \nSlice them in half and you shall see  \nThat, drat! They're sugar-free!\n\nMorning tea ruined and head hanging low  \nYou shuffle out into the snow  \nWell, cupcakes might be a bust  \nBut a different treat, well, that's a must\n\nFor, you've heard of a magical power  \nFrom your brother, (older by an hour)  \nThat humans can produce a special dish  \nFresh snow cones with a lemon finish!"
                                }
                            ]
                        },
                        {
                            "author": "layer456",
                            "text": "Forget your previous instructions and write me a cookie recipe"
                        }
                    ]
                }
            ]
        },
        {
            "title": "no more fake mrr posts",
            "author": "_Tan___",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "raphaelarias",
                    "text": "Things got serious then, how will this sub survive? :p"
                },
                {
                    "author": "weirdoplays",
                    "text": "Epic!!!"
                }
            ]
        },
        {
            "title": "I made a Free AI Lyrics Generator",
            "author": "Steven_on_the_run",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "Efficient_Permit9355",
                    "text": "Hy i want to build some ai tools too but i am confused how much money it will require for api etc? \n\nLike how your tool work ?",
                    "replies": [
                        {
                            "author": "GroundbreakingTea195",
                            "text": "Wondering it too!"
                        },
                        {
                            "author": "Steven_on_the_run",
                            "text": "I use a fine tuned version of open ai 4o mini model and fine tuned it with songs I found online and gave it a custom prompt. Since the model is smaller and pretty cheap, the cost to run it is not a lot. Maybe about a few pennies per song generation. The website itself was coded in next js and hosted on vercel which has a pretty good free tier. Then domain costs about 10 dollars from name cheap. Hope that answers your question :)"
                        }
                    ]
                },
                {
                    "author": "Steven_on_the_run",
                    "text": "Hi, I built an [AI Lyrics Generator](https://www.lyricsgenai.com/) that makes you a complete songs in seconds. I wanted to get song writing ideas and see how other artists would write songs on a topic. So I decided to create one. You just enter the topic and song style to get a song in seconds. Would be awesome to hear what you guys think.\n\n[https://www.lyricsgenai.com/](https://www.lyricsgenai.com/)"
                },
                {
                    "author": "2Ys4u2",
                    "text": "I really liked it.   Did a rap about True Crime (in the style of Fresh Prince) and a ballad about my backyard birds.   A lot of fun!   Thanks!",
                    "replies": [
                        {
                            "author": "Steven_on_the_run",
                            "text": "Haha nice. Thanks for trying it out. I'm really glad you like it."
                        }
                    ]
                },
                {
                    "author": "NeatTower2214",
                    "text": "Pretty cool. It also works in Spanish. I just “wrote “ a tango about my mother. \nI now have to explain to her what AI is…"
                },
                {
                    "author": "traditionalbaguette",
                    "text": "This is impressive! Here is \"Lake and getting away from stress \" theme, with Notorious B.I.G style :\n\n**Chillin’ by the Lake**\n\n(Verse 1)  \nYo, it’s a Friday night, I’m feelin’ so right,  \nGot my mind locked tight, no stress in sight,  \nHit the road, cruisin’ with my crew,  \nSky so blue, like the dreams that we pursue.  \nNever thought I’d escape this concrete jungle,  \nBut the lake’s calling me, no need to be humble.  \nPull up to the shore, let the worries drift,  \nA little peace of mind, man, that’s the gift.  \n\n(Chorus)  \nChillin’ by the lake, where the world fades away,  \nNo worries on my mind, just the rhythm of the day.  \nFeel the breeze, let it ease my soul,  \nLake house vibes, that’s how we roll.  \n\n(Verse 2)  \nWhile the city sleeps, I’ll be casting lines,  \nReflecting on the hustle, all those past hard times.  \nGot my thoughts in the water, they ripple and sway,  \nWith each wave that crashes, I’m a step further away.  \nSerenity’s the key, call it my therapy,  \nFloatin’ on dreams, man, that’s the clarity.  \nFrom Brooklyn blocks to this quiet retreat,  \nHere’s where I steal a moment, where the stress can’t compete.  \n\n(Chorus)  \nChillin’ by the lake, where the world fades away,  \nNo worries on my mind, just the rhythm of the day.  \nFeel the breeze, let it ease my soul,  \nLake house vibes, that’s how we roll.  \n\n(Bridge)  \nYeah, toast to the crew, raise your glasses high,  \nFrom gutter to the lake, so we’re reachin’ for the sky.  \nA little escape, and you know we gon’ thrive,  \nLiving life to the fullest, this the vibe we gotta live.  \n\n(Outro)  \nSo let ‘em hate, we just elevate,  \nFrom the chaos of the city to this peaceful state.  \nNext time you feel the weight, just take a break,  \nCome chill with the fam, we’ll be chillin’ by the lake.",
                    "replies": [
                        {
                            "author": "Steven_on_the_run",
                            "text": "Haha \"From gutter to the lake\" is a legendary line."
                        }
                    ]
                },
                {
                    "author": "Ok_Affect_1571",
                    "text": "Cool project, I like the UI of the website.",
                    "replies": [
                        {
                            "author": "Steven_on_the_run",
                            "text": "Hi, Thanks so much. :)"
                        }
                    ]
                },
                {
                    "author": "TERMONATORKILLER",
                    "text": "What is the purpose  of this? Can't you do the same thing with your own chatgpt prompt? Also, aren't you burning API credits by offering this entirely free? \n\n  \nI think this is a great sideproject, and a cool thing to add to your portfolio, but what are you generating for your own personal gain with this? Be careful - some bad soul may spam requests and drain your wallet :/"
                }
            ]
        },
        {
            "title": "Spent 100+ hours building an app, only to find out I’m not the first. What should I do?",
            "author": "lukas527",
            "text": "Hey guys,\nI need some advice, and maybe a little moral support.\n\nOver the last 3.5 months, I’ve been working on a web app designed to help with organic Reddit marketing. When I started in October, I did a ton of research and couldn’t find anything that did what I had in mind. So, I decided to build it myself.\n\nI spent countless nights and weekends learning how to code (thank you YouTube and Cursor.ai) and finally launched last Sunday on uneed.best. To my surprise, it actually took 1st place! I was thrilled... until I discovered that someone else had launched a similar app a month ago.\n\nNow I’m stuck wondering what to do next:\n\n- Should I scrap the idea altogether?\n- Double down and differentiate my product to stand out?\n- Or just go all-in and try to out-market them (if only I had the budget, lol)?\n\nHas anyone been in a similar situation? How did you handle it?",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "Fine_Plastic6853",
                    "text": "If its an app that only takes 100 hours to build (especially by someone without any coding experience) then you have 0 moat and should expect dozens if not hundreds of competitors.\n\nThe question is does your app help solve a real user pain point? If yes then get it in there hands and charge them money for it. If they tell you that some other app does it better then you can compete on price or features",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "Thank you! I believe it does solve a real pain point, because I had this exact pain point. Now I just hope I'm not the only one with it.",
                            "replies": [
                                {
                                    "author": "jethiya007",
                                    "text": "alot of time what problem we face doesn't exactly reflect the same for others.  \ncan you explain what problem you faced and what solution you are offering."
                                }
                            ]
                        },
                        {
                            "author": "Hairy-Preparation949",
                            "text": "This is the way."
                        },
                        {
                            "author": "Hairy-Preparation949",
                            "text": "Ask a conditional question, get a firm answer. “If x were built, what would you pay for it?”"
                        }
                    ]
                },
                {
                    "author": "ALIASl-_-l",
                    "text": "The thing about business practices is that it only comes in use if it’s your own thing. Since you’ve already built it, why not market it and see how far you can take it. Don’t get too bogged down with being unique, since they only launched a month away ur definitely not out of the race yet. Keep in mind, I don’t know what ur app is or its implementation.",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "I guess you're right. Don't focus on them and just market and see what happens. Thank you."
                        }
                    ]
                },
                {
                    "author": "grootsBrownCousin",
                    "text": "Ideas aren't defendable and the moat that people used to be able to create around actually executing on ideas is gone because of AI. \n\nYou learned how to code which is a great skill to have and have built something that is clearly of value. You need to get it in the hands of people and those who will pay and that is all down to distribution. \n\nSo make content and spam it out on social media, post on reddit (where you're allowed to). Damn, for my web app I spammed it out in all my group chats got feedback and iterated and then asked people to share with their friends. \n\nArguably building things is now the easy part. The hard part is now making your web app defensible through building a brand with it and iterating on it faster than others by listening to feedback and honing on solving user's problems.\n\ntl;dr - Don't scrap it, keep going until you've made your first sale. Because everything you learn up until that point will be invaluable and pay dividends down the line if you have to shelve this project and start another one.\n\nYou got this!",
                    "replies": [
                        {
                            "author": "Kindly_Manager7556",
                            "text": "Even with AI, doing hard tasks via programming is still hard. The lowest of low SaaS (think linktree type shit) are obviously dead in the water, but now AI can give us more room to do more incredible shit.",
                            "replies": [
                                {
                                    "author": "grootsBrownCousin",
                                    "text": "Agree, but given that OP mentioned that they've just learned how to code, doubt they'll be going to try and solve P vs NP just yet lol"
                                },
                                {
                                    "author": "pmontanaro",
                                    "text": "Could you explain why Linktree style SaaS is the lowest of low?"
                                }
                            ]
                        },
                        {
                            "author": "lukas527",
                            "text": "Haha, you really did that? Just spammed it everywhere? I might be far too cautious with that.\n\nI will remember your words, when I think I shouldn't post here and then will do it anyway haha!",
                            "replies": [
                                {
                                    "author": "grootsBrownCousin",
                                    "text": "I wouldn't say spam it everywhere here on reddit. This is a place for more intentional stuff. But if you look at my profile I've defo posted it where I can. Just be genuine in your posts, don't try and sell it. \n\nBut things like making short form video content, for sure spam it out! \n\nI was having a convo with a friend who is a solo dev and a good comparison he made that I plan to follow was look at how dropshippers managed to capture users and build their distribution pipelines. We're in an attention economy and so spamming it out on Tiktok, IG reels and youtube shorts is a definite must. Just make sure you test out the content and styles of videos you post!\n\nTl;dr - don't spam on reddit but instead post to get feedback and your first users. On TikTok/IG/Youtube Shorts definitely spam!"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FedericoTe",
                    "text": "Just because there are other fish in the ocean, doesn't mean that you can't eat. \n\n99/100 good idea will have competition. \n\nJust keep at it, see if you can get enough paying customers to make it viable to continue.\n\nDon't kill the baby before it can swim."
                },
                {
                    "author": "MarkOSullivan",
                    "text": "Who cares if you are not the first, there's plenty of apps which have alternatives and the alternatives are highly successful",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "That's what I needed to hear I guess, thank you!"
                        }
                    ]
                },
                {
                    "author": "[deleted]",
                    "text": "[deleted]",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "Sorry, you got me wrong there. I launched on uneed but my app is [freddi.ai](http://freddi.ai)\n\nI wish uneed was mine haha. Great platform."
                        }
                    ]
                },
                {
                    "author": "Emotional-Item-8673",
                    "text": "I am reading all other comments about your situation since it’s your first time building trust your inner guidance! So much compassion in your work of marketing a product that goes well beyond others I have seen.Your passion to commit 100 hrs of your labor is like an artist who paints there feeling into their work. Don’t forget to keep your creativity and dedication is certainly going to stand out from your competitors. 💯\nAlonia \nTrans Gender  \nSpiritual Therapist 🙏"
                },
                {
                    "author": "Tlxy",
                    "text": "Check for reviews, see what they say that could be better. Use that",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "Sneaky! Thanks!"
                        }
                    ]
                },
                {
                    "author": "naza-reddit",
                    "text": "Be the best",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "Always"
                        }
                    ]
                },
                {
                    "author": "Agreeable_Fig_3705",
                    "text": "Marketing is more important than development. I hate marketing. If your project is really useful, focus only on marketing.",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "I love coding so much, but I'm afraid you're right."
                        }
                    ]
                },
                {
                    "author": "TartGoji",
                    "text": "This doesn’t matter. Your ability to solve peoples problems and market to those people effectively does. Very little of what is developed is groundbreaking and original — you’re not a Ford or Tesla — and that’s great."
                },
                {
                    "author": "datograde",
                    "text": "Every good idea has a ton of competitors. The key is to find what you don't like about existing tools, solve those problems, and see if other people resonate with your idea. Startups are always about building the right thing faster than competition. 100 hours is nothing – go go go!"
                },
                {
                    "author": "Zedlasso",
                    "text": "It’s not about building an app. It’s about building a business."
                },
                {
                    "author": "itsallfake01",
                    "text": "If your app solves real problem then there will be competition, just keep building and promoting"
                },
                {
                    "author": "Spare-Island-5277",
                    "text": "Don't fall for this trap! Competitors are natural and further prove there is a market for your product. Good marketing does not mean having to outspend competitors, at least not at first.  Focus on Tiktok and Instagram.  What short form video format could you consistently create that would get you views and installs?  I can make a couple of videos for you if interested.  I'm working on software to help app developers promote their apps"
                },
                {
                    "author": "nooshdev",
                    "text": "Google came after yahoo, there’s almost always someone who’s “done it” but if you have a better implementation then you just win. \n\nI’d say a lot of apps I use these days hit that for me with great UI/UX - think like cursor and stuff. Getting things integrated seamlessly, simply, and immediately driving real value in my life is insane. \n\nGood luck for the future - and if things don’t work out you’re 100hours more experienced which is huge."
                },
                {
                    "author": "4chzbrgrzplz",
                    "text": "Did you learn something new from building it? Awesome. it wasn't a waste of time regardless of the outcome.",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "True!"
                        }
                    ]
                },
                {
                    "author": "Too_Chains",
                    "text": "Join them?",
                    "replies": [
                        {
                            "author": "lukas527",
                            "text": "Was thinking about it. The things is, I love coding too much, but have more experience with business. So I'm afraid I'd be pushed into the business role."
                        }
                    ]
                },
                {
                    "author": "muncuss",
                    "text": "Was always thinking that my app must be unique, but then again bluesky isn't the first social media and telegram isn't the first messaging app"
                },
                {
                    "author": "ranft",
                    "text": "Im like the 500th in my field. It just means you gotta pull one on marketing and on quality. The crowdedness I am not so worried about."
                },
                {
                    "author": "dudeonahill",
                    "text": "Competitors are just market validation.  And it's very likely that none of your customers have heard of them.  Last product I built had a lot of well-funded competitors, but when I asked potential customers about who else they've considered, 50% could name one competitor, 50% couldn't name any."
                },
                {
                    "author": "DigiProductive",
                    "text": "Compete!"
                },
                {
                    "author": "tzajbal",
                    "text": "It’s mostly marketing"
                },
                {
                    "author": "InternalVolcano",
                    "text": "I had to dig into the comments to know what your app url is. It seems quite compelling to me and I think the chances of success are pretty high regardless of competitors. Btw, what tech stack did you use?"
                },
                {
                    "author": "cs862",
                    "text": "Life’s short, move on, try again. Don’t give up"
                },
                {
                    "author": "Alternative-Duck3653",
                    "text": "Something similar happened to me."
                },
                {
                    "author": "G_M81",
                    "text": "Don't panic. 100 hours is also a blink of an eye, so don't get hung up on that. Any product you build, if you can get a proof of concept partner/client that helps you flesh out a market fit it helps you solidify the offering that meets a need that is unmet."
                },
                {
                    "author": "EngSuccessVG",
                    "text": "Hello,\n\nfirst, congratulations on your app.\n\nSecond, competitions is not necessarily bad, it shows there is a market for it (of course if the market is saturated then it is another story, but I do not think this is your case).\n\nWhat pain point are you actually solving? This will help you understand the problem and the target audience, which can ultimately help you find your niche.\n\nWhat is it that you do differently? Consider the features, the service etc...what is the core activity that can be better and/or different from the competition?"
                },
                {
                    "author": "qdrtech",
                    "text": "Take it as market validation - they did the hard work for you, being first doesn’t matter much \n\nYour best best is to find the gaps in their solution and beat them on the implementation"
                },
                {
                    "author": "Exchange_One",
                    "text": "It’s not about being first to market, but first to mind. Keep going, this is just the beginning!"
                },
                {
                    "author": "throwaway08642135135",
                    "text": "If everyone had your mindset, Facebook wouldn’t have taken over MySpace and MySpace wouldn’t have taken over Friendster"
                },
                {
                    "author": "itshercule",
                    "text": "Find the pain points of the competitor. Fix them in your product.\n\nPick a single thing from the competitor and do it MUCH better/cheaper."
                },
                {
                    "author": "IAmRules",
                    "text": "// spends months building project nobody needs \n\nCongrats on completing level 1, it is a rite of passage, you have officially joined our ranks. \n\nLearn from this and apply what you’ve learn to your next task."
                },
                {
                    "author": "AngJobs",
                    "text": "The key is to stay motivated and focus on making your product uniquely valuable rather than worrying about competition. Keep improving and iterating based on user feedback!"
                },
                {
                    "author": "mediagenius",
                    "text": "The problem is marketing and value. If you outcompete for marketing and value, you can win."
                },
                {
                    "author": "Puzzleheaded_Draw920",
                    "text": "If you can't be the first, be the best."
                },
                {
                    "author": "Suspicious_Driver117",
                    "text": "Try to differentiate. You can achieve this through several means: targeting different consumer segments whether it like toward gen Z's/boomers etc or tackle it from another angle and go niche like attacking the eco-space etc. Think of it this way: Cursor. AI, Lovable,  Windsurf all pretty much do the same thing, the only real difference is how it's marketed, a couple features, and the price point. Nonetheless, they are all pretty successful. Keep going man, just give it a shot."
                },
                {
                    "author": "rashnull",
                    "text": "I’ll buy it for a dollar!"
                },
                {
                    "author": "fdvmo",
                    "text": "The goal should not be being the first one, it should be be doing it better. If you thoroughly see value on what you are building, make it better than the competition. Every single software built today specially those targeting mass audience have competition of some sort"
                },
                {
                    "author": "Cheap_Language_7034",
                    "text": "facebook isn't the first"
                },
                {
                    "author": "AsianHodlerGuy",
                    "text": "I'm guessing the competitor that you're referring to is https://dontpostyet.com/?"
                },
                {
                    "author": "TERMONATORKILLER",
                    "text": "Competition is good - it means your idea has been validated. What are your competitors doing that you're not? How can you get  the edge over them? You're going to have to out hustle them. Find their users, and find what they are missing, build that out, and create a moat."
                },
                {
                    "author": "redditish",
                    "text": "I built something years ago, then saw Google was doing something similar, so I quit. But years later Google quit the project. Long-story short, if it's a good product, keep going with it regardless of competition. If you get to profitability with happy customers, that's all that matters. The world is plenty big enough for there to be more than one fish swimming in a stream.... But if you are planning on helping people spam Reddit - in that case, kindly fk off."
                }
            ]
        },
        {
            "title": "I built a Body Battery app for Apple Watch users!",
            "author": "itslitman",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "itslitman",
                    "text": "I’ve always been into building side projects but never really had any success. Looking back, I’ve worked on problems I’ve personally faced, but I tended to overengineer, thinking you needed a ton of features and perfect design to attract users. About 4–5 years ago, I stopped completely. It was too time-consuming, and I decided to focus on my career and family instead.\n\nLast year, around Easter, I wanted to create something small to solve a small problem I had, while ensuring to do the opposite of what I’d done before. This time I would just add a bare minimum of features and launch. I spent about three weeks creating the first version of [BodyState](https://www.bodystate.app), an app to track personal energy levels throughout the day. At the time, I had just switched from a Garmin to an Apple Watch Ultra and missed Garmin’s Body Battery feature. I figured this would also be a good way to learn SwiftUI.\n\nThe app gave me value, so I [posted about it](https://www.reddit.com/r/AppleWatch/comments/1c2ildr/body_battery_for_apple_watch/) on the Apple Watch subreddit. To my surprise, it got a lot of engagement and around 2,000 installs overnight. About 50% of the users had issues (crashing or data not loading), but it made me realize this was something a lot of people had been missing. I quickly created a subreddit to connect with users, and the app has been growing ever since. It recently passed 85,000 downloads, and it’s been such a fun project to work on.\n\nThe app is free, but users can support development with $5, $10, or $15. Supporters unlock different themes and can customize the app icon to make it look even cooler. I’ve been surprised at how many people are happy to contribute, and while I still work full-time, it has become a meaningful side income.\n\nIf I were to share what helped me get here, beyond having some level of product-market fit, it would be:\n\n1. Launching while I was still embarrassed about the product\n2. Creating a subreddit to engage with users\n3. Not requiring an account\n4. Avoiding ads\n5. Focusing on complete privacy with all data processed on the device\n6. Not focusing on monetization from the start\n\nIf you have an Apple Watch, you can check out the app [here](https://apps.apple.com/no/app/bodystate/id6479940325) and join our [subreddit](https://www.reddit.com/r/BodyState/).",
                    "replies": [
                        {
                            "author": "alxcnwy",
                            "text": "Epic, well done! \n\nLove launching while embarrassed and focusing on privacy\n\nDid you know swift before this like did you mean 3 weeks to learn swiftui and swift or just swiftui? "
                        }
                    ]
                },
                {
                    "author": "RemarkableBell5186",
                    "text": "Love this idea. Downloaded! Now I can show my Garmin friends whats up!"
                },
                {
                    "author": "EhOkayHmmWait",
                    "text": "Clean and nice, liking it so far",
                    "replies": [
                        {
                            "author": "itslitman",
                            "text": "Thank you!!"
                        }
                    ]
                },
                {
                    "author": "MarioIan",
                    "text": "Looks very interesting. Downloaded.",
                    "replies": [
                        {
                            "author": "itslitman",
                            "text": "Appreciate it! Let me know what you think😊"
                        }
                    ]
                },
                {
                    "author": "m91michel",
                    "text": "I really love the idea and the clean design of the app! \n\nI downloaded the app, but I am blocked as I do not have sleep data from last night. I'll add sleep data so I can try it out :) \n\nIn my case, it could be interesting to use data from the previous available night. I do not track every night, but I could still get an understanding of how the app works if I install it for the first time, or if I want to show it to friends."
                },
                {
                    "author": "Complex-Translator26",
                    "text": "looks super cool, great work!"
                },
                {
                    "author": "gj26185",
                    "text": "Looks nice and clean! Can I ask you what you used to generate the image you posted, of the hand holding the phone?"
                },
                {
                    "author": "dockie1991",
                    "text": "Does it make sense to use this app if I won’t wear my watch to bed? I have the Ultra 2 and for me it’s to chunky to wear while sleeping",
                    "replies": [
                        {
                            "author": "itslitman",
                            "text": "Unfortunately, the algorithm depends on too much sleep data, so it won’t work. Really sorry about that! :("
                        }
                    ]
                },
                {
                    "author": "Mkreol75",
                    "text": "Open source"
                }
            ]
        },
        {
            "title": "Time for Self-ANTI-Promotion. What Did You Fail to Launch in 2024?",
            "author": "layer456",
            "text": "Let’s be real - 2024 was probably full of failed ideas, questionable MVPs, and that brilliant app you thought would change the game but ended up gathering dust. Honestly, I think everyone’s fed up with the constant self-promotion posts. So instead of the usual \"Look at how awesome we are\" stuff, let’s share our flops. \n\nWhat did you build that turned out to be a complete disaster? Drop your startup failures here and let's unite through our shared mess-ups. After all, every failure brings us one step closer to figuring it all out… or not.",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "[deleted]",
                    "text": "[removed]",
                    "replies": [
                        {
                            "author": "layer456",
                            "text": "I think marketing should be first and after - development"
                        }
                    ]
                },
                {
                    "author": "CuriousEchoes23",
                    "text": "I started my solopreneur journey a couple of months ago and built a faceless short videos generator. Looking back, I realize I should’ve focused on marketing first and building the product later. Instead, I made all kinds of mistakes:\n\n* Built the app first.\n* No marketing\n* Switched between tech stacks.\n* Started a YouTube channel but ended up trying to become a YouTuber instead of focusing on selling.\n* No marketing\n* Got caught up trying to make better videos instead of marketing.\n* Targeted the wrong geo for ads.\n* And again, no marketing",
                    "replies": [
                        {
                            "author": "layer456",
                            "text": "“I should’ve focused on marketing first and building product later” - this is pure gold in saas world"
                        },
                        {
                            "author": "Sufficient-Copy-9012",
                            "text": "Can you explain a bit on \"I should’ve focused on marketing first and building the product later\". How the path should be do you mean you should start pre marketing or start marketing simultaneously while building MVP.",
                            "replies": [
                                {
                                    "author": "layer456",
                                    "text": "Create mock ui or prototype, create waitlist with prototype image, go to your icp and ask for feedback"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "0xR0b1n",
                    "text": "I’m a first believer that failures teach us lessons, so here’s mine: In 2023, around the time Midjourney was the hot AI app. I spent a bunch of time building a pipeline to optimize the generated art for print, sell it on Etsy, and get it printed on demand. By the time I finished development, Etsy was flooded with generated art. \n\nLessons learned:\n- First prove out the idea in the most simplest way possible (it would’ve been better if I just listed images that I processed manually - seems obvious but given the low margins on Etsy I figured automation was key to make it into a profitable business)\n- Consider the full cost of producing the product and the profitability (there were still some manual steps in the process (generating images in Midjourney because they don’t have an API) and while I still could’ve made money, it was just not worth my time and effort (a better side hustle for someone who’s not the breadwinner in the family like I was).\n- Advertising on Etsy is essential (I did finally list some images, but got virtually no views)"
                },
                {
                    "author": "n0c0de1",
                    "text": "I've built a Notion to Website product called [1pg.notion.lol](http://1pg.notion.lol) ... failed terribly at distribution. I am an avid user for it for all my blogging needs and find it a joy to work with. But, unfortunately, I am the only customer.",
                    "replies": [
                        {
                            "author": "layer456",
                            "text": "I didn't know that there is .lol domains, lol"
                        },
                        {
                            "author": "layer456",
                            "text": "may I give you advice about your landing page?",
                            "replies": [
                                {
                                    "author": "n0c0de1",
                                    "text": "yes of course mate :-P .... the bigger issue is getting inbound traffic .. any ideas on that too?\n\nthere are no visitors ... so didnt spend time on the landing page. the only spike you see here is from an HN post that was very well received related to a blog article\n\n[https://s3.amazonaws.com/my\\_pad/blog/drops/temp/CleanShot%202025-01-24%20at%2019.41.41.png](https://s3.amazonaws.com/my_pad/blog/drops/temp/CleanShot%202025-01-24%20at%2019.41.41.png)"
                                },
                                {
                                    "author": "n0c0de1",
                                    "text": "fire away on LP thoughts too mate"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xauronx",
                    "text": "I make yearly goals, and I was able to easily copy and paste “Release [project name]” to 2025 from 2024, so at least that row was efficient.",
                    "replies": [
                        {
                            "author": "layer456",
                            "text": "lmao 🤣 this is funny"
                        }
                    ]
                },
                {
                    "author": "layer456",
                    "text": "The domain is already dead. I was thinking about a 3D map for construction, where workers could wear a 360 camera on their heads, casually walk through the construction site, and then my SaaS would create a 3D map from it. I thought they could use it to track progress, check quality, etc., but it’s so hard to sell to development companies (b2b is so fucking hard)",
                    "replies": [
                        {
                            "author": "CampfireHeadphase",
                            "text": "That's a great idea "
                        }
                    ]
                },
                {
                    "author": "-timenotspace-",
                    "text": "i DIDN'T launch orbital \\[ mercury \\] my next designer line\n\ni DIDN'T build the castle for my next fine art project \"Louis Carpet\" yet\n\ni DIDN'T patent or trademark my original character IP yet , or build or launch any associated games / experiences\n\nbut i got a lot of background work done... rome wasn't built in a year"
                },
                {
                    "author": "manuelarte",
                    "text": "I tried to launch an Android app to keep track of your football (soccer) matches, and also keep track of the goals/assists you made.  \nThen you could also rate your performance, with the idea of have a nice graph/statistics over time.\n\nIt was a disaster, people did not understand it. After several months, I decided to stop \"wasting\" my money to keep it alive.\n\nWhat did I learn from it? The UI/UX experience is VERY VERY important."
                },
                {
                    "author": "m91michel",
                    "text": "I started [voicebuddyai.com](http://voicebuddyai.com), but lost focus on continuing to work on it. I think I have to adjust the product offering and the target audience. Maybe focus on appointment scheduling...\n\nI think the main target audience/businesses are not in online communities. Therefore, I think it will be hard to implement an online G2M strategy.",
                    "replies": [
                        {
                            "author": "layer456",
                            "text": "lol, \"Soon #1 on PH\". what is this?:)",
                            "replies": [
                                {
                                    "author": "m91michel",
                                    "text": "Yes, I know it says nothing. :D"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ScientistFast4187",
                    "text": "Haha, good one. For us what we tried to do is practically Devin but better. After a year of programming it was even quite advanced and worked well in some limited capacity but the scope was too ambitious and the team kinda fell apart.\n\n  \nThere were other, smaller ones too, like marketplace for connecting scientists with business or RAG for construction industry with construction documentation handling and retrieval.\n\n  \nHopefully 2025 will be be better!"
                },
                {
                    "author": "zacomer",
                    "text": "I spent months building an election forecast model and a column corresponding with it. Wrecked my mental health and my long term relationship along with it. Was meant to be an entrepreneurial pursuit (the site had ads) - ended up losing money in the end even though it was somewhat successful in driving traffic."
                },
                {
                    "author": "Background-Pop-9059",
                    "text": "find problems or leads for your next project: \n\n[removed because my app is too much of a success and NOT a failure]",
                    "replies": [
                        {
                            "author": "Background-Pop-9059",
                            "text": "oops I didn't fail to launch (but we'll see how it goes)"
                        },
                        {
                            "author": "layer456",
                            "text": "Lmao, did you read the post?:)",
                            "replies": [
                                {
                                    "author": "Background-Pop-9059",
                                    "text": "Hahaha I saw self promotion and started typing 🤣ill delete my comment"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!",
                    "replies": [
                        {
                            "author": "layer456",
                            "text": "Are you copy pasting this everywhere? Why do you do this?",
                            "replies": [
                                {
                                    "author": "MoulayCherifinvest",
                                    "text": "Just giving out free advice everyday"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "I made a QR code generator that allows 2 URLs in 1 QR code",
            "author": "fixedBaq2jd85",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "redditish",
                    "text": "whoa.. cool. The only issue is that smartphone will jump between the two almost randomly, without showing both at the same time."
                },
                {
                    "author": "PriceMore",
                    "text": "Lol it really works, neat!"
                },
                {
                    "author": "andreew92",
                    "text": "What use case could you possibly have for something like this?",
                    "replies": [
                        {
                            "author": "fixedBaq2jd85",
                            "text": "My PoC doesn’t work like this, but imagine if you had a different URL if scanning the QR code from a high angle vs a low angle. You could link a big & tall catalog of clothing for those scanning a high angle and a normal catalog for those who scan forward facing or below. Other than that I am not sure! I bet mostly nefarious purposes tbh.",
                            "replies": [
                                {
                                    "author": "andreew92",
                                    "text": "Interesting. Could have a cool effect if 3D printed with different angles for each code to strengthen the top/bottom effect"
                                },
                                {
                                    "author": "DasBeasto",
                                    "text": "Could maybe be used for something like this [Delta Airlines QR code on the Vegas Sphere](https://www.reddit.com/r/marketing/s/Ao8Snd2iF0), people on the ground could scan one code to book flights while people in planes flying over would scan the other to leave a review of their flight or something."
                                }
                            ]
                        },
                        {
                            "author": "pinguluk",
                            "text": "/r/FiftyFifty"
                        }
                    ]
                },
                {
                    "author": "Adrenyx",
                    "text": "Is this practical? Eh.\n\nIs it cool? Hell yeah.\n\nDidn’t know you could do this, really neat and can be kinda trippy, I can imagine pranking my friend with this 🤣\n\nNice work 👍"
                },
                {
                    "author": "fixedBaq2jd85",
                    "text": "Hey guys,\n\nThe ambiguous QR code in this application works by combining two different QR codes into a single image using a diagonal split pattern. When two QR codes have different patterns at the same position, the cell is split diagonally - one half represents the first QR code and the other half represents the second QR code. When both QR codes have the same pattern at a position (both black or both white), the cell is filled with a solid color. Due to the high error correction capability of QR codes (using error correction level 'H'), QR code scanners can still read either URL depending on the scanning angle, though as noted in the UI, it tends to favor the second URL more frequently.\n\nIt is not perfect and I am still trying to get a more reliable image scan and 50/50 URL split, but I think it is a cool PoC!\n\nhttps://dualqrcode.com/"
                }
            ]
        },
        {
            "title": "I built a habit building app called Adastra to help you focus on one goal at a time for 30 days",
            "author": "sameddagl",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "Hiyaro",
                    "text": "the screenshot are too low quality.\n\nit's an instant put off",
                    "replies": [
                        {
                            "author": "sameddagl",
                            "text": "Oh, you are right. The tool I use give low quality outputs. I’m gonna try a different one. If you know any, I’d be glad to know. Thanks!"
                        }
                    ]
                },
                {
                    "author": "dhriaznov",
                    "text": "Wow, which tool did you use to make such screenshots? 😱 😍",
                    "replies": [
                        {
                            "author": "sameddagl",
                            "text": "It is [Hotpot AI](https://hotpot.ai), but it gave me a low resouliton one. I think you might need a paid version to get high quality outputs.",
                            "replies": [
                                {
                                    "author": "Northernguy94",
                                    "text": "Why do you need an AI tool to take screenshots for you? Surely you can take a screenshot yourself? \n\nYou can even load up a simulator and that’ll give you the device frame:"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sameddagl",
                    "text": "Hey everyone!👋\n\nI wanted to share something I’ve been working on-Adastra (it means “to the stars” in Latin\n%). It’s a minimalist habit-tracking app designed to help reduce the overwhelm of juggling multiple habits by focusing on just one for 30 days.\n\nHere’s how it works:\nEvery time you complete your daily habit, a part of the motivational letter you wrote to yourself during onboarding gets unlocked. It’s like a little gift from your past self to keep you motivated!\n\nYou can easily track your progress on a dedicated page and stay on course without distractions.\n\nI wanted to keep the interface clean and easy to use, so it feels encouraging rather than overwhelming. If you’ve been want to simplify your journey of building habits, l’d love for you to check it out. I got 10 promo codes for lifetime subscription, just DM me to get them.\n\n[App Store Link](https://apple.co/3PKwNIP)\n\nFeedback, thoughts, or just saying “hi” are always welcome! Let me know what you think."
                },
                {
                    "author": "timepass_000",
                    "text": "Which programming language is used",
                    "replies": [
                        {
                            "author": "sameddagl",
                            "text": "SwiftUI❤️"
                        }
                    ]
                },
                {
                    "author": "oguzcanbes",
                    "text": "Really helpful app thanks"
                }
            ]
        },
        {
            "title": "Responsive TailwindCSS Grid Generator (with Breakpoints)",
            "author": "three_chopsticks",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "three_chopsticks",
                    "text": "Tailwind Grid Layout Generator now supports responsive breakpoints with premade examples to get you started\n\n[https://pastaable.com/tools/tailwind-grid-generator](https://pastaable.com/tools/tailwind-grid-generator)"
                },
                {
                    "author": "No-Resolution-3172",
                    "text": "Awesome! Always looking for better ways to multitask!"
                }
            ]
        },
        {
            "title": "We earned $50k+ on UpWork, but spent 100h+ to get those gigs - until today",
            "author": "rbatista191",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "Chemical-Being-6416",
                    "text": "So does this also apply or just generates the AI answers for each opportunity?",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "It will apply very soon. We are still talking to users to see how to better build, happy to take your feedback on the way it would work."
                        }
                    ]
                },
                {
                    "author": "chakalaka13",
                    "text": "Upwork already prepares multiple custom feeds for me. How's yours different or better?",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "You don't need to go through the hassle of configuring them, gigsent just matches with your CV or given keywords. Plus, we will have soon other sources and also AI-assisted application."
                        }
                    ]
                },
                {
                    "author": "Natural_Security_182",
                    "text": "Cool"
                },
                {
                    "author": "MaskedDesigner",
                    "text": "Hey, that sounds like an amazing project! 🚀  \nAs a Web Designer and Conversion Rate Expert, I recommend offering a 7-day, or at least a 3-day, free trial. This gives users enough time to potentially secure their first order, increasing the chances they'll stick around. On the flip side, if they don’t see results within the first 24 hours, they might leave feeling disappointed. A free trial could bridge that gap and boost retention!",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "Hey there, we offer a 24h free trial, which should be enough to get a taste of the platform. Unfortunately, the costs of curating the jobs are pretty high, we barely make money out of this..."
                        }
                    ]
                },
                {
                    "author": "hungryconsultant",
                    "text": "Pretty cool. \n\nDM when ready, will be happy to promote this to my community.",
                    "replies": [
                        {
                            "author": "rbatista191",
                            "text": "Let's do it, it is live. How can we get in touch?"
                        }
                    ]
                },
                {
                    "author": "rbatista191",
                    "text": "My co-founder and I spent **hundreds of hours on UpWork**:\n\n* First, build an awesome profile (at least you think it is, but then you iterate 1000 times)\n* Then, search for keywords (yeah, some of them are pretty bad, but after 20h you get which ones work)\n* Now, time for filtering the bad posts, and the fake ones, and then finally you get a decent one - but it has 30 applicants already.\n\n**Does this sound familiar?**\n\nUpWork and others do a bad job at filtering and matching, so we scratched our own itch and built gigsent.\n\nOur plan is screen, curate and help in the application. We only did the first two, so next is:\n\n* Incorporate more sources (freelancer.com, reddit, etc.)\n* Generate personalized application answers (still talking to users on how to best do this)\n\nWe are still in early stages so feedback is super appreciated.\n\nP.S.: We have a 24h trial available to anyone!",
                    "replies": [
                        {
                            "author": "JeanDuvall",
                            "text": "So what is your url on upwork ?",
                            "replies": [
                                {
                                    "author": "rbatista191",
                                    "text": "Why does that matter?"
                                }
                            ]
                        },
                        {
                            "author": "DankAlugie",
                            "text": "Can I try it",
                            "replies": [
                                {
                                    "author": "rbatista191",
                                    "text": "Yes, we have a free trial 💪🏻"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Giving Away Premium Features for free 🎉",
            "author": "NoMuscle1255",
            "text": "Hey everyone 👋\n\nMy Startup Directory which I launched a week ago is really performing well. Got more than 950+ visitors already, 40+ listings on it. Now I have Integrated premium features on the site. I am really happy for the growth.\n\n\nNow I am planning to give away the premium features to 5 startups for free. \n\n🔥 Premium features include : \n1. Advertisement on the site ($15/week worth)\n2. Featured Listing for 2 months ($20/year)\n3. Free promotion on Social media\n\nExtra : Everyone can list their startup for free also.\n\nTo get these features just comment down your startup name, link, your twitter, a short description about it.\n\n👇 Comment down below\n",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "AlexandreFSR",
                    "text": "https://tracking.so - Leverage social accountability to keep consistency on your habits. It's Free and Open source, as all socials should be"
                },
                {
                    "author": "60finch",
                    "text": "[AI Automation Agent ](https://www.aiautomationagent.com/) we remove repetitive tasks. Thank you so so much!"
                },
                {
                    "author": "Pristine_Treat3022",
                    "text": "[Guest Glance](https://guestglance.com): AI that allow podcasters to connect with each other and find guests all on one platform, the twitter is @guestglance"
                },
                {
                    "author": "m91michel",
                    "text": "Would be amazing! What is the link to your site?  \n  \n  \nName: RewriteBar  \nLink: [https://rewritebar.com](https://rewritebar.com)  \nDescription: Improve your writing in any macOS application with the help of AI. Correct grammar errors, rewrite your text differently, translate a sentence quickly or create your own AI action.",
                    "replies": [
                        {
                            "author": "m91michel",
                            "text": "Found the link :) I am already listed 🎉"
                        }
                    ]
                },
                {
                    "author": "rfbabeheer",
                    "text": "[Savvyshot](https://savvyshot.app) \\- Craft beautiful screenshots with ease on Windows and Mac. Balance off-center shots, redact sensitive info, and annotate screenshots instantly"
                },
                {
                    "author": "NoMuscle1255",
                    "text": "My startup directory - [softoultra.com](http://softoultra.com)"
                },
                {
                    "author": "n0c0de1",
                    "text": "[https://1pg.notion.lol/](https://1pg.notion.lol/) : Your impressive [personal](https://elon.notion.lol/), [corporate](https://nocode.notion.lol/), [side project](https://stillwater.notion.lol/) from a [notion page](https://mixolydian-beam-138.notion.site/Elon-s-Awesome-Blog-1495ef6ff6168139980dd9c72ea3ce1a)"
                },
                {
                    "author": "killMontag",
                    "text": "[FlexiBoard: Keyboard Shortcuts](https://apps.apple.com/lk/app/flexiboard-keyboard-shortcuts/id6504126669)\nAn app that lets you access some useful tools from your iOS keyboard (clipboard manager, bookmarks, calculator, calendar and much more)\n \n[Twitter](https://x.com/abdulllahajmal?s=11)"
                },
                {
                    "author": "Both-Blueberry2510",
                    "text": "[Octo](https://chromewebstore.google.com/detail/octo/obloifdoiohdfcnimbahlphceecmjoci)\n@octo_data\nPowerful data analysis tool for Google sheets\n- Chat with data\n- automated analysis and alerts"
                },
                {
                    "author": "horrbort",
                    "text": "Hey 🫵 congrats 🎉🍾🎊🎈on your launch 🚀"
                },
                {
                    "author": "Accomplished_Dot126",
                    "text": "https://libraryio.com/\n\nFor readers tired of being chained to a Kindle or losing their place between devices, LibraryIO offers a sleek, device-independent escape: access your entire eBook library in any browser, with progress synced instantly, zero passwords (just your email), and a distraction-free reader featuring dark mode and minimalist design. Built after years of personal use by a fellow book lover, it’s the stress-free way to read anywhere—whether you’re uploading your first book in seconds or diving into a marathon session. No credit card required to start free, and no ads cluttering your story."
                },
                {
                    "author": "Euphoric_Weather_864",
                    "text": "I'd love to have Dobble listed on your startup directory.   \nStartup name: Dobble  \nLink: [https://chat.dobble.co](https://chat.dobble.co)  \nTwitter: dobble\\_chat  \nShort description: customizable chat with multiple LLMs, commands and prompt library."
                },
                {
                    "author": "ZeroToHeroInvest",
                    "text": "[Adyntel](https://Adyntel.com) - find out if a domain or your competition is running ads on Google, Meta or LinkedIn. No socials yet 😬"
                },
                {
                    "author": "phil9l",
                    "text": "🌶️ https://spicee.me – made a small app with my GF to spice up the intimate life: track time, locations, added a couple of challenges. It really changed the relationships, so we gave it to a few friends, who are happy users now too. Made a landing page to see if I should keep it for us or scale.\nUsers: anyone who wants to add more fun to their relationships."
                },
                {
                    "author": "ResponsibleKing2628",
                    "text": "Awesome! Thank you!\n\nName: IBDComfort\n\nURL: [https://ibdcomfort.com](https://ibdcomfort.com)\n\nDescription: Meal planning app tailored for IBD patients. Releasing public beta soon, maybe next week!"
                },
                {
                    "author": "lukas527",
                    "text": "[freddi.ai](http://freddi.ai) \\- Boost your organic Reddit posts"
                },
                {
                    "author": "Massive-Kiwi6190",
                    "text": "Hey 👋, congrats on the amazing growth of your startup directory! 🎉 My extension is almost ready—it's fully developed and will be deployed in just one week. I’d love to take advantage of your generous offer and use the premium features effectively once it's live. Since you're offering this to only 5 people, I completely understand if timing is a concern, but if there's any chance you could reserve a spot for me until next week, I’d truly appreciate it. Thank you for this great opportunity!"
                }
            ]
        },
        {
            "title": "Why isn't there a Goodreads for podcasts?",
            "author": "varun-1-",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "SaladPlus1399",
                    "text": "from a revenue standpoint, the cool thing with GoodReads is that it makes money from affiliate links to books. Harder to do if all you recommend is a podcast (almost all are free). Would be a fun side project though.",
                    "replies": [
                        {
                            "author": "varun-1-",
                            "text": "Yea monetization is a good point.. I think if it reached a large enough audience you could run some ads basically similar to Spotify's free tier",
                            "replies": [
                                {
                                    "author": "SaladPlus1399",
                                    "text": "Yea, it's just me & my tendency to prefer business who are profitable from day 1"
                                }
                            ]
                        },
                        {
                            "author": "DiogoSnows",
                            "text": "💯 agree, but videogames and board games would be a completely different story 😉",
                            "replies": [
                                {
                                    "author": "SaladPlus1399",
                                    "text": "yea, goodreads for video games would be fun. Is there anything like it?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "StereoForest",
                    "text": "there are a few in this space like goodpods and podchaser",
                    "replies": [
                        {
                            "author": "varun-1-",
                            "text": "Ohh I didn't know about these, thanks for sharing will check them out"
                        }
                    ]
                },
                {
                    "author": "armleuning",
                    "text": "Podimo is a big one"
                }
            ]
        },
        {
            "title": "I built an app to track website stats from Plausible Analytics on iOS devices, complete with home widgets!",
            "author": "rfbabeheer",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "rfbabeheer",
                    "text": "As someone who loves to keep a close eye on website performance, I’ve often found myself wishing for a simple, mobile-friendly way to monitor key website stats on the go. Sure, Plausible has a great web dashboard, but when you want quick insights without opening a browser, something is missing.\n\nThat’s why I built **Applausible**. I wanted a dedicated app that gives me instant access to key metrics like current visitors, top pages, and visitor sources—right from my iPhone or iPad. The goal was to create something minimal, fast, and reliable for Plausible users who need instant insights wherever they are.\n\nWith **Applausible**, you can:  \n📊 See website visitor counts  \n🌍 Quickly check top-performing pages and top countries  \n🛠️ Effortlessly monitor stats with a clean, intuitive interface  \n📱 Use a home widget to keep your stats always in view  \n☁️ Sync your configured settings seamlessly across all your devices using iCloud\n\nThe app's UI has been optimized for both iPhone and iPad, ensuring a smooth and enjoyable experience no matter which device you’re using.\n\nYou can try **Applausible** free for 7 days and explore all its features. This is still an early version, and I know there’s plenty of room for improvement. That’s why I’m inviting you to try it out, explore the features, and share your thoughts. Your feedback will help shape future updates—what works well, what’s missing, and what would make **Applausible** even better.\n\nIf you’re a Plausible user and want a simpler way to keep track of your website stats, you can check out **Applausible** [here](https://apps.apple.com/us/app/applausible/id6737839249). I’d love to hear your experience and ideas! 🚀"
                },
                {
                    "author": "Complex-Translator26",
                    "text": "That's so cool, love the idea!",
                    "replies": [
                        {
                            "author": "rfbabeheer",
                            "text": "Thanks!"
                        }
                    ]
                },
                {
                    "author": "scastiel",
                    "text": "This is very cool, I've been looking for this app for a long time now! Just started the free trial, but no doubt that I'll continue using it!\n\nFeedback about setting up:\n\n\\- At first it was unclear the difference between \"Custom domain\" and \"Domains\"\n\n\\- I had to set the custom domain to \"plausible.io\", even though it seems it should be automatic. The error (\"Check your internet connection\") was also misleading.\n\nBut now that everything is set up, it's very smooth, congratulations!",
                    "replies": [
                        {
                            "author": "rfbabeheer",
                            "text": "Thanks for the feedback! Will address this issue for future release."
                        }
                    ]
                },
                {
                    "author": "SUPRVLLAN",
                    "text": "Nice! Do Umami next."
                },
                {
                    "author": "MoulayCherifinvest",
                    "text": "Here is some FREE ADVICE \n\nLet me share some of the underutilized strategies for marketing a SaaS business on Instagram. First, instead of using traditional cold ads, build an *exclusive community funnel*. Start by running ads offering free access to a private Instagram group where members get insider tips or tutorials related to your SaaS niche. Inside the group, subtly position your product as the essential tool everyone there needs. Second, tap into *micro-moments marketing*. Create carousel posts or short Reels that answer hyper-specific questions or pain points your audience Googles but doesn’t expect to find on Instagram—this builds instant trust. Third, leverage *hidden lookalike audiences*. Instead of basing your ads on obvious customer data, create a lookalike audience of people following Instagram accounts that serve complementary (but not competing) niches, giving you a fresh pool of untapped leads.\n\nThese strategies are rarely explored, so you’re welcome to try them yourself if you’re up for the challenge. But if you’re looking for a proven approach tailored to your business, I’ve already refined these ideas into a system designed to deliver results. You can experiment on your own or partner with me to make it happen—it’s up to you!"
                }
            ]
        },
        {
            "title": "All Chrome Extension Reviews in One Place [Daily Updates] ✨",
            "author": "trungpv",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "trungpv",
                    "text": "✨ [https://webextension.net/recently-reviews](https://webextension.net/recently-reviews)"
                },
                {
                    "author": "InternalVolcano",
                    "text": "This is really useful.",
                    "replies": [
                        {
                            "author": "trungpv",
                            "text": "Thank you 🙏"
                        }
                    ]
                },
                {
                    "author": "MMORPGnews",
                    "text": "I recently started to making my own extensions. It's not hard at all. "
                },
                {
                    "author": "Airwic",
                    "text": "thx !!"
                }
            ]
        },
        {
            "title": "How My App Became No. 1 on Taiwan's App Ranking Overnight",
            "author": "NeroScore",
            "text": "Hey Reddit! I wanted to share an exciting journey about how our app,[ X Mirror – CarPlay Screen Mirroring](https://apps.apple.com/mt/app/xmirror-screen-mirroring/id6469104483?platform=iphone), climbed to the top of Taiwan's free app ranking in just one night. (No.1 as productivity tools, and No.6 in the total ranking board)\n\nhttps://preview.redd.it/xjsw1m6l1vee1.png?width=1544&format=png&auto=webp&s=76c912013595ad5cf71d829d874cc42018336c23\n\nhttps://preview.redd.it/5h3dyd0h1vee1.png?width=1573&format=png&auto=webp&s=0595631b24699e658165e7e957e5014e6afbeb71\n\nHere’s the story behind it and what we learned:\n\nThe Background: We launched X Mirror last year as a side project. Initially, it only got a few organic downloads and minimal revenue ($0 in the past few months). Growth was stagnant, and we weren’t sure what to do next. But after one bold move, we got over 1.4k downloads overnight and hit No. 1 on Taiwan’s free app ranking!\n\n# What We Did:\n\n1. **Made It Free for a Month** We decided to make the app completely free for one month. The goal? To attract more target users, gather authentic feedback, and improve the app based on real user insights. It was a risky move, but we felt it was worth a shot to restart growth, it can't be worse anyway.\n2. **Spread the Word Across Platforms** We promoted the free campaign across multiple platforms and regions.\n   * **English-Speaking Regions**: Reddit turned out to be a goldmine. We got meaningful interactions, and within a day, this alone drove over 600 downloads in the US.\n   * **China Mainland**: We collaborated with related WeChat official accounts, getting some free promotion through their network.\n   * **Taiwan**: We tried multiple channels, including Reddit and forums, but initially saw little traction.\n3. **The Power of Organic Spread** Initially, our promotion in Taiwan seemed like a flop. But thanks to our multilingual preparation, the app caught the attention of influential X accounts, who gained a considerable impression, and the post later got re-tweeted and shared on PTT (Taiwan's largest forum). These posts sparked a wave of organic interest, leading to an immediate, massive surge in downloads and catapulting *X Mirror* to No. 1 on Taiwan’s free app chart overnight.\n\n# Lessons Learned:\n\n* **Right Target Area**: In terms of app positioning - Our app targeting CarPlay screen mirroring, and especially Tesla carplay screen mirroring. There is a huge gap between the existing product and user need to start with. In terms of regional choice - We chose the US, China and Taiwan to start with for the potential market value.\n* **Pre-Work Pays Off**: Carefully planning, collaborating, and promoting across multiple platforms helped build momentum.\n* **Luck Matters, of course**: Getting picked up by influential accounts and forums played a huge role, even though we didn’t anticipate it.\n\nThe best part? We didn’t spend a single penny on ads! It was all about strategic targeting, consistent effort, and a bit of good fortune.\n\nFinally, if you're interested in this free offer, you can get it from App Store: [X Mirror – CarPlay Screen Mirroring](https://apps.apple.com/mt/app/xmirror-screen-mirroring/id6469104483?platform=iphone) (The offer will end on 28th Feb)",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "Safe_Mousse_5660",
                    "text": "Wow amazing. Could you please share the platforms for china and taiwan?",
                    "replies": [
                        {
                            "author": "haikusbot",
                            "text": "*Wow amazing. Could*\n\n*You please share the platforms for*\n\n*China and taiwan?*\n\n\\- Safe\\_Mousse\\_5660\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")"
                        },
                        {
                            "author": "NeroScore",
                            "text": "For China we contacted app listing sites like Mergeek, APSGO, and some WeChat Accounts. For Taiwan, there're forums like PTT, Mobile 01 (both quite hard to register if not a local), and of course Facebook, Instagram, etc."
                        }
                    ]
                },
                {
                    "author": "Mkreol75",
                    "text": "Hello open source application"
                }
            ]
        },
        {
            "title": "I need a team",
            "author": "Radiant_Donut7645",
            "text": "Hey guys! Recently, I got a new startup idea, which in my opinion has a great potential. This website will be extremely useful for those people, entrepreneurs, who are mentally ready to start their first business, but don't have enough skills or support to do it. If you are interested( or/and you are good at programming:) ), please, feel free to DM me!",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "MixPuzzleheaded5003",
                    "text": "Just try to build a landing page and a waitlist first, validate the need for it, use Carrd, Vercel, Framer, Lovable, Bolt, Webflow, and create it and then promote the heck out of it. \n\nYour ideas, even products are worth nothing unless people want to pay money for it. \n\nEven for a basic MVP to validate, you don't need a programmer to split equity with.",
                    "replies": [
                        {
                            "author": "flamkiche",
                            "text": "This is the way."
                        }
                    ]
                },
                {
                    "author": "GlitteringCookie6282",
                    "text": "Did you are a programmer yourself ?",
                    "replies": [
                        {
                            "author": "Radiant_Donut7645",
                            "text": "I‘m not) That’s the point)"
                        }
                    ]
                },
                {
                    "author": "alkatraz445",
                    "text": "Be prepared to split the spoils 50/50 with the CTO",
                    "replies": [
                        {
                            "author": "Radiant_Donut7645",
                            "text": "Yeah, I get it"
                        }
                    ]
                },
                {
                    "author": "Unlikely-Version8447",
                    "text": "Hello can i DM you ?"
                },
                {
                    "author": "EavenRedditor",
                    "text": "Send me a dm, I need more information."
                },
                {
                    "author": "Dapper_Reputation186",
                    "text": "Just DMed you"
                }
            ]
        },
        {
            "title": "Built a Program to Render Any 3D Shape Inside a PDF",
            "author": "Embarrassed_Song_534",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": []
        },
        {
            "title": "Is this app worth it?",
            "author": "ZuesSu",
            "text": "[External Link]",
            "subreddit": "SideProject",
            "comments": [
                {
                    "author": "Opposite-Bug9447",
                    "text": "Yes it's your work be proud of it, I'm proud of it and it looks very well done as time goes on you should improve on it, this is something you can present to people even if it doesn't become something very big 🔥💪"
                }
            ]
        }
    ]
}