{
    "items": [
        {
            "title": "Best Prospecting Tool is Live, Guys!!",
            "author": "Abattoir87",
            "text": "Hey everyone,\n\nI’m really excited to share that **TryTelescope.io** is now live on Product Hunt!\n\nA little bit about us: for the past three years, our team has been working on making B2B prospecting easier. We saw that finding the right leads can be really hard, so we wanted to help solve that. A few months ago, we launched the first version of TryTelescope, and while we celebrated, we knew we could make it even better.\n\nNow, we’ve launched **Telescope 2.0 with Smart Criteria**! This new feature lets you search for leads and companies in a much more personal way. Instead of using basic filters, you can be really specific about what you want. For example:\n\n* Want companies with 5 or more Product Managers and no one in QA? You can search for that.\n* Looking for SaaS companies making mobile apps? TryTelescope can find them.\n* Need leads with a finance degree and 10+ years of experience? We’ve got you covered.\n\nWith Smart Criteria, you get exactly what you’re looking for, faster. Plus, it’s easy:\n\n1. Tell us who you want to find, in your own words.\n2. Look through the list of leads we give you.\n3. Add them straight to your pipeline.\n\nWe’ve also added some other cool features:\n\n* **Unlimited leads for free** – You can now get as many leads as you want, without paying.\n* **Find similar companies** – Upload a list of companies, and we’ll find similar ones for you.\n* **Account-based research** – Upload a list of companies you want to target, and we’ll help you find the best people to contact in each one.\n\nIn a world where most outreach is automated, we still believe that having the right lead data is key to success. TryTelescope helps you do just that—faster and smarter.\n\nWe’d love your support! Please check it out here:[ Telescope on Product Hunt](https://www.producthunt.com/posts/telescope-2-0-2).\n\nI’m really looking forward to hearing your thoughts!",
            "subreddit": "Startup_Ideas",
            "comments": []
        }
    ]
}