{
    "items": [
        {
            "title": "How to look for startup jobs \"I will not promote\"",
            "author": "GranKaikon",
            "text": "Basically the title. I finished my phd and started working in a company just to find corporate is boring as hell. Would like to look for jobs in startups in early phase when jobs are interesting but they can pay a salary. Every platform I see seems to shoy big companies offers. Thanks in advance",
            "subreddit": "startups",
            "comments": [
                {
                    "author": "jacksonxly",
                    "text": "First of all, congrats on your PhD! I’ve worked in a few startups already, so here’s how I approached it:\n\nHonestly, it’s pretty similar to finding a corporate job, but it relies way more on networking. I attended startup events and kept an eye out for startups that sounded interesting to me. I’d ask the founders directly if they were looking for employees and where I could apply. Most of the time, they’d tell me to apply through their website, but sometimes they’d give me their personal email instead.\n\nAnother job I landed at a startup was through my previous experience at a VC. VCs know which of their portfolio companies are looking for talent, so they’ll sometimes recommend you to hire directly.\n\nHope that helps!",
                    "replies": [
                        {
                            "author": "GranKaikon",
                            "text": "Helps a lot! Tysm"
                        }
                    ]
                },
                {
                    "author": "charvi5",
                    "text": "Try out angellist",
                    "replies": [
                        {
                            "author": "CodingWithChad",
                            "text": "Wellfound (formerly Agenlist)"
                        }
                    ]
                },
                {
                    "author": "ladybuglise",
                    "text": "Follow folks working at YC and a16z- they’re always posting giant lists of salaried openings at companies in their portfolios!",
                    "replies": [
                        {
                            "author": "GranKaikon",
                            "text": "Sorry for my ignorance but, what are YC and a16z-?",
                            "replies": [
                                {
                                    "author": "Aspos",
                                    "text": "https://www.workatastartup.com/\nApply to top YC startup jobs"
                                },
                                {
                                    "author": "ladybuglise",
                                    "text": "Y Combinator and Caitlin Cooke from Andreessen Horowitz frequently posts those hiring lists on LinkedIn!"
                                },
                                {
                                    "author": "FriscoFrank98",
                                    "text": "YCombinstor and a16z are two of the largest and reputable VC firms. Think “Ivy League” of the VC world"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NewNollywood",
                    "text": "What's your PhD in?"
                },
                {
                    "author": "AutoModerator",
                    "text": "hi, automod here, if your post doesn't contain the exact phrase \"`i will not promote`\" your post will automatically be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/startups) if you have any questions or concerns.*"
                },
                {
                    "author": "ryan_san4d",
                    "text": "If you live in a popular area like San Francisco or Salt Lake City, local conferences and chamber of commerce events always have networking opportunities. I was stunned at the amount of opportunities I had to work for start ups by attending conferences like door-to-door sales conference in SLC a few weeks ago. Go find conferences or public events where companies have booths and start taking names. Hope this helps!",
                    "replies": [
                        {
                            "author": "GranKaikon",
                            "text": "I hope I lived there haha, but I'm from Spain. Going abroad is an option tho"
                        }
                    ]
                },
                {
                    "author": "StartupSherpa",
                    "text": "Congratulations on the PhD! Having been in the startup world my whole career, 30 years now, networking is usually the best route to take. Your alumni network is a good place to start, along with seeing what startups are related to the university where you got your PhD. The first startup I joined was doing work at the university where I was getting my PhD, so I approached them to see if they needed an engineer. At the time, they were contracting work at the university that was very similar to what I was doing for my thesis. I got hired as their first full-time employee.\n\nWellfound is a site where startups will post jobs. Many VCs will also post jobs available at their portfolio companies. You can also check LinkedIn. Many times, though, due to the potential high costs of recruiting, startups will hire through word-of-mouth. Which comes right back to networking!\n\nConsidering you have a PhD, then you likely have specialized knowledge and experience that will fit really well with the right startup. Take a targeted approach to finding those startups where your skill set will be invaluable. Even if they don't have a job posted, it can't hurt to contact them. Maybe you can initially consult with them and eventually get hired. This is how I got my 2nd startup job.\n\nGood luck!",
                    "replies": [
                        {
                            "author": "GranKaikon",
                            "text": "Tysm for the detailed response. I'm gonna try startups related to my uni, although I actually developed the thesis in an associated research center so minimum contact with uni ecosystem."
                        }
                    ]
                },
                {
                    "author": "already_tomorrow",
                    "text": "[https://en.wikipedia.org/wiki/May\\_you\\_live\\_in\\_interesting\\_times](https://en.wikipedia.org/wiki/May_you_live_in_interesting_times)\n\nWhat you call interesting sometimes involve more drama than in the Housewives of-franchaise, with you (as a non-founder) sitting there like an unwanted child getting weaponized/abused during an epically bad divorce by a group of polyamorous drunkards.\n\nThat whole \"they can pay a salary\"-thing is a watershed moment that you ideally want to happen after you've joined, so that you don't end up as just one of many new recruits after they've raised a lot of money (when there's lots of new people with no established company culture etc). Or, you want the business to already have stabilized with decently sized teams, but that's probably beyond what you'd call an interesting time; so you'd be back to simply doing a regular job.\n\nMy most helpful advice would be to network within your local startup scene. Get a feel for what's out there, whom to trust, and hopefully get noticed by some investors that would want your particular skills to help strengthen a business that they've already invested in.\n\nAs always, start with [meetup.com](http://meetup.com) and see where that takes you."
                },
                {
                    "author": "brabbly",
                    "text": "Lots of venture funds list jobs in their portfolio companies. It's a good place to start"
                },
                {
                    "author": "andupotorac",
                    "text": "1. Go to https://breakoutlist.com/ - if you find one that fits your interests\n2. Seedtable to look for specific city / country\n3. VC portfolios. Find VCs on crunchbase for example or on https://signal.nfx.com/\n\n\nOn how you do it: try to fix something on their product and send it to them without any expectations. Then if they respond you can try to apply they way directly."
                },
                {
                    "author": "kevinkaburu",
                    "text": "Try looking into local startup hubs or tech incubators in your area. They often have job boards for small startups. Networking events can also be gold; founders often attend to find talent. It's more footwork, but you might find that gem you're looking for!"
                },
                {
                    "author": "timelessoutlook",
                    "text": "In my opinion the best way to find startups is with crunchbase. You can get free 7 days trial and directly cancel it if you want. The platform shows all startups which were recently funded or even a while ago. If you are from Germany I can recommend startup insider. Otherwise you can find a lot of startups via the websites of venture capital funds. Just go to any VC’s website and go to their portfolio. There you will see a bunch of startups."
                },
                {
                    "author": "Harotsa",
                    "text": "YC startups have their jobs posted on https://www.workatastartup.com, it’s a pretty convenient place to find and apply to startups.\n\nAlso, if you know a specific field you want to work in you can find startups in the field and most will have job postings in their websites"
                },
                {
                    "author": "baukej",
                    "text": "Related question: I am looking for a co-founder, would I find a cofounder in startup events or should I first find a cofounder before joining those? I am now planning for an ad on LinkedIn but I think I will have little success there (especially in my region, Hong Kong)."
                },
                {
                    "author": "Low_Distribution_507",
                    "text": "VC's usually shares who they invest in on social media like Linkedin. Go to different VC's on Linkedin and scroll through posts to see wich companies they havce invested in. Another way is to look at their portfolio than search for the companies at linkedin and contact them."
                },
                {
                    "author": "azdak",
                    "text": "wait i thought \"i will not promote\" was some kind of meme joking about the flair. is that an actual requirement now? what the fuck is going on?"
                },
                {
                    "author": "alimir1",
                    "text": "HiringCafe lets you select companies in various series"
                },
                {
                    "author": "JacksonSellsExcellen",
                    "text": "YC's hiring site is quite literally called 'workatastartup.com'.  This is where many YC backed startups post open roles."
                },
                {
                    "author": "Ok_Weekend_8457",
                    "text": "Techstars portfolio companies put loads of jobs on https://jobs.techstars.com/ - 3,530 listed when I just checked. \n\nAnd congrats on your PhD!!!"
                },
                {
                    "author": "KILLJEFFREY",
                    "text": "What is this type of problem? I see it via smart enough to make 3x rent, can’t suss out where to live/find an apartment. Smart enough to finish a PHD but can’t type “work at start up” in Google which garnered the following results…\n\n\n- https://www.workatastartup.com/\n\n- https://startup.jobs/\n\n- https://builtin.com/\n\n- https://www.linkedin.com/jobs/startup-jobs-dallas-tx"
                },
                {
                    "author": "josephmgrace",
                    "text": "Save up for a little while then work for no money. You have a Phd, you can always go back to corp if you need the cash, but the oportunity to work on somthing legitimately interesting is worth taking a short term financial hit. Also, working at an early stage startup you should be able to haggle your way into a title/job that's well in advance of where you are in the corp world. If it falls apart after ~3 years (as many do) when you go back to the job hunt you'll be doing it with a much more advanced title. Working at a start up is a great way to leapfrog people in more stable corporate life who tend to experience much slower role advancement."
                }
            ]
        },
        {
            "title": "Stop trying to find a tech cofounder by pitching your idea alone (let’s help new founders) I will not promote",
            "author": "edkang99",
            "text": "Hey you, non technical founder about to post your idea and ask for someone who can develop to join you. \n\nStop for a moment and think about what they deal with on a regular basis from dozens of others like you. \n\nWe’ve seen hundreds of founders try it and get frustrated because nobody responds. \n\nThere is a better way, and that is to prove to that tech founders you can SELL and not just have an idea. \n\nThink about how to stand out to that potential tech cofounder. What do you bring to the table the others can’t? What does a startup need to make it worth their time, risk, and cost of opportunity. \n\nEspecially if you can’t pay them. \n\nThe best tech cofounder I ever had came on because I was already selling and masking revenue with an MVP as a consultant. Not only did I share my idea and vision, I shared my ability to execute and sell. We started off with one project and built chemistry from there. Eventually we interviewed at YC. Every milestone built more trust and commitment. \n\nThis is if you have the idea first. An even better way is to find a problem they want to work on and show that you have founder-market fit. Show them your potential to get initial traction and let them focus on what they want to do. \n\nDreams and promises mean nothing to a competent programmer that could easily stay at their cushy job or have multiple opportunities. \n\nAnother founder I know was a car salesman. He went out and founded a solo founder that made a similar product to his idea in product hunt and said he would prove his passion for the problem by selling. They’re now 50/50 and crushing it (didn’t need investors because of revenue). \n\nIt takes time, too. \n\nA founder once told me after being terribly frustrated with trying to find a tech cofounder. They said, “Ed, it’s like dating to get married but I’m bringing my kids.” I’d never made that connection but so true. \n\nAlright, for the rest of you that have great cofounders, how did you find them? And for you tech cofounders, what do you need to see? How do you wish these founders would approach you instead?",
            "subreddit": "startups",
            "comments": [
                {
                    "author": "Longjumping-Ad8775",
                    "text": "I want to know about the economic impact to me if I decide to work on this.  \n\nTell me about the numbers of users you’ve talked to, the payers you’ve interviewed, the realistic size of the marketplace, etc.  everything else is colored bubbles.",
                    "replies": [
                        {
                            "author": "edkang99",
                            "text": "Yup. Good list.",
                            "replies": [
                                {
                                    "author": "Longjumping-Ad8775",
                                    "text": "Thanks.  You would be shocked at the number of people sending me DMs here or on yc match that haven’t done the basics."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WaltzG",
                    "text": "Solid points made here. I'm a 3x tech founder, and I've worked with the same CEO for all 3 for the past 7 years. He brings numbers, projections and sometimes a waitlist of users. To me, that's enough to warrant energy on a 3-month MVP. Most importantly though, I understand what the project is solving for. Usually a vague 1-liner isn't enough. A mockup, wireframe, temp landing page helps a fair amount in helping to decide whether it's work the risk. ✌️",
                    "replies": [
                        {
                            "author": "edkang99",
                            "text": "That’s great. Reminds of why some directors always cast the same actors. Great partnerships are precious."
                        }
                    ]
                },
                {
                    "author": "ctrlalteva",
                    "text": "technical person here\n\n95% of non-technical founders either radiate sketchy linkedin influencer/marketer energy or are like if your easily angered narcissistic uncle wanted you to work for him for free",
                    "replies": [
                        {
                            "author": "NewNollywood",
                            "text": "🤣🤣🤣🤣"
                        }
                    ]
                },
                {
                    "author": "ytrfhki",
                    "text": "I’m non-tech and gearing up to go out to a few engineers to gauge interest in joining me as tech cofounder in the next couple of weeks. I do not have a MVP, just an idea, but I have prepared quite a bit in that I’ve essentially built out the data room that I would/will also share with investors when the time comes:\n\n- 10 slide pitch deck\n- 5 year pro forma financial model (250 rows capturing all aspects of cash flow)\n- 7 page high-level roadmap/build outline\n- 3 pages of product brochures\n- workbook of market research (TAM/SAM/SOM, competitive analysis)\n- software needs and consulting resources to utilize\n- investors within my network to target\n- early hiring needs and those within my network I will reach out to first\n- targets for LOI’s to show interest pre-fundraise (want a tech experts input before approaching)\n- initial milestones to hit over next 3 years\n\nAlso worth mentioning I have pretty deep industry experience including within a couple successful startups in the space that I joined early, which is why I think I can get away with skipping the non-funded MVP phase. We’ll see. \n\nGoing to also start with those in my network and working at a startup in the industry for tech co-founder role, as they will likely be more receptive and knowledgeable of what I’m trying to build.",
                    "replies": [
                        {
                            "author": "edkang99",
                            "text": "Great approach. Keep us posted!"
                        }
                    ]
                },
                {
                    "author": "AutoModerator",
                    "text": "hi, automod here, if your post doesn't contain the exact phrase \"`i will not promote`\" your post will automatically be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/startups) if you have any questions or concerns.*"
                },
                {
                    "author": "AndyMagill",
                    "text": "> “Ed, it’s like dating to get married but I’m bringing my kids.” I’d never made that connection but so true.\n\nWhat?! No you don't have \"kids\" yet. Or else why would you need a tech co-founder? By definition, \"founder\" means you are starting something. You are looking to build a future with someone, and maybe you have some interesting ideas about what they will create, but you haven't birthed anything yet.\n\nMaybe you have already done market-fit and outreach, but the idea is nothing without the capacity to make it real. If a non-tech founder struggles with this concept, they will struggle to work with engineers."
                },
                {
                    "author": "Mesmoiron",
                    "text": "Maybe that's true. But nobody believes it anyway, because they can't imagine. Have you tried to convince Maga, have you tried to convince people there's a better way to do certain things? Most people will rather be scammed (Trump Coin etc) then trying to work on a coin, that won't be a scam. So, yes, I might haven't got a lot. But I do know what I do have. It's very rare. Because I talked to many people, I know precisely what they're lacking. They can't believe that something can be different. Thus, I don't have to rush to the exit. Don't come to me about fintech, crypto. I can sniff out immediately what the goal is. Fintech is creating the same bad reputation as crypto. Maybe you find a co-founder for example, but the weakness is still there. I am not impressed. Even though nobody looks down on my wild ideas. They chose comfy, I chose soft collision. As long as nobody believes anything, I have all the time in the world. It takes only drops to erode a stone."
                },
                {
                    "author": "PrimaryMine06",
                    "text": "I get where you’re coming from, but I don’t think it’s fair to say that sharing an idea won’t get you anywhere. I think it really depends on the specifics of the situation and the person you’re approaching. I mean, yeah, you gotta have more than just a concept written on a napkin, but it’s also about connecting with the right person. My buddy found his cofounder just by talking about his idea at a casual meetup—they clicked because of mutual interests, not some grand sales pitch or proven sales track record. \n\nSure, it’s rare, but it shows that sometimes being genuine can work. For me, it's less about matching a business resume and more about the vibe and shared vision. Don't get me wrong—having traction is obviously attractive, and if you can show that you’re making moves, that’s awesome. The hard part is that it takes time to find someone who sees the same potential you do.\n\nIt’s similar to finding a job. Everyone wants it perfect right out of the gate, but sometimes you just find the right fit and work from there. And yeah, sometimes it feels like trying to spot a unicorn but there’s more to it. We shouldn’t discourage those who are genuinely trying to put themselves out there—they just need to approach it with sincerity and some groundwork. Speaking from my experience, you meet all kinds and sometimes those genuine connections turn out to be the most fruitful. Just my two cents, for anyone who's new out there looking for partners. Maybe I ramble too much..."
                },
                {
                    "author": "Notsodutchy",
                    "text": "I would also add: making a low effort “I need a co-founder. What do I do?” post is NOT a good look.\n\nLike seriously… if you can’t take 30 minutes to search and read the thousands of other posts answering this question, are people really supposed to take you seriously?\n\nI’d love to see some more higher-effort posts where OPs actually acknowledge all the existing advice, state what they are trying and ask a more nuanced question related to how they are executing the given advice."
                }
            ]
        },
        {
            "title": "How Do You Know You're Ready to Build a Startup | I will not promote",
            "author": "mouhurtikr",
            "text": "Hello Guys,\nI have been planning and working on building a product however I get delayed everything as whenever I start working or finalize something I always find room for improvement or I feel I need to learn something more.\nAm unsure if am just procrastinating and waiting for perfection or am I doing the right thing or not.\n\nLet me know your suggestions/experience\n\n\nP.S- I am a Data Science Major my specialization and focus is on Machine Learning however I do have decent WebDev Skills and I wanna work on something less complex as my first project.",
            "subreddit": "startups",
            "comments": [
                {
                    "author": "nhepner",
                    "text": "You are not ready to build a startup and there is nothing that prepares you except failure.\n\nNo joke. There's a TON of advice out there. Even on these boards. The fact is, if somebody knew the opportunity space you were planning to work in as well as you do, they would already be doing it. As good as that advice is, nobody will understand your business the way that you do. \n\nI'd say that you need to be able to constantly objectively evaluate the work that you've done and pivot quickly.\n\nBeyond that, for you, \"Perfect is the enemy of good\".\n\nJump in. Both feet. It'll be the best and stupidest thing you've ever done."
                },
                {
                    "author": "ryanrutan",
                    "text": "You're stuck in a pretty common loop for early founders - good news, it has some easy solutions! This is most common for founders like you who are also capable builders, where the comfort zone is building things. \n\nLet me break it into 5 steps I use when working with Founders in this same rut.\n\n1. Start with the problem - not the product.  \n  \nBuilding a product in a vacuum leads to endless tweaking because you don’t have a clear measure for \"success\". I push founders to identify a real problem that someone (ideally, a specific group of people) is struggling with. \n\nA good problem is:\n\n• Painful: It’s something people *really* NEED solved, not just a nice-to-have.\n\n• Frequent: It happens often enough that solving it provides value and people are  reminded of its existence.\n\n• Specific: You can explain it in a single sentence, like: “College grads struggle to track job applications effectively.”\n\n  \n2. Talk to Real People\n\nFind potential users and ask them about their problems. I love Rob Fitzpatrick's \"Mom Test\" book for this. Talking to real people will give you clarity on whether your idea is relevant and what “done” looks like - because you can assess how well or to what degree the current state addresses the problem. No more guessing if it needs more features.\n\n  \n3. Solve Just One Part of the Problem\n\nYour first project doesn’t have to be complicated or perfect. It just needs to solve *one* aspect of the problem well. Really well.  \n  \nFor example:\n\n• Instead of building a full-featured job application tracker, start with a simple spreadsheet-like app that makes it easy for those college grads to keep tabs.\n\n  \n4. Validate Really Fast\n\nBuild the simplest version of your solution (an MVP) and test it with users to see if it actually solves their problem. If they use it, give feedback, or are willing to pay for it, you’re on the right track. If not, adjust based on what you’ve learned. Don't try to solve it all - learn one thing at a time and keep moving.\n\n5. Admit that done enough IS  done enough\n\nWhen users start telling you, “This solved my problem!” or “This is helpful, but it would be better if it did X,” you know you’re making strides. These conversations replace the guesswork about whether you’re procrastinating or improving.\n\n  \nSo, by starting with a real problem, you’ll always know whether you’re making meaningful progress because the goal becomes concrete - it's impacting that problem positively, if not completely. Keep it simple, stay focused on the problem, and let the outcomes be your guide!"
                },
                {
                    "author": "heyuitsamemario",
                    "text": "The kind of person who is ready to build a startup probably isn’t seeking external permission on an internet forum",
                    "replies": [
                        {
                            "author": "nhepner",
                            "text": "I give permission. Fuckin GO GO GO GO GO GO GO!!!!!!"
                        },
                        {
                            "author": "mouhurtikr",
                            "text": "Well I sought some advice not permission both are different",
                            "replies": [
                                {
                                    "author": "heyuitsamemario",
                                    "text": "When it comes to startups, there is no difference between the two"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AutoModerator",
                    "text": "hi, automod here, if your post doesn't contain the exact phrase \"`i will not promote`\" your post will automatically be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/startups) if you have any questions or concerns.*"
                },
                {
                    "author": "unfamiliarjoe",
                    "text": "You believe in yourself and you start it."
                },
                {
                    "author": "ComfortableParsley83",
                    "text": "![gif](giphy|wi8Ez1mwRcKGI)"
                },
                {
                    "author": "Able-Development9269",
                    "text": "when you're bored af, want a better purpose, don't give a flying f\\^ck about what others think, are okay with 1000s of rejections, can work 80+ hours at no pay, okay to survive on ramen, and really care about a success not defined by the money you make, but the impact you have."
                },
                {
                    "author": "yoRaikatsi",
                    "text": "Your mind sometimes will think about yourself that you are not ready or you are not skilled enough to do any specific thing in this world, but if you see yourself from 3rd perspective or if you see yourself that you are made for that work you will realise that you will do good.. \n\nYou might not be good in sales might not be in team building might not good in your health management, but if you are good in your skills, and can see that that you can earn a single percent from that skill. \n\nIt means your skill demands your work, your time and your efforts. \n\nYou will learn all the business essentials tools within the time.\n\nAll you have to do is be patient and start creating."
                },
                {
                    "author": "adeeysidu098",
                    "text": "Perfection can be the enemy of progress. If you’ve got a decent idea and some skills to back it up, just start building. You’ll learn way more by doing than by waiting to feel 'ready.' Keep it simple, ship something, and improve as you go"
                }
            ]
        }
    ]
}