{
    "items": [
        {
            "title": "Who are your dream angel investors—those you wish would invest in your startup?",
            "author": "AdNo6324",
            "text": "I'm building a new startup and working on a list of individuals I’d love to have on my cap table (regardless of whether they  invest or not).\n\nFor those who know angel investors personally, who is that one person you'd want on your cap table, and why?\n\nI'm building a marketplace, so Brian Chesky ticks all my criteria",
            "subreddit": "ycombinator",
            "comments": [
                {
                    "author": "Odd_Hornet_4553",
                    "text": "Stop thinking of your dream investors and start thinking of your dream customers.\n\nMost of the successful businesses I personally know of never got any investors AT ALL.",
                    "replies": [
                        {
                            "author": "RogueConscious",
                            "text": "👆🏼Needs more upvotes. Not necessarily every company needs to/can bootstrap but being obsessed with customers should be the mantra rather than being obsessed with investors."
                        },
                        {
                            "author": "Real_Bet3078",
                            "text": "Great answer - focus on the customer. Then worry about the rest"
                        },
                        {
                            "author": "AdNo6324",
                            "text": "Read my post again! I didn't talk about MONEY! \n\nAt some point in your startup journey, you'll need to scale. And sometimes, it's not about the money—it's about finding that one incredible individual who can catapult your success through their character and unique capabilities, IM TALKING ABOUT A FOUNDER  angels who share their prior experience with you so you don't make the same mistake again"
                        }
                    ]
                },
                {
                    "author": "Tall-Log-1955",
                    "text": "A successful founder once told me that all investors are \"dumb money\".  Some know it and some don't.",
                    "replies": [
                        {
                            "author": "Hogglespock",
                            "text": "Strongly agree. I once detailed out who my dream vc investor was, met them and have never been so disappointed."
                        },
                        {
                            "author": "sueca",
                            "text": "I'm just a rookie, but the investors I'm taking in are getting board seats and from my perspective it feels so calming and nice to have experienced entrepreneurs help out and do some work."
                        },
                        {
                            "author": "theonlyvasudev",
                            "text": "It's not true man they are far smarter about their returns"
                        }
                    ]
                },
                {
                    "author": "glaksmono",
                    "text": "Following this. I heard Ron Conway is really good"
                },
                {
                    "author": "ePerformante",
                    "text": "Not an angel but Masayoshi Son",
                    "replies": [
                        {
                            "author": "Visual_Collar_8893",
                            "text": "His belief in Adam Neuman makes one rethink his great his acumen really is.",
                            "replies": [
                                {
                                    "author": "Johannes_silentio",
                                    "text": "That makes him an ideal investor."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Automatic_Barber818",
                    "text": "Reminds of this 😂 sorry for laughing man \n\nhttps://preview.redd.it/c3owjaewdzee1.jpeg?width=640&format=pjpg&auto=webp&s=5ff3349113fe53d6e52c76591eeca11e7dc0f129"
                },
                {
                    "author": "Johannes_silentio",
                    "text": "I personally would like investors who become mentally incapacitated shortly after giving me their money."
                },
                {
                    "author": "theonlyvasudev",
                    "text": "The one who can understand the economics and dynamics of the market put some value on the table rather than just throwing money around"
                },
                {
                    "author": "datograde",
                    "text": "I agree with you – every startups' dream investor list is unique. The best is when you get a lot of experienced founders and operators in your space, who can help you think deeply about the road ahead."
                },
                {
                    "author": "worriedbunny24",
                    "text": "Probably other founders I respect, like Eric Glyman"
                },
                {
                    "author": "IfAndOnryIf",
                    "text": "Honest question: other than giving you tons of money while taking a low %, what makes an investor good?"
                },
                {
                    "author": "Babayaga1664",
                    "text": "John doerr and Vinod Khosla"
                },
                {
                    "author": "LostBar9889",
                    "text": "Early stage investors / advisors do not play a material role in your company's success. Get the best terms you can. Nobody can replace booking customer calls from 9am to 9pm pre-pmf. Much later on they may be important for initiating channel partner conversations"
                },
                {
                    "author": "ms4329",
                    "text": "Get a few angels running companies a few stages ahead of yours in similar/orthogonal spaces, especially ones that’ll give you the time of day. \n\nAnd don’t listen to the crappy advice on here and elsewhere - great angels can provide a ton of advice that can help you prevent making avoidable mistakes. Just think more about the person and how their experience is relevant to your company, rather than their supposed clout / brand-name since that rarely ever helps with customers/recruiting and they’d likely have little-to-no time to truly help you out on the day-to-day, even if they’re investing a significant amount eg: a $500k angel check.",
                    "replies": [
                        {
                            "author": "Appropriate-Chair301",
                            "text": "That's the best advise I've read on here yet.  Realistically that's what most business owner need more than anything is the experience and help to avoid mistakes.  That alone is worth millions to both the investors and the founder. Awesome!"
                        }
                    ]
                },
                {
                    "author": "HappyCraftCritic",
                    "text": "Other former founders who are hands on with connections but still let you steer the ship"
                }
            ]
        },
        {
            "title": "Stop Waiting for the \"Perfect Idea\" – Start Building",
            "author": "theonlyvasudev",
            "text": "If you’re waiting for the “perfect idea” before you start working on your side project, you’re probably never going to start. The best time to begin is right now - even if your idea isn’t fully fleshed out or perfect. The truth is, most successful side projects aren’t the result of a groundbreaking idea; they’re the result of consistent execution, iteration, and learning from mistakes along the way.\n\nInstead of waiting for perfection, focus on building something small but meaningful. Start with what excites you, get feedback, and improve as you go. The project you work on now will teach you more than waiting for the ideal “eureka” moment.\n\nBuild first, refine later - you’ll learn more from doing than from thinking about it.",
            "subreddit": "ycombinator",
            "comments": [
                {
                    "author": "OkManufacturer6506",
                    "text": "This is exactly what happened to me, i built a platform i thought was cool, when trying to sell it to a customer they told what i could actually build to solve one of their biggest problems and thats what i have been working on and its going pretty well, over time i discovered a lot of people had the problem, all you have to do is just keep moving and learning, focus on problems, not solutions and the money will find you",
                    "replies": [
                        {
                            "author": "theonlyvasudev",
                            "text": " Focus on solving real problems, not just building cool things, money will follow. Learning & executions are the keys."
                        }
                    ]
                },
                {
                    "author": "time_2_live",
                    "text": "This is my biased opinion, but don’t just start “building what’s cool” if you’re trying to build a business.  Do that if you’re trying to have a hobby. \n\nIf you want to build a business, choose a group to build for, and start by first asking them what their day to day looks like. Doing that lets you understand the user group on a deep level, and lets you find problems/frictions that they might have. You can try and ask what their problems are, but that isn’t typically useful as people don’t always know what their real problems are, and things are even worse if you ask what potential solutions they’re willing to accept.",
                    "replies": [
                        {
                            "author": "theonlyvasudev",
                            "text": "Totally agree! Building for a specific group and understanding their daily struggles is key. People often can’t get their problems, but observing their workflows and pain points can reveal the issues."
                        },
                        {
                            "author": "Silly_Illustrator_56",
                            "text": "It is even better to not build something for someone. The best thing is your work in a specific field and have an usual pain point and you want to fix it. \n\nThis thing with \"I want to build something\" just to be a fiver and get money will always fail. You have to have a intrinsic need to solve something to make it better for everyone.",
                            "replies": [
                                {
                                    "author": "time_2_live",
                                    "text": "I don’t always agree with this. Building for yourself as a client sometimes causes issues as you don’t always match the average user. \n\nIMO part of being an entrepreneur is learning to become motivated to help a group of users."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Some-Huckleberry9381",
                    "text": "I wanted to hear this so badly."
                }
            ]
        },
        {
            "title": "How do you make your first few hires? Who do you target?",
            "author": "Physical_Case6369",
            "text": "does everyone just recruit via their own networks? ",
            "subreddit": "ycombinator",
            "comments": [
                {
                    "author": "epicchad29",
                    "text": "Own network is easiest. Could also try to recruit people off of LinkedIn who impress you and work on related things"
                },
                {
                    "author": "Winter_Hurry_622",
                    "text": "Look for someone who has worked in startups, talk with them, get to know them personally.\nSkills can be developed, but character is crucial. If it's a first few hires try to hire who'll stay for long time.\nThere's a many such candidates around the globe hard to know so it'll be like searching for needle in haystack.\nTry to understand the difference between pretenders and people who do they real work, lot of bs out there.",
                    "replies": [
                        {
                            "author": "gravity_over",
                            "text": "It's absolutely true! While there are plenty of software developers with technical expertise but finding a startup-oriented developer is much harder. Such developers not only understand the unique challenges and fast-paced nature of startups but also deeply care about driving growth and creating long-term value. They go beyond just writing code, focusing on building scalable solutions and aligning their work with the company's vision."
                        }
                    ]
                },
                {
                    "author": "Independent_Lynx_439",
                    "text": "Yes , look for personality and character and align with your work life balance, if they are good in tech you can push him to great t"
                },
                {
                    "author": "shamalbadhe14",
                    "text": "You may focus on \n\n* People from fast-growing startups who've experienced rapid scaling\n* T-shaped generalists who can wear multiple hats\n* Those who've built side projects/businesses, showing initiative\n* Fresh grads from top schools (they're hungry and adaptable)\n\nBeyond personal network, you may think about\n\n* X - engage with builders/makers regularly\n* WellFound and YC job board\n* Discord/Slack communities focused on your industry\n* Cold outreach to people whose work you admire"
                },
                {
                    "author": "theonlyvasudev",
                    "text": "Cold outreach?"
                },
                {
                    "author": "Physical_Case6369",
                    "text": "Has anyone tried hiring a recruiter? Is this worth it/standard?",
                    "replies": [
                        {
                            "author": "bLeezy22",
                            "text": "If you’ve raised funding/have revenue, it can be worth it. You’re paying for your time and sourcing out of your network can be time consuming \n\nI run a search firm. I’ve recruited in house for start ups and at sequoia capital. Feel free to ask any questions!\n\nYour best hire is likely to come from your network though"
                        }
                    ]
                },
                {
                    "author": "scooch0",
                    "text": "Network, job posts, linkedin, recruiters.  \nMeetups is also a good one.  \nI am actually helping founders recruit with AI agents, saving them 62 hours per role. You just meet with the people that excite you.  \nLet me know if you are interested, we can chat."
                }
            ]
        },
        {
            "title": "Does YC ever invest in things that have been done before?",
            "author": "Ultrasive",
            "text": "I’ve been pretty passionate about the cloud computing industry and have a goal of making an even more affordable Kubernetes provider. I have most of it built and would like to create an additional open source SDN routing solution based on VPP and handle a lot of L2 and L3 within Sonic switching for automation. \n\nGiven that existing solutions exist and I would build it regardless of having investments or not would YC benefit me at all?",
            "subreddit": "ycombinator",
            "comments": [
                {
                    "author": "wowzawacked",
                    "text": "YC invests in lots of things that have been done before, and will be done again. YC invests in startups- startups are companies that have high potential for growth.",
                    "replies": [
                        {
                            "author": "Royal-Fix3553",
                            "text": "great point"
                        }
                    ]
                },
                {
                    "author": "jasfi",
                    "text": "If you do something that's been done before successfully, then that's a positive signal. I've seen very similar things funded by YC. They care far more about the quality of the team (on paper). If your team doesn't look good on paper, you typically need to have traction with huge potential.",
                    "replies": [
                        {
                            "author": "Ultrasive",
                            "text": "I don’t think I look good on paper to be fair, and it’s just me. Honestly can’t afford $15k + $5k(keep my home apartment) to move out to California to be able to learn what YC teaches.",
                            "replies": [
                                {
                                    "author": "jasfi",
                                    "text": "If you can get into YC it would surely be worth it. The investment + network has received rave reviews since their inception.\n\nThe hard part is getting in. Solo founders have a very low acceptance rate. Every now and then someone who doesn't check the usual boxes does get in, that's why people keep applying even if the odds are against them. The application form's questions are useful in their own right, in making you think about what you're doing."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MysteriousVehicle",
                    "text": "Everything that your startup might create has an alternative solution people already use. Thus, in that sense, YC almost exclusively invest in things that have been done before.\n\nGoogle Analytics was around way before mixpanel and amplitude.  \nThere were tons of crypto exchanges before Coinbase.\n\nEvery pizza restaurant delivered before Doordash (who wasnt the first to do that specific thing).  \nCouchsurfing and craigslist were around way before Airbnb.  \nThere were lots of ways to share files before dropbox.  \nSalesforce was already huge when they admitted various SaaS companies that do CRMs.\n\n  \nHell, Honeylove is a YC Top Company and they sell underwear: [https://www.ycombinator.com/companies/honeylove](https://www.ycombinator.com/companies/honeylove)"
                },
                {
                    "author": "Silly_Illustrator_56",
                    "text": "Someday ago I have read about, that YC does not invest in ideas, just into the founder."
                }
            ]
        },
        {
            "title": "What did you do to hire the right business development executive?",
            "author": "DepartureSlight2227",
            "text": "Hiring has been pain these days, especially for the sales role. What did your organisation do to get good candidates join your team for BDE role?",
            "subreddit": "ycombinator",
            "comments": [
                {
                    "author": "NoImpression335",
                    "text": "Depends on how you see the role and what’s right for your vertical. We all know BDM can just be outbound call monkey and it can be a lot more. Have benchmarked the overall compensation against similar roles?\nOnce we were clear on the above it’s just about asking candidates how they would achieve X and Y objectives in my experience it’s pretty clear who is speaking your language and who isn’t right/full of shit",
                    "replies": [
                        {
                            "author": "DepartureSlight2227",
                            "text": "My point is no one applies to that role in first place. We have 5 to 6 openings of different roles on our website. BDE being on of it. But there is no single candidate applying to that role. Do you also face the same?",
                            "replies": [
                                {
                                    "author": "NoImpression335",
                                    "text": "Not recently but I know that pain. Is it heavy on the commission side of compo or is there a limited earning potential? Are you clear on how you’d see the role working? If it’s literally getting nothing then it’s more of a marketing issue, do you have metrics on the number of views of the ad?\nReally obvious suggestion but have you tested the application process? Is something broken?"
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ranataha_",
                    "text": "Honestly as a founder I shifted myself from development side to sales side, as in initial stage of your own business you need to work on everything on your own. As if you look to hire people with impressive experience and skills they would also need a financial incentives to give their all to you business. I remember working for sales and development both in my own business for 12-16 hours a day."
                },
                {
                    "author": "Crazy_Cheesecake142",
                    "text": "you say what you do....and then, you share how you're planning on doing it."
                },
                {
                    "author": "FunFerret2113",
                    "text": "I have interviewed 200+ SDR and BDRs and hired a couple of them (both good and bad hires). \n\nA weird pattern I realised is the ones that are hungry for money will be good at it and will be trainable. \n\nIt sounds weird maybe but that's just a salespeople trait. \n\nSee how interested they are in personal finance, investing, do they remember their previous commissions etc.\n\nFind them! Even if they are from a different industry.",
                    "replies": [
                        {
                            "author": "NYCandrun",
                            "text": "Why is that weird? Why would you ever want a salesperson who isn’t money motivated?",
                            "replies": [
                                {
                                    "author": "FunFerret2113",
                                    "text": "I am a sales guy myself... Have seen enough people judge sales folks when they do shit like calculating their incentives etc... \nI am just saying from that perspective."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MysteriousVehicle",
                    "text": "Similar to funferret. Ive interviewed several hundred, hired five, most werent not great. close.com has a helpful sales interviewing sheet. Money hungry is important in the sales role. Gamification helped as well. Sales development by cory bray was helpful but being ten years old some of the tactics may be out of date. The general principles are still useful though. Resumes are not helpful. SDRs are like goats, you need to hire at least two at a time or they get lonely. You should also have a crystal clear way for them to compete against each other"
                },
                {
                    "author": "NYCandrun",
                    "text": "What’s the job? Competent salespeople know what they’re looking for in a JD. My guess is that’s the issue"
                },
                {
                    "author": "Physical_Case6369",
                    "text": "What’s the median comp for this role typically?"
                },
                {
                    "author": "JacksonSellsExcellen",
                    "text": "Hiring the right person for sales is the hardest.  A quota killer with the wrong product won't kill quota.  And someone who has been 20% in the wrong vertical might do 200% in the right one.  Sales is really a situation where 'past results do not guarantee future outcomes' is 100% true.  \n\nRolodex hiring is generally a bad idea.  In fact, it's a terrible idea, don't do this.\n\nHire for determination and trust your gut.  If you've got someone who has done okay or even well in the past, that you like, and you think will be successful, trust your gut.  \n\nThe only hiring rule I advise, is if you're starting out, always hire 2, never one.  If you hire one, it makes it hard to figure out if it was the product, the person or something else that was the problem.  However if you hire 2, and one fails and one succeeds, now you know you've got a repeatable result, most likely.\n\nSource: I'm a VP of sales and private sales coach"
                },
                {
                    "author": "collin128",
                    "text": "I ran a process based on the book Who. We've hired a few hundred bdrs over the last few years with it. I have a Google doc with the process I created for my internal team, happy to share if you message me."
                }
            ]
        },
        {
            "title": "Are Open Source Self Hosted Options an actual threat to SaaS business?",
            "author": "Lanky-Ad4698",
            "text": "I am building a SaaS like many on here. I am trying to stay lean as much as possible with self hosted options.\n\nAnd day by day, I'm more surprised on how many open source self hosted options there are to large paid SaaS...\n\nIts kinda demotivating. But then again I'm kind of a hypocrite, I am building a reoccurring SaaS, but looking for all self host open source options to run it.",
            "subreddit": "ycombinator",
            "comments": [
                {
                    "author": "beambot",
                    "text": "Depends on where your value lies.  Plenty of people build atop OSS-enabled SaaS platforms for convenience, resiliance, cost, etc.  E.g. Our company, which is now almost 10 years old & on autopilot, pays $1000/mo for Heroku managed services.  We could build it out on our own VPS using OSS tools such as nginx, postgres, etc... but avoiding the time & effort on DevOps is huge win in convenience, cost & scalability for a company of our size.\n\nIf you're literally commercializing a OSS codebase, then I recommend at looking at examples such as RedHat for inspiration or a complete playbook.",
                    "replies": [
                        {
                            "author": "Lanky-Ad4698",
                            "text": "Yeah should I have specified, I am not building a competing project for the OSS I am using."
                        }
                    ]
                },
                {
                    "author": "UnreasonableEconomy",
                    "text": "Are cars a threat to taxi drivers?\n\nIf you build SaaS, you don't forget that the S stands for Service. That's your job, that's what you're selling. OSS on its own isn't serviced."
                },
                {
                    "author": "Monskiactual",
                    "text": "Self hosting is great for small companies that need to run lean. And great for large companies that can have a full it staff and essentially issue thier own sLA. For every one in between the cloud premium is worth it because you are only paying for a fraction on the entire it staff and hardware. That SLA is good to have especially when you are cto and you are going to be blamed if some thing goes wrong"
                },
                {
                    "author": "OutlandishnessGold77",
                    "text": "That’s the “curse of knowledge” bias. You only know your competitors (direct, such as other SaaS) and indirect (self-hosted open source, etc) because *you’re in this very market*. Classic tunnel-vision thing. Most people (your target audience) don’t even know 5% of the solutions you know. They don’t have to. Few actually do an extensive research if you’re not selling enterprise. Learn about the 5 stages of customer awareness and develop strategies to sell to each level.\n\nYou should weigh the pros and cons (for your costumer) of each type of option, sub-groups of options and each option per se. Price and pricing type, pmt options, how vertical each solution is, support and personalization depth, SLAs, certs and accreditations, branding, tech stack, partners and integrations, risk, downtime, legal matters, community support, documentation and troubleshooting, etc. There’s no one-size-fits-all solution and people are at different levels of awareness. Take advantage of that.\n\nBtw, you lack arrogance. Not the shallow and brainless bravado thing, but the logical, data-driven directions and robust evidence that backup your bold claims.\n\nFinally, learn to build moat and check out Jason Lemkin’s content from SaaStr and you’ll get more self-confidence on this.",
                    "replies": [
                        {
                            "author": "Eridrus",
                            "text": "Even enterprise customers often do not do much research. Almost everybody is (rationally) lazy and will pick a single solution and run with it rather than doing any competitive evaluation unless it is a really important decision.",
                            "replies": [
                                {
                                    "author": "OutlandishnessGold77",
                                    "text": "That’s mostly true for decision-makers though. The other mortals often need to back shit up to cover their asses in case it backfires.\n\nNot saying longer cycle time in enterprise = deeper reasoning, but yeah they tend to have a positive correlation."
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dmart89",
                    "text": "Most businesses rarely opt for self hosted. There is a cost to running services in house and many simply don't have the skills or motivation.\n\nWhether its gitlab, open source llms, db's or erp systems, they usually opt for supported versions. Open source is great but the demand for it in businesses is limited."
                }
            ]
        }
    ]
}